[
    {
        "puzzle": "他躺在草坪上，夹克被拿在手里，浸满了血。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "一个小偷偷了他的邻居，为了造成不是熟人的假象，他用夹克包着胳膊打碎窗户，但是被碎玻璃划破了夹克，还是在胳膊上割出了一大道伤口。当邻居顺着血迹在草坪上找到他时，他已经失血过多而死了。"
    },
    {
        "puzzle": "他从小害怕杏仁，但当他长大后再次拿起杏仁，他便不再害怕。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手用氤化物杀了死者，因其散发的杏仁味，死者的孩子以为父亲是吃杏仁而死。长大后死者的儿子了解了観化物，并且了解了当年的真相，于是找到凶手并以同样的方法杀了他。"
    },
    {
        "puzzle": "我怀疑我们班的乐乐喜欢我。她平时沉默寡言，也不爱和班里同学交流，慢慢地就成了一个小透明，连老师都忘了有这么一个人。可这样一个小透明最近总爱盯着我看，还对我不停地张着嘴…",
        "question_list": [],
        "answer_list": [],
        "final_answer": "乐乐可以看到鬼魂，并可以使用自己的声音驱散鬼魂。因此变得沉默寡言。乐乐在“我”身上看到了鬼魂，于是帮“我”驱散鬼魂。每天盯着“我”，实际上是看“我”身边的鬼魂。（乐乐发出的声音正常人听不到）"
    },
    {
        "puzzle": "一开始是动物然后是同类的死体最后是自己",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的男朋友死了，我与神做了交易，复活他需要五脏六腑，于是我就一直杀生来试验，最后发现，需要的是所爱之人的。"
    },
    {
        "puzzle": "终于生下了贝贝。怀孕期间，老公和妈将我软禁在卧室里养胎，哪儿也不准去。还好偶尔在老公睡着以后，我可以偷看他的手机解解闷。老公对我非常专除了妈，他和其他女性的聊天记录中没有秘密。生产后，老公开车带我回妈家庆祝。也许是生产的原因，一切结束后，我感到极度疲惫。带着宝宝的衣服和玩具，我只想尽快回家洗个澡，好好放松一下。这应该不算疲劳驾驶吧？不久后，我就被拘留了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "终于生下了贝贝。怀孕期间，老公和妈将我软禁在卧室里养胎，哪儿也不准去。还好偶尔在老公睡着以后，我可以偷看他的手机解解闷。老公对我非常专一，除了妈，他和其他女性的聊天记录中没有秘密。生产后，老公开车带我回妈家庆祝。也许是生产的原因，一切结束后，我感到极度疲惫。带着宝宝的衣服和玩具，我只想尽快回家洗个澡，好好放松一下。这应该不算疲劳驾驶吧？不久后，我就被拘留了。"
    },
    {
        "puzzle": "我发现床头柜上放着一杯蜂蜜水和一块巧克力蛋糕，原本放在床头柜的娃娃却消失不见了。我知道男友再也回不来了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的男朋友有暴力倾向，经常对我拳打脚踢，我想离开，却又无能为力。那天沉默寡言的邻居送了我一个娃娃。我知道她对娃娃动了手脚，但我也确认他爱上了我。因此我天天对着娃娃哭诉男友的暴行，连一杯蜂蜜水，一块巧克力蛋糕都是奢求。那天男友动手之后摔门而去。我不知道抱着哇哇哭诉了多久，睡了过去。恍惚中一个陌生的身影伴随着滴嗒声来到我的身边。但我睡得更安心了。（滴嗒声是血滴在地上的声音，邻居砍下了男友的手用来解开我家的指纹锁，他给我带来了一杯蜂蜜水和一块巧克力蛋糕。）"
    },
    {
        "puzzle": "一场意外后，妻子便开始把自己关在房间里，不肯出来。那天我突然听到她在嚎啕大哭，我急忙冲进房间里，却被眼前的一幕吓傻了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我很爱我的妻子，有一天我发现妻子怀孕后，就开始精心准备迎接孩子的到来。结果我发现妻子竟然出轨了。为了孩子，我暂时隐忍，但是孩子出生后我发现孩子还不是我的。愤怒之下我精心策划了一场车祸，想让她们通通丧命。谁知妻子竟然活了下来。不过她疯了，她整日把自己关在二楼的婴儿房内，我也不管她，自己只是晚上回来睡个觉，不过经常在房子里闻到一些异味。这一天，我听到了婴儿房里传出嚎啕大哭，我急忙冲进房间。一阵恶臭袭来，我发现妻子怀里抱着的洋娃娃爬满蛆虫，她竟然把死去的孩子缝进了洋娃娃里！她一边抓去娃娃上的蛆虫，一边哭喊着：宝宝别怕，宝宝别怕。"
    },
    {
        "puzzle": "我和姐姐参加妈妈的葬礼，我一见钟情于参加葬礼的一男子，回到家后我把姐姐杀了。请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我想再见男子一面。"
    },
    {
        "puzzle": "有三兄弟，关系很好经常一起睡，大哥和二哥是双胞胎，大哥病死后，三弟把二哥杀了。请推理",
        "question_list": [],
        "answer_list": [],
        "final_answer": "三弟有精神上的疾病，大哥走后，因为睡觉不习惯大哥不在，常常睡不着。所以三弟把二哥杀了，左右分成两半趟放在自己两侧，这样就像以前一样了。"
    },
    {
        "puzzle": "结婚时丈母娘告诉女婿一句话后，女婿立马崩溃说不结了。请问说了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "新娘说自己有个双胞胎姐姐，其实新娘有双重人格，主人格是暴躁，另—则是乖巧，但是新郎一直喜欢的是乖巧人格。丈母娘对女婿说的是“我就一个宝贝女儿，你一定要好好对她。”新郎才意识到新娘是人格分裂。"
    },
    {
        "puzzle": "某天夜里男寝一群人出现在废弃楼，第二天这群人全都崩溃了。请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那天夜里他们到废弃楼是想记下台阶数量，验证网上说的，晚上数楼梯会少一格，而第二天到废弃楼验证时却发现那里根本没有楼梯。"
    },
    {
        "puzzle": "我们去看她画画。有人死了。她的画很美。有画框对着我。不要动它。《最后的晚餐》楼道里消失了幅很大的画，在画里。好大的火。我逃出来了。感谢耳钉。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我们又进入了门里的世界。这一次我们要去参观女郎画画，并且在他的城堡里欣赏她往年的作品。管家告诉我们，不要去打扰女主人创作，女主人不喜欢别人碰画。仆人告诉我们，不要去顶楼，不要去六楼会成品的画作仓库。有人死了，她在六楼尽头的厕所隔间变成了一幅画。我发现房外灌木丛里有一个画框对着我。这天夜里，我想出去拿画框，却看见了女郎，她想让我进入画里，但是失败了。我在厕所照镜子时没有注意到，厕所后面藏着一个画框，但是我的耳钉救了我。我去了顶楼画室，那里画有《最后的晚餐》，不过里面的人物变成了我们，而画中消失的人，在现实中都死了。还有一幅画，现实中本该存在的一个画在这幅画中却消失了，门在那里。我烧毁了她的画，拿到了钥匙。我逃出来了。"
    },
    {
        "puzzle": "—人坐火车去临镇看病，看完之后病全好了。回来的路上火车经过一个隧道，这个人就跳车自杀了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为他看好的是眼睛的病。经过隧道，以为眼睛又看不见了。经受不住打击，自杀了。"
    },
    {
        "puzzle": "最惨绝人寰的事情发生了，但旁观者发现凶手后却笑了，请问发生了什么事？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "旁观者其实是读者，看推理小说时因为自己猜测的作案凶手和最后揭晓的结果一样，所以就满足地笑了。"
    },
    {
        "puzzle": "我的哥哥总是睡不好，于是我想了个法子让他终于睡好了，结果他醒来，却吓疯了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥都很穷，哥哥在城市打拼。我和哥哥睡在一间小出租屋内，买不起一^窗帘，哥哥本来就很累了，却每夜每夜被窗外的灯晃得睡不着觉。于是那天，我找了看起来个皮糙肉厚的人，把他杀了，割下了他完整的皮，封在了窗户上。屋内终于没有了外面耀眼的灯光，哥哥睡得很熟很好。第二天早上起来，我问哥哥说：哥哥睡得好吗？哥哥回答睡得很好，但当他看见那张我精心制作的“窗帘”，吓疯了。"
    },
    {
        "puzzle": "我生日邀请我的好朋友到我家聚会，吹完蜡烛后，我把他们都杀了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我天生双目失明，一次和好朋友冒险时，为了生存，朋友提议每人砍去一只手作为食物，所以我失去了一只手。直到我生日吹完蜡烛后，听见了朋友们的鼓掌声，我才意识到他们骗了我。"
    },
    {
        "puzzle": "在荒野外有一具男尸，他的手里拿着一根火柴，在他旁边还发现了他的行李，已知的是男子是坠落死亡的，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子和一群伙伴坐热气球，热气球出了状况，为了生存他们选择用火柴抽签抛弃一人减轻重量，男子抽中的刚好是折断的火柴，最终被扔出了热气球。"
    },
    {
        "puzzle": "经常参加葬礼的女人，推测她的身份。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人杀死了她的丈夫，并想把丈夫分尸到每个坟墓里来洗清嫌疑。"
    },
    {
        "puzzle": "有个中年老男人，他有个妻子和孩子，还有一个情人，情人总是劝他和他老婆离婚，但是老男人拒绝了他，有一天他发现情人和孩子都死在了家中，墙上还有一句话，是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老男人其实是同性恋，因为情人生不了孩子，老男人才拒绝和他在一起。情人为此非常不甘，杀了孩子然后自己切腹把孩子放在肚子里，再自杀。墙上是情人用孩子的血写的“我怀了你的孩子”。"
    },
    {
        "puzzle": "一男子在河边碰到一名渔夫，渔夫对他说了一句话，男子就自杀了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子和女友曾不小心落水过，男子没能救到女友，最终女友淹死了。渔夫对男子说的是“河里没有水草”，男子意识到曾经手中挣开的水草，其实是女友的头发，所以男子愧疚自杀。"
    },
    {
        "puzzle": "小美的父母一直告诫她不要打开地下室的门。有一次父母都不在家，小美按捺不住好奇心打开了那扇门，眼前的景象让她惊呆了。她究竟看见了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "外面（小美一直生活在地下室）"
    },
    {
        "puzzle": "一个男人走进一家酒吧，并向酒保要了—杯水。酒保拿出一支枪并瞄准他，该名男子说：“谢谢你！”然后离开究竟发生了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人不停的打嗝，酒保选择了吓他一跳的方式给他止住打嗝男人和朋友坐热汽球横越沙漠，因为热汽球重量太重，所以他们抽签决定谁跳下去减轻重量，他们划燃了一根火柴，在把烧过的火柴夹在其他没烧过的火柴里，谁抽到那根烧过的火柴，谁就得牺牲自己跳下去。"
    },
    {
        "puzzle": "有个男人头下脚上地倒插在沙漠里，手上拿着一根烧尽的火柴棒男人的死因是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": ""
    },
    {
        "puzzle": "小明又在学校犯错误了！班主任打电话告状。小明的妈妈泪流满面，狠狠地在打了这个才上初中的小孩一顿。可是小明却十分高兴，你知道为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "儿子在学校又犯错了，班主任再次打电话向家长告状。泪流满面的她彻底地感到了作为单身妈妈的难处。她狠狠地在这个12岁的小男孩屁股上拍了几巴掌，然后冲他吼道：“这一次到底又犯什么错误了？什么借口？”儿子眨眨眼，笑着说：“妈，这次犯错后就是第十次了，老师要家访，我们男老师单身很帅的哦！”"
    },
    {
        "puzzle": "一天，小明和小李一起去乘公交车，车上无比的拥挤。小李向小明抱怨人太多了，小明说：你帮我把手机拿出来就不挤了。小李如此照做，他们周围果然就立刻宽敞了，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明让小李拿出小明口袋里的手机，小李刚伸手进去拿，小明一把抓住小李的手，大声质问到：“你在干什么？”周围的乘客以为小李是小偷，纷纷与他保持距离。"
    },
    {
        "puzzle": "托马斯第一次和老婆去老婆闺蜜家，结果回来老婆就要和他离婚了，请问为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "拿了老公的iPad到闺蜜家上网，结果发现WIFI自动连上了。"
    },
    {
        "puzzle": "小李和他的女友都是美术学院的学生，而且女友的绘画技术高出小李一大截，可是期未美术考试的成绩小李却比他的女友高出很多，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "期末考试的内容是考人体画，小李和他的女友互相画对方，女友长得美丽动人，小李虽然技术不精，但还是有模有样。小李长相欠佳，虽然女友画得栩栩如生但老师看后觉得她画的比例不对称，五官变形。"
    },
    {
        "puzzle": "小明和小李即将毕也他们决定一起去旅游。他们跟随一个旅行团乘车前往目的地，不料车开到盘山公路上的时候，从树林中窜出了一帮劫匪，全车的人都惊恐万分，唯独小明和小李异常兴街，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明和小李是武术学校毕业的学生，平时苦于没有表现的机会，这次看到劫匪终手能展示一下自己的拳脚了。"
    },
    {
        "puzzle": "一天，老王和小李一同乘公交车。老王是一名年近八旬的老人，小李则是名年轻的小伙子。上车后，乘客却给小李让座，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明挤上了车后发现无人给老王让座，于是大吼一声：“快给大爷让个座！”几个胆小的乘容看见小李一脸凶相，以为“大爷”指的是小李自己，于是起身给小李让座。"
    },
    {
        "puzzle": "我开车来到了这个房间，我打开手机打了一个电话，突然外面传来了枪声，房间里的人都死了，除了我。请问发生了什么。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这个房间里的人都是罪犯，我改装了一辆车，上面放着自动循环射击的机枪，我可用手机进行控制，我打出电话后我就趴在了地下。"
    },
    {
        "puzzle": "你和朋友约着一起去吃饭，朋友说找个隐蔽地方别被发现，吃到一半，朋友炸了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "你俩是两只蚊子，在喝血，被发现后拍扁了。"
    },
    {
        "puzzle": "小美是个学生，每天上学出门后，都会发现对面三楼有个女人看着自己，几个月后，小美就没见过这个女人了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那个女子3个月前已经上吊了，而且她是一个单身女人，没什么朋友，警察破门而入发现了断裂的绳子。"
    },
    {
        "puzzle": "小明是个北方人，一天他在一片很高的烂尾楼中走着，突然他就死了，警察发现他的时候未发现凶器。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明在冬天走着，楼上一个冰柱，穿胸而死，几个月后警察发现他的时候，温度己经回升，冰化了。"
    },
    {
        "puzzle": "一女子大喊：要洒了，要洒了，我的盖子呢，问发生了什么。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "（适当时间给提示：另一个人现在在开车是个出租车司机）该女子是云南人，特爱吃蘑菇（野生菌），吃野生菌中毒了，觉得自己是一杯奶昔，去医院的路上司机一加速就紧张兮兮，紧紧按住自己的头顶，慢一点，要洒了，要洒了，我的盖子呢！"
    },
    {
        "puzzle": "一位长相甜美的女孩子羞涩又慌张的问一位路人：“你好，请问你知道这附近有警察吗？请问发生了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "路人：哎，好像没有阿。女孩子：\"那在短时间内能找到警察吗？路人：“唔，好像也不能吧”女孩子：“恩，那好吧。手给我举起来，打劫！！”"
    },
    {
        "puzzle": "你玩着手机，偶然看了眼窗外，看到一张人脸，你知道自己完了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "你在上自习课，看到了班主任的脸。"
    },
    {
        "puzzle": "在生日聚会上，小明的朋友们给小明准备了一个大大的生日蛋糕，后来，小明的朋友们都死了。发生了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明是天生的盲人，他跟朋友曾经被困在一个荒岛上。因为没有食物，朋友们提议所有人砍掉自己的一只胳膊来吃。小明照做了，但其实他的朋友们并没有砍。在吃生日蛋糕的时候，他的朋友们鼓起了掌，小明意识到自己被骗了，于是后来复仇谋杀了他的朋友们。"
    },
    {
        "puzzle": "一个男人走进酒吧要了一杯冰水，服务员却突然掏出了一把枪对着他。男人过了一会儿对服务员道谢完就离开了，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人打嗝，想要一杯冰水治疗一下。服务员用吓他一跳的另一种方法解除了他的烦恼"
    },
    {
        "puzzle": "一天夜里小明打了一个电话，接通后没等对方说话就挂了，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明在旅店休息，隔壁打呼噜声音太大让他没办法睡着，于是用内线电话内线电话吵醒隔壁，趁着他没有继续打呼噜赶紧入睡。"
    },
    {
        "puzzle": "老师给小女孩戴上了蝴蝶结，之后一个男人死去了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小女孩的妈妈有了婚外情，跟情夫约定当小女孩的父亲不在家时就给小女孩戴上蝴蝶结作为暗号，以便情夫去她家偷情。因为小女孩自己不会系蝴蝶结，所以这个暗号也就一直行之有效。而今天小女孩的老师给小女孩戴上了蝴蝶结，让情夫误以为爸爸不在家，于是就暴露了，爸爸一怒之下杀死了情夫。"
    },
    {
        "puzzle": "一个在马戏团工作的侏儒被发现死在了自己家里，周国是满地的木屑，发生了什？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "马戏团有两个侏儒，现在马戏团只打算留下一个。因为盲人侏儒更矮，所有他被选择留下来。另一个侏儒把盲人侏儒家的家具都锯短了一截，让他以为自己长高了，他知道自己将失去赖以为生的工作，于是自杀了。"
    },
    {
        "puzzle": "一个男人走进一家餐厅，点了一碗海龟汤，喝完之后他就自杀了，请问为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人和他的朋友曾经在一个荒岛上落难没有粮食，朋友割下自己的手臂做汤，骗他说是海龟汤，手臂是搏斗时被咬掉了。朋友最终死了，男人得救，喝完汤知道了朋友的牺牲，痛恨自己的懦弱，于是自杀了。"
    },
    {
        "puzzle": "一个男人在路上走着，突然冲进电话亭打了一个无人接听的电话，之后心满意足的离开了，他在做什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人是作曲家，他给自己家的固定电话打电话，利用电话录音留下一时的灵感想出的旋律。"
    },
    {
        "puzzle": "一个男人在湖边散步，遇到了一位老先生在钓鱼。这个人向老先生搭话：“水草这么多，钓鱼不会很麻烦吗？”老先生回答：“我在这里几十年，从来没看见水里有过水草。之后男人就自杀了，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人曾经和女友在湖里落水，挣扎之中被水草缠住了脚，费劲才挣脱。现在他知道一湖里没有水草，所以当时缠住他的是女朋友的头发。他想到了这一点，自杀了。"
    },
    {
        "puzzle": "因为戴了手表，他死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是玻璃公司的老板，为了展示自己产品的性能，他每次都在高层冲撞玻璃来表演。但这次他的手表表盘是蓝宝石的，于是撞破了玻璃。"
    },
    {
        "puzzle": "女人去图书馆借了一本书，翻开以后她哭了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人是这本书的作者，她在书中夹了100元，捐给了图书馆，几年过去了，她再回来借这本书，但钱还在里面，说明根本没人看她的书。"
    },
    {
        "puzzle": "妻子打开门后，丈夫死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "丈夫在修电灯，妻子开门后顺手开了灯，丈夫就被电死了。"
    },
    {
        "puzzle": "一个人关灯睡觉，第二天早上他打开窗户后自杀了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是灯塔管理员，他记错了时间，关掉了灯塔，第二天看见沉船意识到了自己的错误。"
    },
    {
        "puzzle": "一个人被发现躺在野外倒在地上的一截梯上，被叫醒之后他伤心的哭了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这个人喝了很多酒，想卧轨自杀，但醉酒中错把一截爬梯当成了铁轨。"
    },
    {
        "puzzle": "满月引起潮汐，他的推理小说被冲走了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "如果不是满月，他就会知道凶手是谁"
    },
    {
        "puzzle": "老王每天睡觉前都会把家门钥匙放在水缸里，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老王梦游，为了不让自己梦中出去，就反锁了门窗，把钥匙放在水缸里，这样碰到冰水就会醒来。"
    },
    {
        "puzzle": "小明非常喜欢拍照，一次合影中摄影师把他安排在了正中间，但他看到照片后却并不开心，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "照片跨页印在了杂志上。正中间的小明被夹在了书缝里，因此他并不开心。"
    },
    {
        "puzzle": "女人看见窗户里没有灯光，知道她丈夫死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "丈夫依靠医疗设备维持生命，女人看见熄灯了，于是知道停电了，丈夫死了。"
    },
    {
        "puzzle": "伴着舒缓的音乐，丈夫对妻子说：我爱你然后妻子就自杀了，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妻子是盲人，她的恋人是个哑巴。丈夫不是她想要结婚的人。丈夫开口说话，她发现了这一点O"
    },
    {
        "puzzle": "当他走出家，眼前突然一片漆黑，死亡也随之来临。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是一只老鼠，出门被猫吃了。"
    },
    {
        "puzzle": "爱德华和克里斯汀死在了地板上，周围是一滩水和一堆破碎的玻璃。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爱德华和克里斯汀是金鱼。"
    },
    {
        "puzzle": "小明家住十八楼，有时他回家会直接乘电梯到十八楼，但有时他会先乘到十五楼，再爬楼梯到十八楼，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明还小，按不到18楼的按钮，但他带伞的时候就能做到。"
    },
    {
        "puzzle": "音乐停了，他死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是蒙眼走钢丝的表演者，根据音乐来判断自己的进度，这次音乐停的过早，所以他摔死了。"
    },
    {
        "puzzle": "一个人走进一个房间，两分钟后他死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这个房间是电梯，出了故障，他摔死了"
    },
    {
        "puzzle": "她走到一栋房子前，知道自己已经无力回天。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她在玩大富翁，经过了对手的房产。"
    },
    {
        "puzzle": "老约翰坐火车去纽约。两周后，他在回程途中的隧道里自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老约翰是天生盲人，这次治好了病，进入隧道后以为自己又瞎了。"
    },
    {
        "puzzle": "她走出了六楼的电梯门，再也没能回来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "电梯外是墙，她被夹在了电梯门和墙之间动弹不得，就这么死了。"
    },
    {
        "puzzle": "女子外出办事，住在了乡下唯一的旅馆。她看见旅馆的床对面有一幅画，断臂的男人棱角分明，尤其是那双含情脉脉的眼睛，但第二天她却疯掉了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "床对面的并不是画而是窗户。这个藏在小旅馆的人，从小就没有右臂，而小旅馆里全是断臂人，所以这个男人，以为没有右臂才是正常人。他从窗户偷窥到了睡觉的女子，并对她一见钟情。但以为女记者有右臂是生病了。出于爱意，于是砍下了女记者的右臂。"
    },
    {
        "puzzle": "“这是最后一次了”男子说完伸出了舌头。不久后他死了，舌头还在外面。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "三男子在的场所是赌场，每赌输一次就砍掉自己的身体部位，而最后一次是指他只有舌头可以够到牌了。"
    },
    {
        "puzzle": "男子回到家不久后，突然报警了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子是个盲人，那天回家，像往常一样坐在桌上吃妻子留好的饭。因为他们夫妻都是素食主义，男子尝了便知道家里出事了。其实男子吃的是凶手用妻子的肉做的菜，并且此时凶手正在一旁看着吃饭的男子。"
    },
    {
        "puzzle": "“一天！”“两天！”“三天！”\"。。。三十五天！”\"不够用了，今天去交电费吧！”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我杀了一个人，用尸体的脂肪做了蜡烛。因为人身上的脂肪最多只能用三十五天，所以之后必须要交电费厅。"
    },
    {
        "puzzle": "我的哥哥总是睡不好，于是我想了个法子让他终于睡好了，结果他醒来，却吓疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥都很穷，哥哥在城市打拼。我和哥哥睡在一间小出租屋内，买不起窗帘，哥哥本来就很累了，却每夜都被窗外的灯晃得睡不着觉。于是那天，我找了看起来个皮糙肉厚的人，把他杀了，割下了他完整的皮，封在了窗户上。屋内终于没有了外面耀眼的灯光，哥哥睡得很熟很好。第二天早上起来，我问哥哥说：哥哥睡得好吗？哥哥回答睡得很好，但当他看见那张我精心制作的“窗帘”，吓疯了。"
    },
    {
        "puzzle": "\"你太令我失望了，我永远也不会回来了”“你太令我失望了，我永远也不会回来了”“你太令我失望了，我永远也不会回来了”“你太令我失望了，我永远也不会回来了”“你太令我失望了，我永远也不会回来了”“你太令我失望了，我永远也不会回来了”哎，我知道我遇到麻烦了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我杀了妻子，伪造证据，让别人以为妻子只是离家出走，但是写了好几遍，妻子笔迹怎么都模仿不像。"
    },
    {
        "puzzle": "“你的外卖到了”“好的”门关上后，男子惊恐地闭上了眼睛。不久后他却感到肝胆倶裂，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子独自生活，某天深夜因为饿，点了外卖，但是等着就睡着了。半夜，男子被外卖敲门声吵醒，准备下床时，听见了有人在门口的声音，并且关上了门。男子瞬间意识到家里有别人在，于是害怕地闭上了眼睛装睡。但是不久后他却听见有人在耳边对他说：“我知道你没睡。"
    },
    {
        "puzzle": "某妇产科医院的女子生下了一个宝宝，但第二天她刚抱到婴儿时却说这不是她的宝宝，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这位女子亲手杀了自己的孩子，而当天半夜护士去婴儿房巡视情况时，以为该婴儿是意外死亡。才特地隐瞒此事，用了一个也才刚出生没几天的孤儿婴儿取代那名死婴，所以女子才说这不是她的宝宝。"
    },
    {
        "puzzle": "流浪汉拿出了自己的棉袄盖在自己的身上，想要暖和的睡上一觉，路人看了都尖叫着跑了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "流浪汉有一个女儿，但是女儿因为爸爸的身份十分的讨厌爸爸，冷落他'骂他，想要逃离他。但流浪汉很爱女儿，他给了女儿他的一切，为了女儿读书到处流浪，但女儿回馈他的却是辱骂和嫌弃“为什么我会有你这样的爸爸”流浪汉想了很久，觉得为什么别人的女儿都是小棉袄，而自己的却不是，他也想要女儿变成听话小棉袄于是,，（接下来应该都懂了吧）"
    },
    {
        "puzzle": "天黑了，他笑了；天亮了，他却哭了！",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他有夜盲症，晚上妈妈都会给他吃治疗的维生素。因为胆小，每次晚上打雷闪电他都会哭，他妈妈都会勉励他“你能不能再勇敢一点”。他自卑，觉得自己不够勇敢，他想要证明自己，于是在一天下午他出了门想要独自在外过一个晚上以此来证明自己很勇敢。他在公园里睡下了，妈妈回家发现他不在家，就出去找他，找到了，想要抱他回家，但是因为晚上看不见，他以为是坏人用力推开了妈妈，不料妈妈一下撞到了水池的拐角处，意外死亡了，没了动静。他笑了，他打跑了坏人，终于可以向妈妈证明他很勇敢，他便睡下了天亮了他睁开双眼，想要把自己勇敢的事去告诉妈妈时发现，妈妈死在了他的面前，他哭了哭的撕心裂肺.."
    },
    {
        "puzzle": "当我开门后发现哥哥不见了妈妈死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我有臆想症，哥哥是我幻想出来的，他一直在我的世界里，我很爱他，他也很爱我，他和我从小一起长大。一天妈妈心脏病发了，我很着急，我叫哥哥去给妈妈拿药，看着哥哥着急的去了，我便下楼叫救护车，回家发现妈妈己经死了，哥哥也不见了，哥哥为什么不救妈妈呢,,,，"
    },
    {
        "puzzle": "一个酒店的派对上，大家玩的都很嗨，派对结束，有一些人死子，其他人活着。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "一群人在酒店开派对，酒店游泳池里的水被大家换成了非牛顿流体，这种流体遇硬则硬，遇软则软，很好玩也很有创意，派对上大家都吸食了笑气，所以大家很嗨很兴奋，由于一些人笑气吸食过多，导致产生了幻觉，一些人进入泳池后忘了要给流体施加压力，使自己不陷下去，等到流体到他们口鼻处时，再挣扎，周围流体变硬己经很难挣脱了，最后，室息而亡。而活着的人都有轻微幻觉出现，知道派对结束，才发现出了意外。"
    },
    {
        "puzzle": "在荒野外有一具男尸，他的手里拿着一根火柴，在他旁边还发现了他的行李，已知的是男子是坠落死亡的，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子和一群伙伴坐热气球，热气球出了状况，为了生存他们选择用火柴抽签抛弃一人减轻重量，男子抽中的刚好是折断的火柴，最终被扔出了热气球。"
    },
    {
        "puzzle": "经常参加葬礼的女人，推测她的身份。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人杀死了她的文夫，并把丈夫分尸到每个坟墓里来洗清嫌疑。"
    },
    {
        "puzzle": "有个中年老男人，他有个妻子和孩子，还有一个情人，情人总是劝他和他老婆离婚，但是老男人拒绝了他，有一天他发现情人和孩子都死在了家中，墙上还有一句话，是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老男人其实是同性恋，因为情人生不了孩子，老男人才拒绝和他在一起。情人为此非常不甘，杀了孩子然后自己切腹把孩子放在肚子里，再自杀。墙上是情人用孩子的血写的“我怀了你的孩子”"
    },
    {
        "puzzle": "某天，男子因工作上的失误，被上司骂了一顿，第二天男子跳楼自杀的时候牙齿是绿色的。请推理",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是一个殡葬师，有梦游症和异食癖，一次弄丢了尸体所以受到责骂，为了搞清楚是怎么丢的，他用绿色颜料在别的尸体上做了标记，第二天他发现自己牙上有绿色颜料，才意识到是自己吃了。"
    },
    {
        "puzzle": "结婚时丈母娘告诉女婿一句话后，女婿立马崩溃说不结了。请问说了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "新娘说自己有个双胞胎姐姐，其实新娘有双重人格，主人格是暴躁，另一个则是乖巧，但是新郎一直喜欢的是乖巧人格。丈母娘对女婿说的是“我就一个宝贝女儿，你一定要好好对她。”新郎才意识到新娘是人格分裂。"
    },
    {
        "puzzle": "某天夜里男寝一群人出现在废弃楼，第二天这群人全都崩溃了。请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那天夜里他们到废弃楼是想记下台阶数量，验证网上说的，晚上数楼梯会少一格，而第二天到废弃楼验证时却发现那里根本没有楼梯。"
    },
    {
        "puzzle": "一女子大学放假期间，因兼职没回家住，一天夜里听见楼下有声响和开门的声音，就马上躲到了床底下，第二天却发现死在了床底下。请推理",
        "question_list": [],
        "answer_list": [],
        "final_answer": "宿舍楼曾经有位跳楼死的女孩，这天刚好是死去女孩的头七，她回来是想找个替死鬼，而女孩是跳楼至死的，所以回来的样子仍然保持身体倒着向下的状况，进门时刚好就和躲床底的女子对视上了，所以女子吓死了。"
    },
    {
        "puzzle": "一男子在船上突然挥起斧头把所有人手都砍了，为什么。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "船上遇难了，为了不掉入海里，所有人都抓着船只，男子为了自己活着，砍掉了所有抓着船只的手。"
    },
    {
        "puzzle": "坟墓里埋了一个男子，旁边放了一个洋娃娃和笔记本，笔记本写了一句话，是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子有个病死的女儿，为了悼念她，把女儿做成了洋娃娃，妻子无法理解丈夫的做法，所以杀了丈夫，把他们葬在了一起，笔记本上写的是“你们可以永远在一起了”。"
    },
    {
        "puzzle": "—名男子独居，邻居是一对夫妇。两家人的房子中间隔了一片草坪。某夜，隔壁夫妻吵架声吵醒了睡着的男子，接着他听到了摔东西声，斧木头声，牛吃草的声音。过了会，男子又听到了有人撞他家门的声音，他都没有理会又睡了过去。第二天，他发现隔壁女主人惨死在他家门口。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "昨夜邻居夫妇吵架，争执中男主人用斧头砍断了女主人的四肢和舌头。牛吃草的声音，其实是女主人用嘴啃着草皮一点一点向隔壁男子家移动的声音，而撞门声则是女主人为了求救，用她还存在的上半身撞击他家门发出的。"
    },
    {
        "puzzle": "小女孩和他的外公外婆一起生活，有一天小女孩在家看电视时听到了外面稻田有镰刀的声音，不久小女孩到了稻田里，过后就对千活的外婆说了一句话，外婆听完就自杀了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "外公重男轻女，对女孩非常不好，为此外婆杀了外公。外婆为了清除尸体，把外公粉成了稻草人，井让鸟啄食尸体。声响其实是外婆用镰刀杀掉外公发出的，小女孩以为稻草人就是外公，所以对外婆说了句“外婆，外公不会痛吗？”外婆听完因愧疚而自杀。"
    },
    {
        "puzzle": "女子有一个舍友小红，胆子很小，女子经常和他舍友一起对小红作恶作剧。某天清晨，女子被室友的尖叫声惊醒，睁开眼后，她却说不出话来，过后又看到天花板上写着一句话，是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小红经常被室友的恶作剧吓得不轻，小红为了报复，用绳子绑在宿舍顶上的风扇上，再上吊自杀。清晨，女子被舍友惊醒，一睁眼就和小红四目相对，只见尸体随着扇叶转动看着她们，天花板上写着“这次，吓到你们了吧”"
    },
    {
        "puzzle": "最近保姆总是偷懒，家里乱糟糟的，我跑去客厅跟父亲告状，父亲却说：“我们家没请保姆。”，我回到卧室质问保姆，保姆却说：“你爸爸已经去世_年了，今天是他的忌日。”我到底该相信谁？于是我冲出家门，正好撞见邻居张阿姨，张阿姨的一席话，让我彻底崩溃了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸去世后，我因过度思念常常幻想他在世的场景，久而久之，分不清幻想还是现实的我患上了人格分裂，但由于缺乏照顾，我便幻想出一个照顾我饮食起居的保姆。那天邻居张阿姨说的是“最近小区招人盗窃，你一个人要注意安全。”"
    },
    {
        "puzzle": "圣诞节那天，男子去挨家挨户送礼物，直到礼物送到了一户人家后，他突然就想到明年不用再送礼物了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子有个先天五官扭曲的弟弟，没有人愿意和他玩，而他与弟弟是连体婴，弟弟的头在他的后背上，所以他永远无法自己陪弟弟玩。哥哥为了让弟弟摆脱孤独，每年圣诞节就会送礼物给每户的小孩来讨好他们，但是无论怎么讨好，小孩都会被弟弟的样子所吓到。那天哥哥终于找到了一户不会被弟弟样子吓到的失明小孩，所以绑架了小孩让他永远陪伴弟弟。"
    },
    {
        "puzzle": "某天一女子坐在家里的新沙发上看电视，看到一半突然发出撕心裂肺的尖叫，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "新闻播报一个狂热粉丝为追星，把自己的皮剥下来，做成人皮沙发送给了明星，女子突然意识到那个明星正是她本人，而她本人正坐在那个沙发上。"
    },
    {
        "puzzle": "一女子某晚进了公厕，里面的灯很昏暗，只见厕所里刚好还有一人，女子打了声招呼便匆忙地进了隔间，第二天，警察因昨晚相同时间厕所发生了杀人案而找上她，质问了她当时为什么没有报警，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手在厕所刚杀完人，就听见外面有人进来，为了不暴露，打扮成了在拖地的清洁工，由于灯光的昏暗，女子打招呼所看到的拖地清洁工，其实是凶手倒立着死者，用死者的头发在拖地。"
    },
    {
        "puzzle": "某夜男子刚潜进一屋，就忽然听门外楼梯有咚、咚、咚的声音，便匆忙地躲到床底，门开的一瞬间，肝胆俱裂，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子的身份是小偷，那天潜进了一个杀人犯的屋子，杀人犯当时拖着一具尸体往楼梯上走，咚咚咚的声音是尸体头被倒拖着撞到每层台阶的声音，进门时杀人犯倒提着尸体进来，躲在床底的小偷的目光与尸体倒立的头四目相对，于是吓得魂飞魄散。"
    },
    {
        "puzzle": "生活拮据的孤寡老人，被发现死在家中。生前好像正在吃饭，尸体被发现时已经残缺不全，屋内的景象也很诡异，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老人养了很多流浪猫，邻居感觉很臭又扰民，在鱼里下了毒，告诉老人鱼快坏了，给猫吃。老人认为鱼还很新鲜，做了吃，却被毒死在家中。而猫被锁在家里，由于饥饿吃了主人有毒的尸体，也死了，最后臭味太大被人发现。"
    },
    {
        "puzzle": "某男子喜欢一女子好久了，女子提了一个条件说只要他做到她就答应做他女朋友，后来他做到了，而女子却疯了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女子其实也喜欢男子，但因为男子成绩非常不好，为了鼓励他，约定了和男子考进同所大学。最终女子一个人上了医学院，男子却没考上。女子疯了是因为没想到男子却是以解刨课的人体老师身份和她进了同所大学。"
    },
    {
        "puzzle": "夜里一栋高楼里，女子正在阳台晒衣月艮，随后她无意看向了对面楼，瞬问毛骨悚然。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女子看到的是对面楼一桩正在进行的杀人事件，而杀人犯也发现了目睹这个过程的她，女子瞬间毛骨悚然是因为杀人犯正在数她所在的楼层数。"
    },
    {
        "puzzle": "连续好几个月的装修声吵得我睡不着，精神恍惚，老觉得有人偷窥我。昨天终于没有了，真好。今天约朋友庆祝，喝醉了。朋友半醉送我回家，电梯坏了，我们爬楼梯终于到了家。我：“咦，家里有点不对劲？”朋友说。“你喝多了，别担心，反锁好门。我先回去啦。而第二天，朋友发现我失踪了，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我曾经拒绝了一个有钱的追求者，追求者因为不甘，高价买下了楼下的房子。听到的装修声就是他装修房子的声音。追求者每天都跟踪我，在我不在家的时候就安排人进入我的房子，并且一比一按照我家的装修，装修他的房子，还将我家的门锁一起装到了他家。那天跟踪我的时候，他发现我和朋友都喝醉了。于是弄坏了电梯，并且将楼层的提示更换了。因为电梯坏了导致我们走错楼层，进入了他的家。等朋友走后，我便被突然出现的他囚禁了起来。"
    },
    {
        "puzzle": "女孩独自在家，爱犬陪伴她。半夜她听到了滴水声，为了不害怕，她把手伸在床边，让爱犬舔了舔手，安心睡去。第二天早上起来却崩溃了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手杀了她的爱狗，并把尸体吊在天花板上，滴水声是滴的爱狗的血，而舔手的其实是凶手。"
    },
    {
        "puzzle": "邻居家新来的小女孩经常找我一起玩。最近小女孩家里开始养猫，她就不再找我玩了。于是我悄悄杀死了所有猫咪，果不其然，小女孩今天来找我去她家吃饭。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小女孩父母经常吵架，邻居受不了他们，父母就带着小女孩搬到了我的隔壁。因为父母忙于工作，小女孩只能找我玩。一天父母闹矛盾，父亲失手杀死了母亲。父亲就开始养猫喂尸抛尸，小女孩有了玩物，就不找我玩。我把猫杀了之后，尸体不能达到处理，所以她爸爸便让小女孩邀请我去她家吃饭，借此处理完剩下的尸体。"
    },
    {
        "puzzle": "同学们给小明过生日，众目睽睽之下小明却被利器刺伤死亡，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有的蛋糕需要造型，里面会用竹签或者类似的利器固定。订蛋糕的同学为了给小明惊喜就定了一个造型奇特的蛋糕，里面有利器。然而有的同学并不知道，在给小明唱完生日歌后，将小明的头据进了蛋糕里，利器刺穿了他的头颅。"
    },
    {
        "puzzle": "一位富豪给她心爱的妻子打了一通电话，于是妻子就死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "富豪家里进了小偷，富豪打电话时妻子正躲在某处，由于手机没有静音，铃声响起暴露了妻子的位置，妻子就被小偷杀了。"
    },
    {
        "puzzle": "女子上厕所，进去以后看见厕所门上写了句“不要往左看”，她就往左看了，看见左边墙上写“不要往下看”，她又往下看，地上写着“不要往后看，后面有鬼”，她又往后看，发现什么都没有。她上完厕所就去洗手，洗着洗着突然毛骨悚然，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女子突然意识到地板上所写的“不要往后看，后面有鬼”对应的不是女子的背后，而是头顶上面。"
    },
    {
        "puzzle": "一个大城市里发生了一起凶杀案，一周后，一个母亲来报案，她的女儿也死在了家里。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女生是在外打工，母亲看到新闻很担心女儿所以过去陪她，结果进门发现女儿真的被杀了，悲痛万分的同时她想起了第一个案子，她怕在这种地方案子太多警察办案不力抓不到杀死女儿的凶手，所以她没有立刻报警，而是花了一天的时间在家将女儿分尸了，希望以碎尸杀人案这样的噱头引起媒体的关注和社会舆论增压来让警方快速破案。"
    },
    {
        "puzzle": "母亲打了一通电话杀死了女儿。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女儿忘了关煤气，听到电话铃声以为是门铃的声音，于是去开门，开门产生的摩擦产生的火花引爆了空气中的煤气。"
    },
    {
        "puzzle": "当我们开着救护车赶到食物中毒的那户人家时，见到的是一幅地狱般的景象。所有的人连站都站不起来，脸上全无血色。我们打算将危险性较高的老人先抬上救护车，但是全家人却异口同声的大叫“他没关系的！”，这到底是怎么一回事？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这一家人正在参加老人的葬礼，不幸食物中毒了。"
    },
    {
        "puzzle": "看似恩爱的一对抱着个婴儿坐飞机，实则犯下了恶劣罪刑，被一个观察力敏说的空姐发觉。请问发生了什么事？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那对夫妻怀中的婴儿是死的，他们利用小孩的身体藏毒。空姐因为婴儿一直不哭所以产生怀疑揭开真相。"
    },
    {
        "puzzle": "东京奥林匹克闭幕时的真实事情。听说当时有放了不到一个小时的烟火，而且也不是很精彩。但是计划这场烟火的工作人员，却对燃放烟火的成功感到高兴。这到底是怎么回事？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "燃放烟火的目的是为了让观众因为观赏烟火，而不会同时涌出场馆，以免产生踩踏事件。"
    },
    {
        "puzzle": "在自家二楼身着泳装死亡的女性，五十二岁，被返家的丈夫发现。在她的身旁，掉落一*圆形的棕刷。她到底发生了甚么事情？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "该女人拿着刷子趁着下大雨去清洗阳台，为了避免弄湿衣服，她穿了泳衣，但风突然把阳台的门关上了，而阳台的门一是内栓的，于是那个女人就穿着泳衣在大雨中呆了接近十个小时，加上她的年龄原因，她被冻死了。"
    },
    {
        "puzzle": "在一旁工作的同事身上的衣服破掉瞬间，他便领悟到同事即将死亡，而感到惊愕万分。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他们在外太空工作。"
    },
    {
        "puzzle": "篮球明星A先生。因为他的女友怀孕了，而使得他被NCAA取消了选手资格。这到底是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他的女友是兴奋剂检验人员。女友因为怀孕不能工作，于是他被检查出服用兴奋剂而被取消参赛资格。"
    },
    {
        "puzzle": "日本传统的房屋的门一般是向内打开的，而现代的公寓式房子的门一般是向外打开的，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "传统的房屋在门外还有玄关，玄关上一般会放鞋子，所以门向内开；现代公寓式的房屋没有玄关，而且一般会在屋内门口放鞋柜，所以门向外打开。"
    },
    {
        "puzzle": "古代中国贵族妇女的纽扣一般是缝在右手边的，而平民女子的纽扣一般是缝在左手边的，为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "贵族妇女的纽扣缝在右手边，是为了方便侍女帮她穿衣服；平民女子的纽扣缝在左手边，是为了方便自己用右手扣上纽扣。现代人一般是自己穿衣服，所以纽扣一般缝在左手边。"
    },
    {
        "puzzle": "那年冬天，城里饿死了无数的人，山区的小镇却突然欣欣向荣了起来。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那年闹饥荒，城里粮食紧缺，城里的人纷纷回到山区回到农村想要种粮谋生，山区小镇的人动了歪心思，将返乡的人们杀掉埋在土下化为肥料，肥沃本贫瘠的土壤，植树造林。拥有人肉肥料滋养的树木生长好品质好，小镇的人靠卖高等木材赚了不少钱，小镇由此欣欣向荣了起来。"
    },
    {
        "puzzle": "下雨天，小A路过一户人家，看到了把旧伞，于是向对方借了过来；后来，那户人家被捕了，警察质问小A为什么没有报警，可小A却没有发现异常。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小A患有红绿色盲（红绿色盲会把红色、绿色看成黯淡的棕灰色），那把伞沾了血，呈红色，但她由于色盲没有发现，问对方：“请问您能把这把棕灰色的伞借给我吗？”对方知道她没发现自己杀了人，所以放过了她，否则她可能有生命危险。"
    },
    {
        "puzzle": "小王上学的路上有一颗古树，常有人往古树系红飘带以求姻缘。有一天小王晚归，在树下远远看到一对情侣相拥站在树下许愿祈福。第二天小王去上学时经过树下，发现士壤湿润，沾了一脚泥，遂报警。警方接警后当即抓捕那个男子，请问为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人勒死了女人，而被勒死的人会失禁。"
    },
    {
        "puzzle": "程序员小王家附近有一个公园，小王每天加班回家经过公园时都能看到公园滑梯旁站着个穿着格子衫一脸惊恐的小孩。有一天小王没有加班，心血来潮的去滑了那个滑梯，滑下来后小王大惊失色。请问小王看到了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小王看到了下班回家时的自己"
    },
    {
        "puzzle": "小王下班回家，在小区门口看见一个喝着啤酒，和自己穿着同样衣服的男子匆匆离开。然后小王回到家中，想喝一瓶啤酒，打开冰箱后却情绪崩溃，惨叫出声。请问发生了什么？小王为什么会崩渍发出惨叫？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小王家被入室盗窃了，女朋友被分尸放冰箱里"
    },
    {
        "puzzle": "警察带走了我的女朋友和她的双胞胎妹妹，原因是因为我，请推理。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我喜欢的女生有一个双胞胎妹妹，但是没想到她妹妹也喜欢我。这天，女生叫我下班去她家，要我在她和她妹妹中做一个选择。我怀着忐忑的心情走到了她家的楼下，看着漆黑的楼道心里有了一丝的迟疑。最终我下定了决心。毕竟又不存在两个我。走进她家的一瞬间，我感觉到背心传来一阵刺痛感。眼前传来一阵昏厥感。最后，我看着另一半的自己，耳边传来姐姐妹妹满意的笑声，原来,，是可以存在两个我的。"
    },
    {
        "puzzle": "画家接到了一个电话，他看着桌子上的一幅美人鱼画作，突然哭了起来？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "画家是单亲爸爸，因为儿子整天找妈妈，就和儿子说妈妈是画中的美人鱼。年幼的儿子当真了，从小就说要去水里找妈妈，因为这个事情，被送进了精神病院。画家接到精神病院的来电，告诉自己儿子自杀溺水身亡的事情，看到桌子上的美人鱼画作，画家悔不当初为什么没有早点发现儿子的精神问题或者解释清楚，导致儿子自杀。"
    },
    {
        "puzzle": "在一间医学院里，ABC是舍友，A的成绩很好，是班里的班长。B的身体比较虚弱。有一天有人发现AB的遗体，C疯了，请推理出故事全貌。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "学校最近有一门解剖考试。A有梦游症，并且可以在梦游中学习知识，所以成绩优秀。因为是班长所以备有解剖室的银匙，B因为担心考试挂科等大家都睡觉后偷了A的钥匙到解剖室独自练习，身体虚弱的B在练习完后索性睡在了解剖台上连门都没有关。当晚A梦游到解剖室打算进行“解剖考试”。梦游中的A把B当作实验尸体把四肢绑解剖台上一点一点的解剖。当A醒来后发现自己已经把B解剖得不堪入目，按受不了事实于是用刀自杀。室友C一早起床发现AB不在，非常担心于是就出去找，直到在开着门的解剖室发现了血肉模糊的B和自杀的A,吓疯了。"
    },
    {
        "puzzle": "有一个小镇陆陆续续失踪了几十人，同时小镇多了许多蛛丝。问：人为什么失踪，蛛丝与失踪有什么关联，人失踪后发生了什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小镇后山上住着一个男人，因为长得漂亮被人嫉妒毁了容，厌恶一切长得漂亮的人，所以去小镇把人拐进了他的住所，因为毁他容的人害怕蜘蛛，所以把那些人的脸割了下来缝在了经过他的研究后体型变大的蜘蛛上，并用那些人的血饲养这些蜘蛛。但这些蜘蛛的胃口越来越大，且越来越挑。那几十人因为失血过多而死，但那些蜘蛛不愿吃死人的血，需求量越来越大，但拐来的人都死了，小镇上因为失踪人口太多加强了管理，男人都进不去，更何况是偷一个人出来。那些蜘蛛越来越饿，一天饿极了就把那个男人吃了，然后逃出了房子，去了小镇寻找活人，留下了蛛丝捕猎"
    },
    {
        "puzzle": "在展览会上，它吸引了众多人的眼光，它是多么的动人。可是过了一会儿，人们都被它吓跑了，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这是一个冰雕展览会，雕刻家们通过展示自己的作品然后让收藏家们高价买入。她原是雕刻家的助手，雕刻家正苦闷于展览的作品，可当他看到助手的笑容很动人，于是产生了一种恐怖的想法。雕刻家通过一些手段将助手做成了冰雕，固定了笑容。为了不让助手暴露出来，他特意弄上加了颜色的冰块。成品让雕刻家感到十分的满意和自豪。可展览会里面的制冷器突然坏了且没有备用方案，随着冰融化了，助手的脸渐渐露了出来，且没有一丝丝的血色，人们看到后吓坏了。"
    },
    {
        "puzzle": "他在小卖部买了一批打折零食，感觉自己赚到了，暗暗自喜。第二天看新闻时，他被吓傻了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他之前在这家店买过一次零食，价格比较高，觉得是老板娘多收他钱了。下次去时，是一个男子在看店，他提出上次可能老板娘算错了钱，多收了一些，男子就说这次给他打个折弥补一下，他觉得自己捡到了便宜很开心。第二天他看新闻时，得知那家小卖部的店主夫妻俩被人杀害，凶手曾冒充店主代为收钱。"
    },
    {
        "puzzle": "小明见到许久未见的父母，第二天疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明有个谈了一年的女朋友，两个人无论是性格还是生活习惯，都异常契合，，于是两人开始同居了。有一天女友让小明上家里见见父母，说有惊喜告诉他。小明一看到女友的家人，就认出了是自己失散多年的亲生父母本来想着要怎么和女友说清楚，第二天女友告诉小明她怀孕了，所以小明疯了。"
    },
    {
        "puzzle": "“疑似胁迫，疑似不完整，已自动报警。”警察来了，我和妻子面面相觑。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和妻子买了一个有面部识别功能的防盗门。今天我带着妻子回家时，系统直发出“疑似胁迫'疑似不完整”的提示，并自动报了警。询问防盗门厂商后，我才知道，这些都是他们的专利技术：面部识别能够通过细微的面部表情判断解锁人是否处于被胁迫状态，同时，如果仅提供面部信息，也不能够通过面部识另IJ,出现这两种情况时，系统会自动报警。警察来时，带着从别处搜查到的，我妻子的无头尸体，而我正在家中抱着她的头，和她对视。"
    },
    {
        "puzzle": "我和认识不久的网友交换照片。看到他的照片后，我出了一身冷汗。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我最近认识了一个新网友，我们很聊得来。这天我提出交换照片，想看看他的样子。当我把自己的照片发过去后，他过了一会儿又把我的那张照片发了回来。我觉得很奇怪，当我仔细看了一下，才发现照片中在我身后的床下，露出了一只脚。这个网友，就躲在我的房间里"
    },
    {
        "puzzle": "我看到郊外别墅里那个亮着灯的房间后，吓得拔腿就跑。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在假期找了个兼职，给一个盲人家打扫卫生。这个盲人住在郊区的别墅里，那一片人烟稀少，交通也不方便，但是因为工资高，还包吃住，我就来了。我住进去之后，却总觉得有人躲在暗处偷窥我。那天晚上我起来上厕所，却发现雇主的房间灯是亮的。"
    },
    {
        "puzzle": "缓缓闭上眼睛。就用这种方式报答你们吧•“",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是农场里的一只小猪，半年前农场着火了消防员及时赶到，把我和兄弟们救了出来。现在夏天到了，农场主要把我们宰了做成香肠，然后寄给消防员表示感谢，我也算用这种方式报答他们了。"
    },
    {
        "puzzle": "我参加了我最喜欢的作者的生日会，生日会结束后，我心满意足的回到了家。当作者也回到了家时，我却疯了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是个心理变态的偷窥狂，喜欢看恐怖小说。我最喜欢的恐怖小说作者写的都是关于凶杀、分尸之类的剧情，文笔很好写得栩栩如生，我很爱看。终于到了作家的生日会，我给他送上了一支藏着摄像头的笔作为生日礼物，作者收下了。生日会结束后，作者回到家里。而我已经在家里等待许久，想通过摄像头偷窥作者的生活，没想到，却看到了令我害怕的—幕：作者家里挂满了人头四肢，活生生的凶杀现场。原来他写的恐怖小说，全是自己的真实经历°°"
    },
    {
        "puzzle": "那是一幅很美的画，画中的男子棱角分明，栩栩如生。第二天我再见到那幅画时，只觉得头皮发麻，再也夸不出一个字来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我晩上佳进一个破旧的小旅馆，进来房间以后，灯也是坏的，屋子里光线很暗。床对面有幅画，画上是个男，棱角分明，栩栩如生，就像蒙娜丽莎一样，我总觉得画中的人一直在看自己。第二天一早，天大亮的时侯，我才发现原来那个位置不是一幅，而是一扇窗户。昨晚一直有个男人站在窗户外看我，而我因为光线太暗，把他和窗框当成了一幅画。"
    },
    {
        "puzzle": "他决定给经济拮据的母亲治病，却被母亲强硬地拒绝了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "生意破产的母亲患了肾衰竭，需要有人捐献肾脏。他决定给母亲移植自己的肾。母亲知道后，强硬地拒绝了这个提议，因为他不知道的是，自己的一个肾，早在小的时候，就被因为做生意而缺钱的母亲卖掉了。"
    },
    {
        "puzzle": "山羊的胡萝I、丰收了，小白兔死了，小黑免饱了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "山羊的胡萝I、丰收了，他想分一些给小白兔和小黑兔。小黑免拿到胡萝卜就走了，小白兔则说自己不要胡萝I、，只要一些种子。第二年，小白兔没等到胡萝I、长出来就饿死了，小黑兔吃完自己的胡萝卜，正好赶上小白免的田地丰收，就顺手收了，把自己养得黑黑胖胖。"
    },
    {
        "puzzle": "我和老公吵架了，他让我带上东西滚。后来我被逮捕了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和老公吵架后，哭着说他也是属于我的，然后我把他分尸，装进了袋子里一起带走了。"
    },
    {
        "puzzle": "妹妹很乖，我很开心。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "今天是妹妹的生日，爸妈出门给妹妹买礼物之前说，如果我能看好妹妹，保证她不哭不闹，那也会送我一份一样的礼物。于是他们出门后，我把妹妹按在了装满水的浴缸里，过了一会儿她果然不哭不闹，安静地“睡”在了水里。爸妈回来之后要是知道妹妹这么乖，一定会奖励我的。"
    },
    {
        "puzzle": "女人在新租的房子里住了一段时间后，问了房东一句话，就疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人在新租的房子里发现墙上有个洞，她往洞的那边看时，发现只有一片红，什么都看不见。就这样过了很多天，她一直不知道隔壁是干什么的。某一天她问房东隔壁住着什么人，房东说，隔壁有个红眼病人。"
    },
    {
        "puzzle": "他因为喜欢开盲盒被捕",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他喜欢盲盒，又舍不得花钱买，就多次在家附近的各个小区偷快递，因为不知道包裹里都有什么，所以这样也能享受“开盲盒”的乐趣，后来他就被警寨抓走了。"
    },
    {
        "puzzle": "凌晨一点，那该死的门铃声又响起来了。她来了，来杀我了，我就知道，她不会放过我的。警察逮捕了我，说我有精神分裂。我想起来了，是我，差点杀了妻子。可是为什么门铃声又响起来了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人的妻子死了，警察怀疑是男人杀的，但是男人有精神分裂，于是为了让男人想起来，他们假扮了那个杀人的女人。在警察的不断刺激下，男人想起来了，他的确有精神分裂，也确实差点杀了妻子，于是他被抓到了精神病院。结果当晚，门铃声还是响起来了，门外真的站着一个女人。"
    },
    {
        "puzzle": "我是条美人鱼，有个很好的人类朋友。传说，吃了我的肉可以长生不老。那天，朋友割下了我的一块肉吃。朋友死了，我哭了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "美人鱼和朋友在村子里相依为命，有商人向朋友买美人鱼肉，想不到朋友偷吃一口，竟然发狂跳河。吃了美人鱼肉能长生不老的传说再也没人敢相信了。村民对被朋友被判的美人鱼同情又敬畏，美人鱼平静的生活着。只有他自己知道，那天朋友割了他一刀之后，对他说保重啊，就跳进河里死掉了。"
    },
    {
        "puzzle": "做我女朋友吧？我才不要，你一点都不浪漫。今晚我会给你个惊喜的。好吧，等我看看是什么惊喜再做决定。哇，太浪漫了吧，我答应你。她看着对面的大楼发出惊叹。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子是对面大楼的保安，为了给女子惊喜，他把大楼的居民都杀掉了，并且打开和关掉对应的灯，这些亮着的灯组成了一个爱心的形状。"
    },
    {
        "puzzle": "她身上又出现淤青了。她说喜欢我，可惜不能和我在一起她把我带到那片海，说她想自杀。这里可真偏僻啊，就算掉下去也不会有人知道吧。她身上又出现淤青了。我好害怕。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "美貌是我的利器。从我懂事起，就有无数男人为我神魂颠倒。我享受着他们爱慕的眼神，更沉迷于那种众星捧月的感觉。在这之中，有一个男人格外的帅气幽默。于是我选择了和他结婚。刚开始，我确实很快乐。可是，快乐是短暂的。没多久，我就腻了这种生活，看中了下一个猎物。我诱捕了这个男人。毕竟对我来说，这很简单，只要勾勾手指就能做到。可是，我和他之间还有一个阻碍，那就是我的丈夫。我开始伪装成被家暴的样子，并且把男人带到了偏僻的海边，暗示他可以杀了神不知鬼不觉的杀了我的丈夫。果然，我实现了愿望。在这之后，我和男人度过了一段快乐的时光。可是，我又开始厌倦了，我知道，我该开始寻找下一个猎物了。"
    },
    {
        "puzzle": "我出生的那年，世界变成了两半，一半天堂，一半地狱。爸爸是个博士。五岁那年，他们把爸爸带走了。爸爸走的时候笑着和我说，你一定会好好长大的。十岁那年，他们把我也带走了。在那里，我看到了一个畸形的怪物对我嘶吼着走了过来。我开抢打死了怪物。怪物哭着继续向我奔来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我出生的那年，由于生化危机，地球被分为了生存区和污染区。爸爸是个生物博士，被强制要求去研究病毒，但他不放心我的安危，于是以死要挟，让他们保障我的安全直到成年，他们答应了，于是爸爸放心的去了研究所。研究并不顺利，在此期间，爸爸感染了病毒，趁着还有意识，他把自己放逐到了污染区。爸爸在污染区看到了我，虽然已经过去了五年，但他还是一眼就认出了我。他愤怒又心疼的向我走过来，大声的叫着我的名字。但他忘了，自己的语言早已异变，他以为的呼唤在我听来却是可怕的嘶吼。我掏出了小时候爸爸偷偷给我的枪，用它亲手射进了我最爱的那个人的心脏。爸爸哭了，踉踉跄跄的继续向我奔来，为了不让我伤心，他假装自己是一个扑向我啃食的丧尸，而不是只想拥抱我的父亲。"
    },
    {
        "puzzle": "我喜欢哥哥，有哥哥陪着我真好。哥哥为什么咬我，好痛啊。真好，可以永远和哥哥在—起了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥都还在妈妈肚子里，哥哥强壮点，吸收了我的营养，导致我变得瘦小，最后我和哥哥变为了一体，我们共用这一个身体，世人称我和哥哥为畸形儿。"
    },
    {
        "puzzle": "我刚搬家没多久，这天，邻居夫妇邀请我去她家做客一起吃饭，吃完饭后，我回到家，想了想，立刻报警了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我受邻居的邀请，来到他们家里，发现只有妻子一个人，妻子对我说她的丈夫出差了。在餐桌上我们有说有笑，我吃得很开心，唯一不好的是餐桌上只有素菜，妻子解释道他们都是素食主义者。饭后，我们继续在聊天，途中她说她要给我做一些饭后小甜品，我跟着她去到厨房，看着她从冰箱里取出材料制作。吃完后我回到家，想起妻子说的话以及冰箱里堆满的肉，细思恐极，立刻报了"
    },
    {
        "puzzle": "女人站在卧室里，看着手上冰凉的食物，揉了揉太阳穴。\"最近睡眠太差了。”她想，这时，卧室外传来了“叮”的一声，女人脸色突然变了，大声尖叫起来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人一个人带着孩子，睡眠不足，精神恍惚，把婴儿和食物弄混了，把婴儿放进了微波炉。（卧室是婴儿房，女人尖叫时看到婴儿床是空的。）"
    },
    {
        "puzzle": "我曾经是一个水手，可我见到鱼却会感到恶心'发抖。每次都很害怕见到鱼。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我曾经是一个水手，有一次出海，因为一些原因，我的水手伙伴们一个接着一个的死去，而我们这些活下来的人为了继续活下去，我们用死去的伙伴的肉当诱饵钓鱼，一天天过去了，我们终于获救了，因为见到鱼总会想起我们拿死去的伙伴的肉当诱饵的一幕幕，所以我见到鱼会感到恶心、发抖，每次都很害怕见到鱼。"
    },
    {
        "puzzle": "他给他介绍了个漂亮女人。女人怀孕了。他们都死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“钓到大鱼了。-我听到丈夫喜不自胜的声音。“求你了媳妇，干了这票咱们下半辈子就不愁了“你是要让我肚子里的孩子去认别人当爹吗？我佯装气恼，嘴角却在他看不见的角度微微上扬。“这不是为了孩子的将来吗?咱们就干这—回在丈夫的苦苦哀求下，我假装勉为其难的同意了。计划很顺利，在他的介绍下，我很快和这个有钱人顺利结婚。不久，在他的密谋下，男人也因为“意外”逝世。“乖，你还年轻，孩子还会再有的。我们如愿得到了遗产，丈夫却想让我去打掉孩子。我知道，他在怀疑孩子不是他的。\"好，都听你的。我抹着眼泪，佯装温顺，转头却打了那个电话。第二天，他也意外身亡了。我依偎在另一个男人怀里，嘴角流露出满意的笑意。"
    },
    {
        "puzzle": "深夜，阿伟熬夜打游戏，突然晕倒在地室友急忙将他送往医院。到了医院，医生急救后表示无能为力。室友陪医生将阿伟放到了停尸间，赶忙回去通知其他人，路上却收到了让人毛骨悚然的短信。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "室友回去的路上，收到了来自阿伟手机的信息，上面写着“好冷啊，救我。室友大惊，准备回去营救阿伟。可是不一会儿，他们又收至［J—条信息。“我是医生，刚刚和你们开个小玩笑。室友更加害怕了，因为阿伟的手机并没有开指纹和面部解锁锁。"
    },
    {
        "puzzle": "她新交了一个男友，他养了一只猫。让她生气的是，对着男朋友总是乖巧安静的猫，却总是对她觥牙咧嘴，还数次咬伤她。她受不了了，于是悄悄将猫丢弃。男友笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那只猫，总是对她发出凄厉的惨叫，甚至半夜还会爬上她的床头，一双绿莹莹的猫眼，一眨不眨的盯着她。又来了，那种说不清道不明的感觉，她知道，一定是那只猫在看着她。后来，猫丢了，她才发现原来那样看着她的，是男友啊。时间过去了几个月。她趴在新的女主人床前，静静的看着她。"
    },
    {
        "puzzle": "女人在外地当保姆。一天，丈夫来看她，在女人住的保姆房里瞧了瞧。第二天，丈夫没通知女人，便来拿落在女人房间里的钱包。女人责怪丈夫，丈夫打了女人一巴掌，和她离婚了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人的妻子进城打工，在一户人家里当保姆。男人听说妻子和雇主有染。他不愿相信，于是进城探望妻子。妻子说自己住在单独的保姆间，还责怪男人一声不吭的就过来了。男人觉得自己多心了，又拉不下脸和妻子道歉，于是在钱包里留了五百二十块钱，放在妻子的枕头上。他想，最近不是流行这个嘛，妻子肯定喜欢。晚上，他美滋滋的等着妻子发现这个惊喜。可却什么也没等到。他不死心，便打电话问妻子是不是已经在自己的房间睡了，得到肯定的答复后他挂断了电话。"
    },
    {
        "puzzle": "那一天，灾难发生了，我和地球上所有人一起变成了盲人。两年后，我突然恢复了视力。正当我打算把这个消息告诉大家时，我看到了那句话。我死死的捂住了嘴巴。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这场灾难改变了一切，在这个看不见的世界里，盲人成为了所谓的“正常人”。他们组建了新的政府和秘密组织，暗中将能看见的人视为异端，用来解刨研究。两年来，陆续有人恢复视力，但在新政府的统治下，只要有人说自己看得见，便立刻会被秘密抓捕。为了救下新的视力恢复者，之前幸运逃脱的人在很多地方写下“不要告诉他们你看得见”这句话，希望之后恢复的人看到能够逃过—劫。"
    },
    {
        "puzzle": "“我想出去，这好黑呀。”“别急，我们会找到出口的。”她起身环顾四周，可是什么也没看到，她又怕又怒，于是对睡在隔壁房的老公大喊“你快出来！”女人死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人怀孕了，因为孕期经常起夜，所以丈夫睡在隔壁房间。半夜，女人听到怪声。那声音离得很近，仿佛从她的身体内部散发出来。女人怕了，环顾四周，可是一览无余的房间什么都没有。于是她大声呼唤老公，让老公快出来。话音刚落，她便感受到一阵从身下传来的剧痛。她终于明白，那是谁发出的声音了。"
    },
    {
        "puzzle": "爸爸妈妈又吵架了。镜子碎了。爸爸妈妈不吵架了。我害怕了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和爸爸妈妈搬到了新家。新家有很多镜子，阴森森的。爸爸妈妈总是吵架。一天，他们吵架的时候，把镜子打碎了。爸爸妈妈不吵架了，但他们总是把门关起来，门里时不时传出尖锐刺耳的笑声，我不寒而栗。他们总是用那种邪恶又意味深长的眼神看着我。仿佛我是一个可口的猎物。我害怕了，我知道，他们不是我I的爸爸妈妈。我打碎了镜子，希望曾经的爸爸妈妈回来，但镜子碎的那一刻，我看到了镜子前闪过一张诡异的笑脸。那是我吗?我不知道，我只知道这个世界的我，没有影子了"
    },
    {
        "puzzle": "“哥哥掉下去了！”没事，叔叔帮你去找。“啊!”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥是地下器官贩卖组织的“诱饵”，为了捕获“猎物”，我们经常在偏僻I的地段诱骗行人。这天，当我在假装哭泣时，我告诉他哥哥掉进了一个山洞里，他果然顺着山洞走了进去。只是他不知道的是，迎接他的只有早就准备好的麻袋和迷药。"
    },
    {
        "puzzle": "第一天，阿伟考了100分，妈妈奖励了他一颗糖。第二天，阿伟考了。分，妈妈打了阿伟一-巴掌，阿伟头掉了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "I阿伟家里很穷，住的是村里最破的土坯房。为了让阿伟以后出人头地。妈妈一向对他很严厉，这是阿伟第-次考满分，也是他第次收到妈妈的糖，他很开心。晚上，融化的糖果吸引了蚂蚁，他们纷纷爬，上了阿伟的耳朵，就这样，阿伟的脑子被蚂蚁吃掉了，阿伟死了。虽然阿伟死了，但他仍然记得明天的考试;于是他子被蚂蚁吃掉了，阿伟死了。虽然阿伟死了，但他仍然记得明天的考试;于是他参加了考试，可是由于没脑子，他只考了0分，就这样，他回到了家，迎来了妈妈I的怒火和巴掌。"
    },
    {
        "puzzle": "琳娜终于在这家店里找到了她心仪的万圣节面具，可她却永远的消失在了万圣节这天。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "琳娜为了过万圣节去商店里买面具，可是她去了很多家商店都找不到她心仪的面具，然而，当她路过一家万圣节商店的时候，店里的面具吸引吸引到了她，她走了进去，跟店员商讨她想要的面具款式店员让她当天晚上去取，当这天晚上她去取的时候，却被杀了，她的脸被割下来做成了她心仪面具的款式，她找到了她心仪的万圣节面具，可她却永远消失在了万圣节这—天。"
    },
    {
        "puzzle": "今天是我和她的婚礼，婚礼结束后她从此消失了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和“她”都是男的，我很想要和他一起举行一场婚礼，想告诉大家我有了另一半，想得到大家的祝福。但事实上，我的父母并不能够理解我的这种行为，甚至要我俩分手。父母年纪大了，我不愿和他们产生争执，为了安抚情绪，于是口头答应了他俩，而事实上，我在计划一件更疯狂的事情。我跟我的父母说我找了新的对象，是个女孩，马上就要举办婚礼了，父母听了很欣慰。我和男扮女装的“她”顺利地举行完了婚礼，完成了我么彼此间的一个心愿，“她”也变回了“他\"，从此不再出现。"
    },
    {
        "puzzle": "妻子在回娘家的火车上意外身亡，一年后我重走旧路，发现火车的异样，并找到凶手。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妻子在回娘家的火车上被毒杀身亡，我为了找出真相，一年来一在寻找线索，这-次我重走妻子的路线，在同一列火车上遇到一个搭讪的女人，女人是列车员，I长期在火车上活动，她借着火车倒开的规律，暗地里调换位置并下毒，以谋取钱财，我在桌子上发现了她的头发，丛而知道了她的阴谋，于是报警抓住她。"
    },
    {
        "puzzle": "女明星养了一个女儿，从小她都会时不时给她的女儿童一顶帽子有带她的女儿去医院，女儿在医院知道真相后就自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "I女明星毁过容，养女儿是为了得到移植脸皮到她自己的脸.上，那顶帽子是她自己的，时不时给女儿戴为了测量女儿头部大小，旦刚好合适，就可以带去医院做脸部移植手术。"
    },
    {
        "puzzle": "女明星养了一个女儿，从从小她都会时不时给她的女儿戴一顶帽子，有她的女儿去医院女儿在医院知道真后就自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女明星毁过容，养女儿是为了得到移植脸皮到她自己的脸上，那顶帽子是她自己的，时不时给女儿戴了测量女儿头部大小，旦刚好合适，就可以带去做脸部移植手术。"
    },
    {
        "puzzle": "“咚”“扑通”，他笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有个人想把妻子杀死，于是就去许愿池投币许愿希望妻子会掉水里，结果妻子真的死了。“咚”是投硬币的声音，“扑通”是妻子落水时的声音，“他笑了”是因为他的愿望灵验了。"
    },
    {
        "puzzle": "她很喜欢他，所以她去学了很多药学知识。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她很喜欢他，所以她去学了很多药学知识。女生从小长得很丑，她很自卑。她喜欢的男生高大帅气，她觉得自己配不上他。男生有一个漂亮的女朋友，女生就想，如果男生看不到的话:他的女朋友就会嫌弃他跟他分手了。于是女生用药物弄瞎了男生，男生的女朋友也因为男生瞎了跟男生分手，女生趁虛而入.开始照颐男生。"
    },
    {
        "puzzle": "我常喝的无糖饮料，今天推出了0.7kJ/100ml的限量版",
        "question_list": [],
        "answer_list": [],
        "final_answer": "无糖饮料本来应该是0kJ/100ml,热量.上升是因为有员工掉进了饮料机里。"
    },
    {
        "puzzle": "酒吧里的人们开心的笑了。我躺在地上。“这就是我的愿望”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "今天是追求者的生日，他约我前往酒吧参加他的生日派对，大家都玩得很开心我并没有注意到，他在我的酒里下了药，喝完那杯酒开始昏昏沉沉，于是准备回家，在出酒吧的时候被车撞死了，他看着我躺在地上对我说“这就是我的愿望”，"
    },
    {
        "puzzle": "我正在和一位老富翁相亲，我们边喝茶边聊天。当我喝完这杯茶时，我也明白了他变成富翁的原因。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她对他说，如果你这次考第一，我就做你的女朋友。全班同学听到后，默默放下手中的笔，打算交白卷。他其实不喜欢她，快交卷时就把自己的卷子撕了。她微微一笑，在自己的卷子上写下了他的名他绝望地哭了。"
    },
    {
        "puzzle": "她笑着写下了他的名字，全班沉默，他哭了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她对他说，如果你这次考第-，我就做你的女朋友。全班同学听到后，默默放下手中的笔，打算交白卷。他其实不喜欢她，快交卷时就把自己的卷子撕了。她微微一笑，在自己的卷子.上写下了他的名他绝望地哭了。"
    },
    {
        "puzzle": "老张被发现了，但他却什么也不敢做。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老张被发现了，但他却什么也不敢做。老张是个给别人维修下水管道的师傅。为.了满足自己的变态欲望，他经常在上门维修时将微型摄像头安装在女孩家的浴室里。这天，他在查看监控时，发现了他上午刚给修完下水管道的女孩在浴室里杀人的全过程。但更他惊惧的女孩在杀完人后，竟走到了摄像头面前，弯下腰来嘻地盯着镜头，伸出手比了一个“耶”的手势，随后敲坏了摄像头其实女孩早就发现了摄像头，老张不知道女孩为什么要在浴室杀人，他也不想知道了老张本想损警，但一方面女孩已知道他是谁，另一方面如果报了警，他给人安装摄像头的事也会被传出去所以他选择了沉默。"
    },
    {
        "puzzle": "门铃声再次响起，“让我看看这次又是哪个小可爱?”我笑着打开了门",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个独居的女性，最近经常有门门铃响起，我打开门总是发现一些跑掉的小孩子，我很生气，但是我一次都没有抓住他们。今天门铃又响起来了，我以为还是小孩子恶作剧，想着这次一定要抓住他们，结果等来的是杀人犯，而那些孩子正是被他收买来按我的门铃的，小孩子以为只是游戏，杀人犯正是要以此消除我的警惕。"
    },
    {
        "puzzle": "他万分小心，却还是被发现了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是个小偷，正在作案，结束后万分小心地想离开，因为脚太臭了被发现，结果被当场抓获。"
    },
    {
        "puzzle": "一刀，两刀，三刀，那个相处不久的女人还是要杀了我。傻瓜;别哭啊。。。。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是洋葱，女人切了洋葱流了眼泪"
    },
    {
        "puzzle": "每次她的直播，我都会-秒不落的全程观看，啪嗒，手机掉落....以后怕是没有机会再看到了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我疯狂的迷恋一位主播，于是我悄悄地潜进了她家，藏在她的床底下，因此，她的每次直播，我总是能第一时间知道，并且全程观看我本以为事情的发展会像之前一样顺利，直到一次意外的直播事故。她的手机不小心从支架上滑落，摔到了地上，在离我不到50厘米的距离处，-双手出现，捡起了手机我不知道这短短几秒的时间足以拍到什么，但是在她重新恢复直播后的大约一分钟后，声音夏然而止，随之一道黑影缓缓压下。没想到隐藏了这么久，最终还是被发现了，我立马掏出藏在身上的利器，刺向了她。"
    },
    {
        "puzzle": "我很庆幸自己没有赴美女的约。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在交友软件.上认识了一个女孩，每都跟她聊天，但是她突然有--天说要约我见面，我让她先发张照来看看，她发了过来，但我觉得照片太像网图，所以没有赴约。后来看到一则新闻，警察抓获了一个绑匪，这个绑匪对漂亮的女孩有很变态的执念，在他的公寓里发现了几十个女人的标本，而照片.上的那个女孩，就是被他绑架的人之一，我顿时感到毛骨悚然，庆幸自己没有去赴约。"
    },
    {
        "puzzle": "某天，一男子工作下班回到家，打开电视看新闻，然后被吓晕了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子是一名鬼屋工作人员，在这一天鬼屋打样后他负责打扫，鬼屋里有许多道具尸体而在他打扫的时候，看见了一颗非常逼真的头颅，男子没有多想，一边感叹道具制作用心边打扫，工作结束后他回来了家打开电视看新闻，新闻里播着一则失踪案件，新闻里有公布失踪者照片，而他正是在鬼屋中看到的逼真头颅被吓昏了过去。"
    },
    {
        "puzzle": "疲困的我看了一眼手机，瞬间清醒了过来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我自己一个人在外面租房子住，半夜醒来，想打开手机看看时间，却看到屏幕上显示“5次解锁失败，请在30秒后重试”，我顿时毛骨悚然，清醒了过来。"
    },
    {
        "puzzle": "我很疑惑他的肚子变得越来越大，他支支吾吾的说他无法减掉自己的啤酒肚。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "几年前，我以说出我是同性恋的秘密拒绝了一位女孩的告白。几年后，我认识了他并被他的魅力深深的吸引于是我们在一起了，但是我不知道的是，其实他就是以前告白的那个女孩，为了跟我在一起，不见的那几年她去做了变性手术变成了“他”。而跟我在一起之后他怀孕了，为了遮掩这个事实他谎称自己是啤酒肚。"
    },
    {
        "puzzle": "我的家住在18楼，晚一上我想去上厕所，突然发现阳台上有个陌生人，我以为是小偷，想去告诉爸爸妈妈，但我突然意识到了什么，马上找了个地方躲起来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我家在18楼，所以小偷很难通过阳台爬上来，而我家确确实实多了一个陌生人，我突然意识到，由于夜晚的缘故，阳台的玻璃映照出的人影让我误以为陌生人在阳台，而事实上这个陌生人可能根本不在阳台，而是在家里!想到这儿，我不敢轻举妄动了，而是立马找个地方躲了起来。"
    },
    {
        "puzzle": "在上晚自习的时候教室里突然停电了，一个男生说了一句：“别慌!”之后电力恢复了他跳楼自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "教室里有一个男生暗恋的女生，在停电的时候，男生对女生说别慌，但来电的时候他发现自己暗恋的女生抱着别的男生，他忍受不住打击跳楼自杀了"
    },
    {
        "puzzle": "小明和小黄在公园散步，突然小黄叫了一声，第二天，新闻里报道了公园里发现两具尸体。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小黄是小明的狗，有天夜晩，小明带着小黄去散步。突然发现了凶手正在行凶杀人。突然小黄狂吠了起来。被凶手发现了。凶手为了不被发现就把小明和小黄都给杀了。"
    },
    {
        "puzzle": "一名男子被他养的蛇给咬伤而死亡了。其他人以为他是中蛇毒身亡，但是侦探调查案件的时候发现男子并非中蛇毒死亡而是他杀。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是名富翁，儿子为了继承家产谋划了这一策划案。知道了父亲平时要喝点小酒，玩蛇。所以暗中在酒杯下毒，然后将蛇放出来，伪装成被蛇咬伤的情况。侦探发现伤口1周围并没有引发发黑，肿胀等蛇中毒现象。所以推断不是意外而是他杀。"
    },
    {
        "puzzle": "有个明星给了粉丝签名，当天晚上就死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "当天是该明星的粉丝签名会，而她正是最后一个签名的人，她认为如果我手里的签名是最后一个签名，卖出去价格肯定很高。于是就决定杀死那个明星。"
    },
    {
        "puzzle": "小美的室友小小非常喜欢画画，可她最近说自己画得不好，画纸都已经塞满了垃圾桶。有天，小小对小美说，我终于画出满意的画作了。然后小美就报警了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小小非常热衷余画图，而且喜欢用红色的颜料。有天小小突然不小心割破了手流出了血。可她好像却觉得没啥疼痛感，反而兴奋了起来。她说找到了最喜欢的，颜料，后面他开始自残用血来画。可是这远远不够。于是他开始杀人，用血来画画。最后画出了满意的画作。小美知晓这切切。于是报警了。"
    },
    {
        "puzzle": "我才不敢下去呢?男子对身边的女子说。女子说，不会游泳还来海边干什么你刚刚笑手:霸拿蔷姿季来漫標的看笑了吧。男子问女子。女子惊恐的看着男子。第二天女子的尸体在海边找到",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子因为从小在水里溺水，而周边的人没有救他且在那里嘲笑他于是暗自发誓以后要把嘲笑自己不会游泳的人给杀掉。长大后，男子来到海边，寻找嘲笑自己不会游泳的人。然后把她杀掉。而刚刚那一幕则是男子寻找目标的过程。"
    },
    {
        "puzzle": "小美去了另一个城市餐厅吃饭，回到家后听到了\"嘀嘀嘀”的声音后就搬走了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小美是自己一个人住的，有天去了另一个城市吃饭然后那个服务员给小美说，你忘了关水龙头。小美以为是玩笑。可回到家后，真的发现没有关。所以立刻搬走了。"
    },
    {
        "puzzle": "小美是名跳伞运动员，有天去参加跳伞比赛，死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小美是本次大赛最有可能破纪录的选手。而负责她跳伞的工作人员正好是记录保持者，为了能够让这个记录不被打破。所以决定在小美的跳伞工具中做了手脚。然后出现意外导致了小美死亡。"
    },
    {
        "puzzle": "女演员找到一位医生，治疗过程中女演员的包掉了一件东西，医生低下头伸手去帮她捡。背后听见女演员愤怒的对他说了一句话，然后医生就死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "该演员患上了一些心理疾病寻找医生的帮助，每次接了一部戏然后都会涉入过深角色的生活，导致了严重影响了自己的日常生活。于是她寻找心理医生的帮助。她最近接到一部戏是一个被心理医生始乱终弃，最终想要杀死了医生的角色。就在在医生低下头帮她捡东西的时候触发了她的疾病。于是起了杀少:躁狂的说到:你这个始乱终弃的男人，我要杀了你。最后该女子利用周边的重物将他锤死了"
    },
    {
        "puzzle": "小女孩生病了，爸爸带了红色的苹果给小女孩，女孩看到苹果后说了一句话。爸爸听完后震惊了，然后自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸妈妈因为不喜欢苹果，所以家里从来没有出现过苹果，有天女儿问爸爸，苹果是长什么样子的。爸爸说：“和妈妈的心脏一样”于是女儿趁着妈妈睡着的时候把妈妈杀了，拿出了心脏来看。过了几年女儿生病了。爸爸不得不买来苹果给女儿于是，女儿见到苹果就说明明就是和妈妈的心脏不一样。"
    },
    {
        "puzzle": "镜子中的女人放下手中的梳子，微笑到“我把他们给你了，你要好好照顾他们。”：",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我从出生开始，就不断接受身边人对我异样的眼神和窃语。他们在我背后的各种辱骂我听到了，我全都听到了。我遇到了一个催眠师，他教会了我催眠，于是我开始催眠那些人嘲讽我的人，让他们夸赞我但是，仅仅这样已经无法满足我了，我的内心有了一个疯狂的念头，“我要成为一个漂亮的女人”通过催眠，我抓走了漂亮的邻居和一个医术高超的医生。医生为我剔骨，抽脂，并且分别扒下了我和邻居的皮，于是我穿上了邻居的皮，我是一个不愿意让自己身上一部分的消失的人，所以我把脂肪放入了邻居的体内，剔骨做成了梳子。"
    },
    {
        "puzzle": "我哭泣着告诉爸妈我不想去上学了他们竟然同意了!那天我听见他们打电话给在我远方亲戚（我的视角）立即回房间点燃了我的被子。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "父母平常将我包得严严实实在学校里面这种打扮像个异类，被校园欺凌后，我不想去读书，但其实这种装扮是他们为了将我的皮肤保护好，给皮肤重度烧伤的我从未见过的亲姐姐，即”远房亲戚\"我的出生就是为了给姐姐皮，我就是衣服，我得知这个消息，亲手用火毁掉了我的皮。"
    },
    {
        "puzzle": "我被父母送到了-所改造坏孩子的封闭学校，里面的老师总想让我写些什么。--天我偷偷推门门看到房间里的景象，我知道我再也出不去了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "叛逆期的我被父母送进了一所封闭式学校，听说这所学校可以纠正叛逆期学生的不良行为，我进入学校后，学校并没有对我进行知识行为上的教育，而是让我每天回忆自己犯下的错误，只要能写完便可以获得自由。那天我在走廊，听到房间里传来奇怪的动静，我朝着门缝一看，里面竟然有一个跟我一模一样的人!原来，他们根本不不会放了我，而是要让克隆人取代我。而让我写下的那些我曾犯的错误将变成克隆人的记忆。"
    },
    {
        "puzzle": "我是个普通的上班族，和我爱的她生活在一起。但是一天，意外打破了平静的生活。个小偷!在我和她野餐时间偷走了我们的三明治，我必须抢回来，三明治掉落在了地上。很遗憾，我不得不杀死小偷。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个有恋手癖的男性，连环杀人犯，把被杀死的女性的手切下来带在身边，假装手是自己的恋人，每过-段时间手不新鲜了之后'我就会寻找新的手。小镇里的人在调查这些失踪案件了,但是我一直隐藏得很好，直到有--天我在外出和她野餐的时候被一个小屁孩打扰了。我匆忙把手放进了装三明治的袋子，等风波过去，我拿回袋子，打开一看，手竟然不翼而飞了!原来是那个小屁孩把三明治袋子拿混了，不行，如果他打开袋子发现手，我平静的生活就毁于一旦了，我必须得把三明治拿回来。但是在抢夺三明治的过程中，袋子被我们扯烂了，手掉在了地上，既然那个小屁孩已经看到了我的秘密，我就不得不杀了他了。"
    },
    {
        "puzzle": "爷爷在榨胡萝I、汁，想给来家里做客的亲戚们喝，结果一端出来，亲戚们都呆住了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爷爷是-一个盲人，爷爷自己一个人在农村生活的很快乐也舒适，并没有说没有了双眼就不能正常生活的道理。爷爷自己种了一大批胡萝卜，就快到丰收的季节了。在胡萝I、丰收的前•天晚上，村里有个中年人杀了人并把尸体分解成一块一块然后埋在了爷爷种的那批胡萝卜地里。爷爷第二天丰收的时候因为眼睛看不见就把尸体也一起收起来了。家里来亲戚，给客人饮用而榨的胡萝I、汁里都是鲜红的血液颜色以及汁里还有皮肤渣，亲戚们看见后全都被吓坏了。"
    },
    {
        "puzzle": "哥哥自杀了。火葬之后，我们捧着哥哥的骨灰盒，爸爸妈妈与我看着它落泪，火葬场老板来安慰。突然我发现什么，尖叫起来，几年后：“嘿，你看这家人，都是在一年里死”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老板是杀人狂，最近一次被哥哥发现了，老板威胁让哥哥自杀，哥哥自杀后老板将他杀的人的尸体和哥哥的放在一起烧以此处理掉尸体，没想到被害者有颗金牙留了下来，被妹妹发现，老板怕事情败鑫所以鲨了全家。"
    },
    {
        "puzzle": "警察走进那个房子问到一股恶臭不禁掩鼻，女尸身旁满地猩红的血，一个男婴刚刚出生婴儿一只手只有四根手指，卧室发现一具上吊自杀的男尸。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "姐姐爱上了弟弟的男友，有一天晚上趁机在他的饮料里下了迷情剂在药的作用下两人发生了关系，很快姐姐发现自己怀孕了。因为长辈给予的压力，弟弟的男友跟姐姐奉子成婚了。姐姐快临盆的时候被弟弟用铁线勒住脖子死了，弟弟想到小孩子是无辜的，剖开了姐姐的腹部把婴儿拿了出来。丈夫回到家里看到躺在血泊中的妻子跟儿子，发现孩子天生畸形，一只手只有四根手指，想到了自己因为药物作用跟妻子发生性关系的那晚，他觉得自己是造成这场悲剧的始作俑者。无法面对这一切的丈夫选择了上吊结束了自己的生命。"
    },
    {
        "puzzle": "因为工作一上的一个失误，他被老板大骂一顿。第二天他起床照镜子，然后就自杀了。死的时候他的牙齿是红色的。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他在殡仪馆工作，因为弄丢了尸体被老板骂了一顿。于是他在尸体.上涂上了红色的颜料作标记。第二天醒来照镜子时，他发现他的牙齿沾满了红色的顔料。他意识到是自己啃食了尸体，自杀了。"
    },
    {
        "puzzle": "顾客在一家汉堡店吃汉堡，吃出了一截手指。老板说是店员不小心切到了，这个店员已经离职了。警方验指纹缺发现这与国家收录的所有人的指纹不符合。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "实际上这节手指来着于一个偷渡的女子，她没有合法的身份找不到工作，只能做老板的情妇，她一真是藏在店里的地下室。老板的妻子发现了她，在争执的过程中女子受了很重的伤，她的几节手指还被切了下来，有几节手指掉入了肉酱中老板发现自己的事情被妻子知道了，赶过来时情妇已经死了。情妇没有身份，老。板是个冷酷又懦弱的人，和妻子一起处理掉了情妇的尸体。老板犯的罪包括藏隆儒的'轨一起然理情的全尚:老板犯的罪包括藏匿偷渡者'婚内出轨'藏尸，还有食品安全问题。"
    },
    {
        "puzzle": "“妈妈，求求你救救我吧，我以后会乖乖听你的话，不会再故意惹你生气，不会再故意把汽油桶藏到沙发后面害你找不到。”女儿哭着说。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妈妈是一名警察平时工作很忙，女儿为了让妈妈多陪自己经常故意闯祸吸引妈妈注意。这天女儿又闯祸了妈妈和女儿吵起来，忽然妈妈接到紧急任务，要去逮捕两个罪犯妈妈抓到了一个，另个逃走了，逃走的闯进她家，用女）L的性命要挟妈妈放了他的同伙。这时候女儿假装向妈妈求情，说不会再故意把汽油桶藏到沙发后面害妈妈找不到。虽然女儿经常闯祸但并没有故意把汽油桶藏到沙发后面，汽油桶是妈妈自己放的。妈妈听懂了女儿的暗示，假装答应打电话，走近沙发后偷偷打开汽油桶然后把它踢翻了，罪犯站不稳，妈妈趁机救了女儿杀了他。"
    },
    {
        "puzzle": "“今晚的月色真美。”他说，“你还是第次从这个角度看月亮吧。”他问身边的人，却始终没有人回应他。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他每年秋天都会会跟去山上露营赏月，今年也没有例外，但唯--例外的是，女友居然向他提出了分手，他无法接受，争执中失手把女友杀了。为了掩盖罪行，他挖了个土坑把女友埋了进去，埋尸过程中，月光洒在女友因为惊恐还没来得及闭上的眼睛上，看着眼前的场景，他发出了那样的感慨。"
    },
    {
        "puzzle": "深夜22:05我路过琴房，响起了略带生涩的琴声，次日早，其他学者发现他死在了琴房。死亡时间于当日晚10点°",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手是一位钢琴作曲家，但不是从小学习钢琴，出于资质考量，组织优先选择了死者作为主推人选，而凶手专门为幕前作曲。这一天，凶手发现所有的曲谱上作曲署名都是死者本人，前往琴房对峙，争论之下失手杀了死者。后听到脚步声越来越近，将被害人藏于钢琴下方，凶手则伪装成死者弹奏。待脚步声走远，楼栋已被封门上锁，于是凶手在琴房呆了整晚，第二天趁来人发现死者后，前去报警喊人的间隙，离开了作案现场。"
    },
    {
        "puzzle": "汉堡店前台。接到电话，他笑了，一单不在菜单上的订餐，却刚好有现成的材料。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "开汉堡店的变态店主在强奸近亲后，生下了畸形儿。一次家暴中，父亲失手杀害了一直养育孩子的母亲，但他并不打算继续抚养这拖油瓶。这天.客人在电话中提到的餐点给了他灵感。他挥刀，砍向了名为“小骨”和“小肉”的双头婴儿:名字由母亲取得，希望两人骨肉相连”，能平安度过一生。"
    },
    {
        "puzzle": "楼上的叔叔很喜欢钓鱼，鱼缸里的鱼多到跳了出来:今早楼上的叔叔好像又出门钓鱼了，不过他今天好像忘记带鱼饵了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "楼一上的叔叔很喜欢钓鱼。某天，我突然听到了楼.上叔叔家发出了东西不断拍打地面的声音，而我习惯性的以为是鱼跳出鱼缸，在地面。上挣扎着的声音。叔叔正在分解一具尸体，肉块'碎骨飞溅，伴随着刀刃与沾满血液粘稠的地面不断碰撞。那天早晨，叔叔像往常样出门钓鱼，往常装鱼饵的那个水桶，今天显得格外沉重。下楼的时候，叔叔踉踉跄跄。我想上前帮忙，叔叔却神色慌张的拒绝了。而在此之际，我却突然看到了叔叔袖口上的血迹..（叔叔在家杀人分尸，用尸块去钓鱼，毁尸灭迹）"
    },
    {
        "puzzle": "每天醒来，都有一双手在抚摸我，那手无比的温暖，直到那一天。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我从出生就看到不也听不见，只有感觉，我的母亲每天早.上都会抚摸着我的脸，等我醒来，直到那一天，有水滴从我脸上划过，那手慢慢变得冰冷。之后我才知道，母亲因为劳累，患上了癌症，为了照顾我，拖着身体没有去看病，直到那一天，母亲终于撑不住了，泪水划过我的脸颊，笑着对我说:你要好好的生活下去。随后母亲便慢慢的抚摸我，直到失去心跳。"
    },
    {
        "puzzle": "男孩:妈妈，我想要一个哥哥，这样就有人天天陪我玩了。母亲:你..你不是已经有一个了么。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妈妈和哥哥并不是\"男孩”的亲人，只是“男孩”绑架来，拼凑在一起的家庭，因为从小缺乏母爱，所以找了一个妈妈给予他缺失的母爱，因为缺少一个玩伴:所以找了一个哥哥来当他的玩伴，当它们没有扮演好自己的角色时，“男孩”就会杀了它们，然后去寻找新的替代品"
    },
    {
        "puzzle": "最近网络上总是有很多恶毒的帖子，回复率很高，他看着眼前突然弹出的帖子很不屑地关掉了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他是一个十级网络冲浪选手，他知道怎么才能制造热点来给自己增加热度。可是最近，随着越来越多的人在网络.上出彩，他开始渐渐在网络.上沉寂了。发的帖子只有寥寥几条留言。为了给自己增加流量，他开始疯狂地发帖子。“看帖不回，霉运必来。”看者不回，全家都不得好死。有一天，他一如既往地发着。突然电脑弹出了个页面，上面写着一句话:转发这个网站，不转发者第二天暴毙而亡。他很不屑，自己就是这种话的创造者，谁会相信这些恶作剧，于是他就关掉了。第二天，警方发现他死在了自己家里。死状极其恐怖，另-边，一个跟风发诅咒帖子的人也看到了这样的网页，他也是很不眉地关掉了。"
    },
    {
        "puzzle": "咚咚咚，我走出门，滴答滴答滴答，\"猜猜她在哪?”这是一个一点都不好玩的躲藏游戏，我尖叫着冲出了家门。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我躺在客厅沙发上看电视，女友正在浴室洗澡，由于我看得入迷，差点没听到浴室里的水声响，后来我被一阵敲门声引到门外，我打开门，走道上却空无一人，再关上门时，却发现床上多了一张字条“猜猜她在哪?”，我感到有些害怕，并且隐约听到滴答滴答的水声。我呼喊着女友的名字，却得不到回应，打开浴室的门，只有水龙头在流水，我又迅速的翻遍了整个房子，却找寻无果，最后回到卧室，声音越来越大，我趴到床底，发现有一-摊红色的水，顺着水潭正对的方向往。上看，是一张我女友的脸，从床底的裂口处伸出来。我吓得双腿一软，把女友的尸体从里面拖了出来，随之-张纸条滑落。“那现在该猜猜我在哪了”，我看完，尖叫着冲出了家门。"
    },
    {
        "puzzle": "女孩每天都站在对面阳台和我打招呼，我却不敢再踏进阳台了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我新搬进了-一个公寓，每天早•上去阳台晾衣服的时候，我都能看见对面公寓的阳台上站着一个女孩在对我打招呼，我很开心，每天都准时的到阳台跟她打完招呼再去上班。两三个星期过去了，一天，我突然看到一条关于我小区附近的新闻:在某间公寓阳台上发现具女尸，已经吊挂了三周了。我突然觉得有什么不太对劲，跑去阳台一看:果然女孩已经不见了，只看见几张封条，我顿时感到一阵恶心，不敢再路进阳台。"
    },
    {
        "puzzle": "我饿了，对妈妈说：“妈妈再爱我一次。”妈妈很痛苦，但是她还是同意了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我有异食癖，只能吃特定的食物:人肉。母亲很爱我，她也知道我有这个病，于是她为了让我活下去，一直用自己的身体去勾引一些男性带回家，然后杀害他们，为了让我活下去。但是，就因为这样母亲患了艾滋病，她的身心都十分痛苦。我也因为长期食用人肉患了库鲁病，导致呆，只有最基本的食欲。一次我又饿了，母亲因为患病了，无法再出去帮我猎食了，于是母亲决定最后-次喂饱我，她决定把自己喂给我吃。"
    },
    {
        "puzzle": "一个人坐火车去邻镇看病看完之后病全好了。回来的路上火车经过个隧道，这个人就跳车自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "几年前，那个人和一个朋友出去玩，遇海难漂到一个岛上。所有的食物全部吃完了，差不多快饿死了。朋友出去找吃的东西，带回了烤好的企鹅肉，而且腿在捉企鹅时受了伤。他吃了企鹅肉以后恢复了体力，搀着他朋友一起继续走。他朋友不肯吃企鹅肉，结果饿死了。现在他吃到真正的企鹅肉，知道邦时候朋友是把自己腿上的肉刻下来烤了给他吃了。"
    },
    {
        "puzzle": "一个人坐火车去邻镇看病，看完之后病全好了。回来的路上火车经过个隧道，这个人就跳车自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这个人从小有眼疾，看不见东西，他刚去医生那里治好了眼疾。他以前从来没有见过隧道，一下子眼前一黑，以为自己又瞎掉了，经受不住打击，所以就绝望地自杀了。"
    },
    {
        "puzzle": "有个男的跟他女友去河边散步，突然他的女友掉进河里了，那个男的就急忙跳到水里去找，可没找到他的女友，他伤心的离开了这里，过了几年后，他故地重游，这时看到有个老头的在钓鱼，可那老头钓上来的鱼身上没有水草，他就问那老头为什么鱼身上没有沾到一点水草，那老头说:这河从没有长过水草，说到这时那男的突然跳到水里自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "几年前，他跳到水里找女友的时候，自己的腿被些东西缠住了，就拚命的蹬，总算挣脱了那些东西。他当时以为那是水草，现在他终于明白那是女友的长头发"
    },
    {
        "puzzle": "有母女三人，母亲死了,姐妹俩去参加葬礼，妹妹在葬礼上遇见了个很PP的男子，并对他一见倾心。但是葬礼后那个男子就不见了，妹妹怎么找也找不到他。。后来过一个月，妹妹把姐姐杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为那男人只有在她们家族的葬礼.上才出现，妹妹想再见到那个男人，只能让家里再死一个人举行葬礼，所以她就制造了又一次的葬礼，妹妹就可以见到他了。"
    },
    {
        "puzzle": "有一个人在沙漠中，头朝下死了，身边散落着几个行李箱子，而这个人手里紧紧地抓着半根火柴，推理这个人是怎么死的？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "几个人乘热气球旅行，路过沙漠时气球漏气，很危险。大家把行李全都扔下去了，还不行，只好再扔一个人下去。大家决定拿几根火柴决定，谁抽到半根的谁就被丢下去。这个可怜的家伙抽到了那根短火柴，事情就是这样。"
    },
    {
        "puzzle": "马戏团里有两个侏儒：.瞎子侏儒比另一个侏儒矮马戏团只需要个侏儒马戏团里的侏儒当然是越矮越好了.两个侏儒决定比谁的个子矮.个子高的就去自杀可在约定比光个子的前一天，瞎侏儒也就是那个矮的经在家里自杀死了在他的家里只发现木头做的家县和满地的木屑",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为另一个侏儒把矮个子侏儒家里的所有家具的脚都锯了一截。矮个子侏儒看不见，一摸家具都突然矮了许多，以为自己突破长高了，觉得失去了竞争优势，从此生计无着落了。从今往后，他的演出再也上不了票房排行榜，大伙儿看了他的演出不再兴奋得歇斯底里地大叫，他好绝望于是就自杀了O"
    },
    {
        "puzzle": "有一个中年老男人，他已经结了婚，他有一个老婆、一个儿子、还有一个情人。情人总是劝他和他老婆离婚，但是老男人拒绝了。有一天老男人回到了家，儿子和情人都死了!墙.上还有用血写的一句话。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人是一个双性恋，他的情人是个男的。情人想和男人结婚，但男人很喜欢自己的儿子，以情人无法生育为由拒绝离婚，情人很嫉妒、很绝望-天趁着男人出门进到男人家里杀了丿L子，用刀将自己的肚子划开把儿子塞进了自己的肚子里，并用血在墙.上写下了“我怀了你的孩子呦”。"
    },
    {
        "puzzle": "一个人过生日，邀请他所有的好朋友来参加。吹完蜡烛的时候这个人把他所有的好朋友都杀了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男主和朋友曾经一起去探险，-段时间后没有了食物，因为男主本身是-一个盲人所以这帮朋友都骗他说每人砍下一只手来吃，可最后只砍了男主一个人的手。之后有一次男主邀请朋友们来参加自己的生日聚会，吹完蜡烛后所有人都鼓掌了，男主发现只有自己的手被砍下来吃了，男主无法忍受这样的欺骗于是杀了所有的好朋友。"
    },
    {
        "puzzle": "这天女主有了一件新衣服，这件衣服非常华丽且有设计感，仅此一件。当天晚上女主衣冠整洁的死在了回家的路上。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "衣服的原主人是一名设计师，他有特殊的癖好，不愿意自己设计的衣服有任何褶皱，但他又想让自己的爱人做模特，于是杀了自己的爱人并把衣服穿在了爱人的身上。女主是一名人殓师，女主在为死者化妆的时候觉得衣服特别好看，便扒下衣服据为己有。回家的路上被设计师看到，设计师受不了衣服有褶皱便杀了女主并摆放整齐。"
    },
    {
        "puzzle": "女主六岁那年爸爸带女主回乡参加太爷爷的葬礼在葬礼结束后女主说了句话家人们都崩溃了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女主六岁那年太爷爷去世了，女主和家人们回到老家，大家都很伤心。不过女主见到了自己的小伙伴们，大家在一起玩捉迷藏，女主还没来的及找到弟弟就被爸爸拉到太爷爷的坟前。大家在太爷爷坟前点燃了花圈，纸钱。那天太阳很大，恍惚间女主看到”了弟弟在火里跳舞。"
    },
    {
        "puzzle": "2021年10月15日晴，今天舅舅给我做了一顿我从没吃过的饭,听他们说这是肉!那种香味至今俺都还记得。多么美好的一天啊!可是听说我最喜欢的老师被发现死于家中，这让我和舅舅难受了好久",
        "question_list": [],
        "answer_list": [],
        "final_answer": "从记事起女主就被舅舅养着，女主经常遭到舅舅的殴打，I打挨饿已是家常便饭。一天舅舅出奇的给女主做了顿肉，来不及多想就狼吞虎咽的吃了起来。女主不知道的是在这之前舅舅已经把他卖了。女主把喜悦写在日记里，还没写完，人贩子就把女主带走了，过了几天老师来到家里相知要全为什么没有去上季，却奢素，安主的日己，充知遭委型墨想知道女主为什么没有去上学，却看到了女主的日记，她知道女主不会写“俺”就断定女主出事了，M舅怕事情暴露就杀了老师并把尸体拖回了老师家里，最后模仿女主的语气写完了最后两句并将日期10月5日改成了10月15So"
    },
    {
        "puzzle": "毕业后和学校里最好的闺蜜一直未见那天她来找我了!但就在那天随着“啪“的一声，我们阴阳两隔",
        "question_list": [],
        "answer_list": [],
        "final_answer": "曾经的闺蜜是女主在盲人学校里最好的闺蜜，毕业后大家各奔东西，女主在毕业后接受了复明手术（闺蜜并没有复明）-天许久未见的闺蜜来找女主，女主满心期待的开了门，可是曾经最熟悉的声音居然是从一个满脸胡渣、长相丑陋的男人口中发出的!女主无法忍受这样的欺骗于是引着闺蜜走向了天台"
    },
    {
        "puzzle": "穿着高跟鞋的她捂着自己的眼睛，和伞一起倒卧在了雪地之中",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她穿了高跟鞋，变得比平常更高了。今天下雪，所有人都在挥伞。其他比较矮的人的伞面下垂下来的'-把伞有十几个的、尖尖的地方只刚好能够到她眼睛的地方。其中一个行人的伞不慎插中了她的眼睛，将眼球从外往里挖了出来。"
    },
    {
        "puzzle": "闭着眼睛、脸色苍白的女儿坐在轮椅上，一块毛毯盖住了她的腿和脚。母亲将女儿裹着绷带的手放回膝盖上，怜惜又心疼地摸了摸她的脸。母亲心想:如果我的女儿能醒过来就好了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女儿在游泳时，被泳池内部的排水口栅栏卡住了手指，拔不出来，由于在池底待的时间太久，成了植物人。她的父亲经营一个科技公司，研发了-种令人即使没有意识也能维持生理反应的机器。本来不是给植物人用的，但是母亲坚持，于是安装在了女儿身上。女儿看起来就像活着一样，母亲于是整日照顾女儿，欺骗自己女儿总有-天会醒来。（绷带遮住手只是母亲不愿回忆女儿曾经经历了什么）"
    },
    {
        "puzzle": "我的姐姐进了医院洗胃我的爸爸从楼顶跳了下去妈妈问“为什么你们要这样”我悄悄扯了扯衣服袖子遮住手腕",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“我”是女孩子，父亲家重男轻女，但母亲生的都是女丿L,生完之后还因为生产事故失去了生育能力。她们备受歧视，母亲想在其他人面前争一口气，强迫女儿努力读书.上进，姐姐不堪压力和精神折磨自杀，死掉了，妹妹也自杀了，但还活着；母亲被女儿的死刺激崩溃了，和父亲争执，失手将父亲从楼顶推了下去。"
    },
    {
        "puzzle": "男人叹了口气，随后望向窗外，窗外一片漆黑。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人是一名宇航员，独自执行任务，自己一人空荡荡的在飞船上。每天面对的都是浩瀚的宇宙，一望无际的黑。"
    },
    {
        "puzzle": "窗外狂风夹杂着雨水，窗户不停的摆动，，窗内漆小王躺在地上身上都湿透了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小王从外面回家，因为下雨导致身上淋湿了，狂风暴雨导致线路短路，回家的小王"
    },
    {
        "puzzle": "一片森林里，一个猎人，倒在地身旁一把猎枪地上散落两个弹壳一不远处我倒在地上。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一只熊，遇到了猎人，我便冲了上去，猎人举枪就给了我两枪，但我还是把猎人杀掉了，之后我也因为失血过多死亡了。"
    },
    {
        "puzzle": "我是一名化学家，每天和毒品打交道。所以我的手每天会接触毒品，一天下班回家，我把手洗干净吃晚饭，最后我死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一名化学家，每天和毒品打交道。所以我的手每天会接触毒品，-天下班回家，我把手洗干净吃晚饭，最后我死了。"
    },
    {
        "puzzle": "我去女朋友家，发现她有很多海报，但是第二天我死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女友有怪癖，喜欢被人监视，我晚上上厕所通过需要通电的镜子，看见了她悬挂在镜子背后很多男人尸体，我以为是明星海报，第二天我问女友海报的事，她以为我发现尸体的事，把我杀了和他们挂在-起。"
    },
    {
        "puzzle": "-个员工对老板说：“今天你千万别做飞机，昨晚我梦到如果你做飞机，飞机会坠落，你会死的”老板一听，就把这个人开除了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为这个员工是工厂值夜班的，和老板说昨晚梦见如果老板坐飞机会死，老板一听就知道工作不认真，在睡觉，于是开除他。"
    },
    {
        "puzzle": "一个富豪出了10万元让一个画家给自己画一-幅画过了一段时间，富豪去世了，这幅画也被烧毁。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "富豪让画家画的是纹身，随着富豪被火化，纹身一并烧掉。"
    },
    {
        "puzzle": "小明提着星星走了出去，她回到房间中，然后哭了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "曾经小明是个有不良癖好的杀手，每当杀一个人，都会做一串星星饰品放在死者身边，后来一个女人用一切去换取小明的信任，和他结婚生子。有一天当小明回家，发现孩子死了，身边同样放了一串星星，还留了-张纸条，小明打开纸条熟悉的字迹就是他老婆的：“我迟早要让你还回来的”原来，小明的老婆是曾经受害者的亲人。"
    },
    {
        "puzzle": "6岁那年，爸爸带我回乡下参加太爷爷的葬礼，结束后我说了一句话，大家崩溃了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "6岁那年，太爷爷去世了，我们回到老家，大家都很伤心。不过，我也见到我的小伙伴，我们在玩捉迷藏。葬礼开始，我还没来得及找我弟弟，就被爸爸拉到坟前，大家哭成一片。我突然看见弟弟在火里跳舞，就喊了一下弟弟在火里跳舞，大家崩溃。"
    },
    {
        "puzzle": "早晨亲吻老婆时，我疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老婆一直觉得有人偷题她，因为刚怀孕不久，所以我也担心老婆的情绪被影响于是在家里安装了监控，但没发现什么异常。原来凶手很早就潜入家中，藏身在，床To第二天早上醒来，我向往常样想亲吻老婆，结果发现身边躺着的老婆变成了无头尸，我马上去查看监控，想知道发生了什么。原来我们睡着后，凶手从床边拿起刀把我老婆的头割了，拿着头离开我家，连肚子里的孩子也....我疯了"
    },
    {
        "puzzle": "有一天我深夜回家，发现房间里少了东西，后来妻子不见了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和妻子有个儿子，儿子经常偷穿我的大码裙子和丝袜，为了不让我发现，儿子经常无故惹怒更年期的妻子，让我以为妻子发现了我易服癖的秘密，所以对我态度很差。于是我向儿子坦言，从此携手走向女装大佬的世界。后来有一次，我和儿子在家里换装，妻子撞见了当场奔溃，于是离家出走了。"
    },
    {
        "puzzle": "小明和一一个富贵人家的小姐定下终身，一个月后，小明恢复单身贵族身份。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明以为这个女朋友是有钱人家的孩子，想要少奋斗几年，没想到女朋友是在-家叫“富贵人家”的夜总会里当坐台小姐的，所以小明气急败坏地提了分手。"
    },
    {
        "puzzle": "我懂事开始就没见过爸爸，有一天爸爸回来了，我的家庭又恢复了单亲生活。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "从小妈妈就和我说爸爸去了国外出差回不来，我这么一个聪明的孩子，自然知道这只是一个善意的谎言而已，我觉得我爸爸应该要么是去世了，要么就是铁窗了，所以妈妈和隔壁王叔叔的事情，我也是睁一只眼闭一只眼。但没想到，多年后我爸爸真的出差回来了，那天我误以为是隔壁叔叔又来找妈妈谈心事，脱口而出：“王叔叔好，我妈妈在楼上等你了。”结果爸爸恼羞成怒，把两人杀了。"
    },
    {
        "puzzle": "我和认识不久的网友交换照片。看到他的照片后我出了一身冷汗。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我最近认识了一个新网友，我们很聊得来。这天我提出交换照片，想看看他的样子。当我把自己的照片发过去后，他过了一会儿又把我的那张照片发了回来。我觉得很奇怪，当我仔细看了一下，才发现照片中，在我身后的床下，露出了一只脚。这个网友，就躲在我的房间里"
    },
    {
        "puzzle": "灰色的眼睛注视着灰色的风暴，阳光的阴暗面保护不了屐弱的花。一段视频在网上疯传后不久，她被捕了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她是一个家政从业人员，有偷窥的癖好，喜欢窃取自己服务过的客户的摄像头账号和密码，去窥探别人的生活。偶然有一次，她发现客户因为重男轻女家暴自己的女儿，甚至儿子也参与其中，但每次她去家里干活时，客户就像无事发生那样正常对待女儿，她无法帮上忙。在经过长时间的偷窥后，她决定把客户打女儿的视频进行剪辑并发布到网上，最终视频引起热议,小女孩得到了警察的保护。因为她是查看他人隐私并传播，她也被抓了。"
    },
    {
        "puzzle": "这家面馆的牛肉面很好吃，和妈妈以前做给我们的特别像。“哥哥，你尝尝这个面，有妈妈的味道呢!”哥哥吃了一口面，皱着眉摇了摇头。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小时候我家里很穷，妈妈一个人照顾我和天生有精神问题的哥哥，我们经常吃了上顿没下顿，生活非常辛苦。妈妈偶尔会在赚到一点钱或者过节的时候给我们做碗牛肉面，妈妈做的面很好吃，但是自从她在十年前的某一天失踪后，我再也没吃过那样的味道了。我觉得可能是妈妈不愿意带着我们两个拖油瓶，就扔下我们自己跑了...后来我和哥哥相依为命着长大，生活条件慢慢变得好起来。某-天我发现了这家面馆，味道和妈妈做的面很像，我很开心，带着哥哥来吃面。结果哥哥吃了面说道：“不，妈妈的味道不是这样的。”其实是哥哥在十年前把妈妈吃掉了....."
    },
    {
        "puzzle": "我看到了一只红色、正在跳舞的洋娃娃[555]它轻声对我们呼唤于是我们失去意识。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "娃娃是人做的，她被割掉的舌头没有办法说话，555是她在提醒我快跑，但我没有领会，就也被后人弄成了娃娃。"
    },
    {
        "puzzle": "他们有枪，有花。乌鸦中的白鸽，只能沦为花的奴仆，她孤注掷，风，就把她带回了家。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他们是最嚣张的犯罪团伙，手里握着强大的军火实力和罂粟花的种植面积。她只是刚从警校毕业在缉毒大队不到一年的警察。毒贩越来越猖狂，她主动请缨只身前往犯罪团伙做卧底。她在一次交易中露出了马脚，为了取得毒贩再次信任，她当着老大的面吸入了大量白粉，她染上毒瘾。那种感觉日日夜夜折磨着她。为了自己的责任和使命，也为了她残破的身体有最后-点用，她趁•上层开会的前一天晚上藏好了定时炸弹。第二天趁开会的时候。她点燃了罂粟花园后按下手中的按钮。一分钟后，“砰一。她躺在花园里，望着熊熊而来的火势，与这满园的花一起蒸身火海。风吹起了地.上的残灰，带她回家。"
    },
    {
        "puzzle": "我失眠了，因为楼上总是发出某种噪音，但询问邻居的时候邻居告诉我他并没有听见，第二天，噪音似乎离我越来越近。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个耳聋患者，和我的邻居在同一家医院接受手术而认识。为了方便治疗，我们在医院附近租住了同一栋楼内对门的两间屋子。在手术之后，我的听力慢慢恢复，但随之而来我发现租住的房子楼.上总传来奇怪的声响，并且声音离我越来越近.....我询问邻居想跟他谈谈他是否跟我一样，但他却通过手语告诉我他的耳朵似乎还是没有听觉,听不到噪音。其实我听到的叫声是受害者的惨叫，并且凶朵似乎还是没有听觉,听不到噪音。其实我听到的叫声是受害者的惨叫，并且凶"
    },
    {
        "puzzle": "门铃响了，妻子打开门，发现门口的丈夫，她看了一眼转身进了厨房。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "晚饭时间，妻子一如既往地等着丈夫回家。这时门］铃响了，她起身去开门，发现丈夫正在门口，她很奇怪为什么丈夫不直接开门呢，突然丈夫口袋里的手机响了，只见丈夫从右边的口袋里掏出手机接电话，妻子冒了一声冷汗，立刻去厨房拿刀防身。原来丈夫是左撇子，根本不会把东西放在右边的口袋，更加不会用右手去接电话，妻子眼前的这个丈夫是坏人伪装的。"
    },
    {
        "puzzle": "我在办公室用手机发了一条评论，听到手机里传来的声音，我瞬间毛骨悚然，几分钟死在了卫生间里。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个喜欢刺激的人，有一天我关注了一个主播，他直播的内容是看评论选择杀人方式直播杀人，我想着这应该是一种想要流量的方式吧，也不会真的杀人，只是演戏而已，所以我也评论了。我两三天就会看他的直播，觉得真的很刺激，感觉可以操控别人一样，我的评论也经常被他抽中。这一天，我独自一人在办公室看他的直播，评论了（杀人方式），我又被他抽中了，但是这次直播里的地方我感觉很熟悉，这不就是我办公室的附近吗!这里只剩下我一个了，他的目标是谁?想到这里我瞬间毛骨悚然，情急之下我躲进了卫生间的最里面，看着直播里拍到了我的办公室，主播说了一句“看来躲起来了，那我们去卫生间找找看吧”听到后我知道这直播好像是真的了。"
    },
    {
        "puzzle": "6.9晴，我和一个医生相爱了。10.8晴，他向我求婚了，他可真粗心啊，怎么能不记得我的手指的尺寸了呢，不过没关系，我自己能解决",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个精神科的病人，我一直幻响自己是医生的女友，现实中医生要向他真正的女友求婚了。戒指的尺寸比我的手指小，我便把自己的手啃成了戒指的大小。"
    },
    {
        "puzzle": "电梯最多载10个人，你正好是第10个，走进电梯后却超重了，电梯门关上后，你想到了一件事，然后立即报了警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "电梯里的人是一伙的，-共10人，9个活人一个尸体，我进电梯时尸体（女）已在我视线内。正对电梯门的墙中间贴有一洗发水广告，上面有一个女人上半身的背影，展示了一头飘扬的秀发，9人用尸体挡在了原本广告中女子的位置。由于人太多造成视觉上的阻碍，我进电梯时没有仔细看广告提示超重后出来，出来后是面对电梯的，在电梯门］缓缓关上使中间的广告突出在我视线中，我注意到头发有垂直的也有飘扬的，瞬间意识到怎么回事，并报了警。"
    },
    {
        "puzzle": "搬家后打扫了一天的房间，我拖着疲困的身体睡去。午夜时分，我被窗外的雨声吵醒，我实在是太困了并没有在意。直到第二天-早醒来，发现了不对劲，我赶紧搬了家。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我之前一直被人跟踪，好不容易换了一个新家，打扫完房间，准备第二天迎接新外面并没有下过雨的痕迹，还以为自己昨晩幻听了，正准备关上窗时，我发现昨天刚擦洗干净的窗户上竟又布满了脏印，仔细一看，还能隐隐约约看到一些指纹，原来昨晚的不是雨声，而是有人在用手指敲打我的窗，我顿时起了一身鸡皮疙瘩，赶紧搬走了。"
    },
    {
        "puzzle": "晚饭时，玛丽的爸爸抱怨妈妈做的甜汤太甜了，当晚，妈妈就死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "玛丽是个极端主义者，无法容忍家庭中有任何人对家庭不忠。玛丽最近发现父母的关系没有从前好了，并且还在厨房里发现了毒药，玛丽断定-定是爸爸妈妈之中有一人想毒死自己的伴侣。为了知道谁对这个家不忠，玛丽把毒药换成了糖，结果当晚喝到甜汤的是爸爸，于是玛丽便下毒药将妈妈毒死了。后来玛丽才知道，原来是爸爸想要杀了妈妈，而他已经知道药被玛丽发现，于是顺水推舟，让玛丽亲手杀了妈妈。"
    },
    {
        "puzzle": "\"莫世强!你干嘛?脑子有问题吗?\"“莫世强!你又不听我说话是不是?”“莫世强!你别烦我我要做饭!”隔壁的女人又在骂人了，被她骂的男人从来不还口，任由女人就这么吼了一天。我敲响了她的门，开门后迎接我的，是手上滴着血的女子。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人骂的是她的狗，她刚分手没多久，心里有怨气，就给狗狗改成前男友的名字，拿它出气。\"我”敲门时她正在杀鱼准备做饭，滴的是鱼的血。"
    },
    {
        "puzzle": "我望着他离去的背影，暗自握紧拳头。“你回来了，真好。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“他”跟“我”是并肩作战的战友，“他”离去是为了执行-项伟大但危险的任务，但不幸牺牲了。很多年后，“他”的孩子加入了“我”所在的团队，成为“我”的搭档。“我”从“他”孩子身上看到了“他”的影子，覚得似是故人归，所以心里默默说\"你回来了，真好。"
    },
    {
        "puzzle": "我和朋友去商场买东西，出来的时候朋友却被保安拦住了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "保安因为朋友衣服鼓鼓的以为朋友偷了东西，结果发现朋友只是胖了而已。"
    },
    {
        "puzzle": "太阳慢慢向西沉，乌鸦回家一群群，一闪闪亮晶晶，满天都是小星星。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "变态喜欢眼睛，但是他杀了很多人拿到的眼睛都不满意，无意中拐骗到了一群小朋友，小朋友的眼睛很漂亮像宝石一样，变态终于找到了自己喜欢的眼睛，他把小朋友的眼睛全都挖出来挂在天花板上，一闪一闪就像星空-样，十分美丽。他把尸体扔在仓库里，仓库里还有一些没有死透的受害人，他们眼睛被挖了，什么也看不见，只能靠吃尸体维持生命这些腐烂的尸体发出的腐臭吸引来了-群群乌鸦。乌鸦在星空下盘旋着，着急着嘎嘎叫。屋里的变态欣赏着自己的“星空”，满意地睡着了。"
    },
    {
        "puzzle": "烈日炎炎，黄土滚滚。［不如我们明日这个时候把她换了吧?］［没办法了，那就这样吧］多么脆弱如纸的一物啊，什么都无力阻挡［正好是腊月呢，真好］［猎物应该铭记自己的身份，乖乖被收割］［会过去的对吗?有你们在，都会过去的］",
        "question_list": [],
        "answer_list": [],
        "final_answer": "明代万历年间，因为旱灾，所有的粮食全部枯萎，无奈之下父母打算易子而食，父亲偷偷和母亲商量唯独将兄弟妹三人中的她换给别家分食，母亲同意了。谁又知隔墙有耳，脆弱的墙无法阻挡她贴着墙角听到讨论的声音，也无法阻挡恨意上头欲反杀的她。于是她拿起镰刀，在半夜将父母哥哥弟弟全部杀死，并将尸体做成腊肉，靠着吃腊肉熬过整个灾期。"
    },
    {
        "puzzle": "他没有说话，但还是被打了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "去孩子满月宴了，这个男人说话不好听，为了不打扰人家的心情一句话都没说，最后走之前忍不住了说了句：“我今天一个字都没说，回头你家孩子出什么事了不怪我”这种感觉的话吧，被孩子家人打了。"
    },
    {
        "puzzle": "女孩最近睡觉老是落枕，医生说了句有些暧昧的话后，她吓傻了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女孩现在还是单身，自己一个人独居，她觉得她经常落枕，是因为枕头的原因，就去医院看医生，然后医生用一种极其暧昧的表情看着他，她有许多疑问，然后医生就跟她说，你虽然有男朋友，但是晚上还要枕枕头哦，不能一直枕着人家的胳膊哦。然后女孩是一边疑问一边害怕，因为她从来没有过男朋友。"
    },
    {
        "puzzle": "她是那么地美丽又高傲，我鼓起勇气对她说了第句话，没想到，竟然也是最后一句话。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一只小老鼠，在妈妈的庇护下无忧无虑地长大。有一一天，我不小心来到一个陌生的地方，这里好漂亮，明亮又干净，透过纤尘不染的玻璃，我看到了自己的样子。灰灰的毛皮，圆耳朵，尖嘴巴:小小的眼睛滴溜溜地转着。这时，我看到了-只可爱的动物在我的不远处。她浑身雪白，眼睛又大又圆，姿态慵懒高雅，看起来是那么地美丽又高傲。我想我是喜欢上她了。终于，我鼓起勇气对她说了第一句话，“吱。”却没想到，她看到我:发出了一声尖叫：“n苗。”她是猫!是妈妈嘴里的我们的天敌!来不及了，她一口咬住了我脆弱的喉咙。"
    },
    {
        "puzzle": "我新搬了家。在新家，我把书桌摆放在窗边，可是，每当我坐在书桌前专心工作时，总有莫名的异样感。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我新搬了家，为了工作需要，我在窗边放置了一张书桌。但搬进来不久后，每当我在书桌前认真工作时，便感觉有东西轻轻地抚过我的脖子，起初我以为我自己只是神经敏感，便没有在意。但久而久之，这种感觉一直存在，只要坐在书桌前，就感觉不停有东西轻触我的脖子，可是离开了书桌，却没有这种感觉了。于是我便找了大师，大师说，有一些肉眼看不到的东西能被古旧的相机捕捉到，让我下次再有这种感觉时立马拍张照，说不定能有收获。我回到家，架好相机，坐在书桌前，当感觉到有东西在轻触我的脖子上，按下快门拍了张照，然后拿去照相馆洗出来。当拿到照片那一刻，我吓得脸色发白。在我的身后，有一双悬在空中的脚。原来我一直感觉到的，便是上吊自杀的房子的前一任住户，因为在空中摆荡而不停触碰到我的颈的脚。"
    },
    {
        "puzzle": "后山的老宅响起了歌声［找呀拢呀找朋友\"］［找到一个好朋友“］［敬一］［你是我的好朋友\"］",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有一天，孤独的我在废弃的老房子后面的草地看到有一群小伙伴在玩捉迷藏，于是加入了他们，在大家的推选下，我成了那个捉人的“鬼”开始寻找我的小伙伴\"终于，我找到了那个小伙伴，歌声也正好播到“找到一一个好朋友”。我正想顺着歌词抬起手跟我的小伙伴敬个礼，才发现，原来我早就死了，头也不见了。所有陪玩的小伙伴原来只是误入老宅玩鬼屋探险游戏的小孩子，他们看到了没有头的我，情急之下惊惧地跑到了院子后面躲藏我，我却没有意识到。等我想起来自己是鬼的时候，突然发现“只要把他们也杀了变成鬼，我就有小伙伴啦"
    },
    {
        "puzzle": "1我跟家人们都在笑着。一声巨响过后，我倒在了血泊中.临死前，我看着家人们开心地笑了.",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是个精神错乱的疯子，杀人后总是把尸体搬回家中.划开他们的嘴角让他们看起来在笑。因为从小被父母抛弃，这让我渴望有家人陪伴，所以我把这些尸体当作是我的家人，每天陪他们说话。这天我正跟家人们开心的说着话，多美好的气氛啊，可惜被问入家中的警察破坏了'我生气地看着这群外来者，冲上去想杀了他们。枪响了，我倒在了血泊中，临死前我看着这些家人们开心地笑了，至少在临死前，我不是孤单的了。"
    },
    {
        "puzzle": "'看电影吗？“抱歉我来迟了，家里老三发烧了。“你家里不是也有小孩子吗，你怎么看得下去!”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "最近杀人影片很流行，里面加入了大里虐杀的剧情，画面既血腥又刺激。还有人说，这种影片甚至是凶手自己拍摄的真实杀人事件。某天，我的朋友说起他有这样的影片，顿时我充满了好奇。于是他约我到郊外的一个隐秘的小屋，带我去看这神秘的影片。兴奋不已的我按照约定时间到了了小屋，朋友却迟到了很长时间。他来到时向我解释说：\"抱歉我来迟了，家里老三发烧了。”接着，朋友开始放起我期待已久的影片。电影的背景充满了小孩子的哭闹声以及大人嘻嘻哈哈的笑声，一个几岁大的孩子，在拼命躲避凶手的追杀，可是无论逃也还是被抓住，然后刀一刀地分尸小孩子撕心裂肺的哭喊声:我对这种电影感到极度的不适，我不应该看这种电影的，太残忍了。我转过头，却看到朋友看得津津有味，我很情地指需他：“你家果不是也有小孩子吗，你怎么看得下去！“，朋友却不以为然：“是啊，有两个，那又如何。”我愣住了眼光不由自主地看向了他的手，那是和凶手长得极为相似的一双手"
    },
    {
        "puzzle": "一天晚上，一个人来到学校被禁止进入的顶楼教室。他为了证明自己来过，就在墙.上的肖像上按上了手印，打算第二天带同学来炫耀一下。第二天他再次来到教室看到手印时，却被吓疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "顶楼教室曾发生命案，白此以后闹鬼事件频发，我为了证明自己足够勇敢，只身一人在深夜前往该教室并志得意满的留下了我的手印在教室墙上的一个肖像上就偷偷离去了.第二天，我骄傲的和同学炫耀自己去了学校的顶楼教室，还带了他，们再次前往，可诡异的事情发生了!这个教室真的有鬼!我昨天按下手印的地方，其实是一块粘满灰尘的玻璃，更没有什么我昨晚看到的肖像！"
    },
    {
        "puzzle": "“再见了.....”“我回来了。”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他失恋后一时想不开，写好遗书准备跳海自杀。进入水中后发现有蛇，吓得游回了岸边，决定从此好好生活，若无其事地回了家。"
    },
    {
        "puzzle": "寂静的村庄一妈妈，你听，娃娃鱼在唱歌……",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这是一个靠近溪流的小山村，因为水质清澈湍急，山村的溪流里同样繁衍着很多的野生娃娃鱼。但同时，这也是一个愚昧闭塞的小山村，村里重男轻女的思想根深蒂固的附着在村名们的思想中，如果生了女孩，残忍的村民会将他们扔进溪水里淹死，生了男孩则留下来...每当夜深人静时，溪边总是传来婴儿”哇一一哇一“的哭声，好奇的小男孩问他的妈妈为什么会有这样的声音，妈妈欺骗他这是娃娃鱼的歌声，但其实娃娃鱼，是没有叫声的...."
    },
    {
        "puzzle": "朋友对我说：“晚上睡觉不要把脚伸出被子外面哦”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我有一天去我朋友家做客，玩得太晚了，便留宿在他家。因为他家没有舞.婴把脚释堡积养盔最，看怪物蒙酌脚的对为他玩笑，笑着说:”这话我幼儿园的时候就不信了.“半夜，我睡得正香，突然听到床尾有些动静，我睁开眼睛，一看，发现朋友的脚正漏出被子处，而他的头正在啃他的脚。"
    },
    {
        "puzzle": "我握着扶手，车里的温度很低，一股隐约的骚臭弥漫，他们一个个走向我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这辆公交车曾经发生过一次杀人案，我就是那个被杀人犯惨遭虐杀的乘客，因为尸体被碎尸藏在公交车底一个隐秘的地方，所以大家都没有发现。自此我变成了公交车上的地缚灵，却没有意识到自己已经死亡，以为自己仍然是乘客。因为成为鬼魂，所以我感觉不到温度，总觉得很冷藏在车底的碎尸慢慢发酵，隐隐约约弥漫开臭味，司机却以为只是死了老鼠，暂时没去清理，还继续营业，所以我心惊胆战地看着真正的乘客一个个上车，穿过我的身体..•."
    },
    {
        "puzzle": "他杀它，她死了，它哭了，我笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“我”和“他”是非常好的朋友，我对他的友情已经发展到病态的程度，他养了只狗“它”，我们经常一起玩，后来“他”和“她”交往了“她”非常害怕狗，所以每次他们一起出去玩的时候，他们都会把狗送来我家，等到“他”回来的时候，再把狗接回去，“我”一直很讨厌这只狗，和“它”玩主要是为了和“他”在一起，自从他们交往之后，我和他见面就越来越少，所以那一天等“她”来明白为什么它的主人要杀它，我除掉了两个友情障碍，我笑了。"
    },
    {
        "puzzle": "-女子大学放假期间，因兼职没回家住，，一-天夜里听见楼下有声响和开门的声音，就马上躲到了床底下，第二天却发现死在了床底下。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "宿舍楼曾经有位跳楼死的女孩，这天刚好是死去女孩的头七，她回来是想找个替死鬼，而女孩是跳楼至死的，所以回来的样子仍然保持身体倒着向下的状况，进门］时刚好就和躲床底的女子对视上了，所以女子吓死了。"
    },
    {
        "puzzle": "我的手机掉了，当我找到它时，我吓了一跳。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我被朋友大晚上的拉去酒吧喝酒蹦迪，喝了几杯酒蹦了一会儿，坐下来休息的时候，才发现自己的手机不在口袋里，我在酒吧翻找了半天也没找到，于是我用朋友的手机给我的手机打了个电话。电话那头传来了-位陌生男子的声音，但是，但是我还没来得及问清楚，电话就被挂掉了。怀着郁闷的心情，我回到了家，发现我的手机就在床头，并没有被带出门，我不禁毛骨悚然。"
    },
    {
        "puzzle": "“好饿”闻着刺鼻的味道，一个黑色的巨人贴着窗户看着我，我却没有害怕。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个狗狗，我和我的主人住在人迹稀少的郊外的一座别墅上，每天到了饭点主人都会给我做狗饭。有一天，主人半夜有事出去并遇到了杀人狂魔，凶手用大刀在主人的身上头上砍了很多下，鲜血流满了整个身体。并且处于恶趣味，凶手把主人挂在了窗上。作为一只狗狗，我的视觉里没有红色，所以主人在我眼巾变成了黑色的巨人。尽管死体渐渐腐，刺鼻的臭味刺激着我的嗅觉，但我还是问出了主人熟悉的味道，所以并不感到害怕。"
    },
    {
        "puzzle": "国王消失，他也随之离去。当懦弱的母亲变得勇敢，我哭着挥下了手中的刀。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "三个生车喜家席的每孩就是亲酒桑的瓷！然俯毒亲个国王，一个暴君，而我和母亲就是被他随意施暴的庶民。懦弱的母亲永远不敢反抗他，甚至在我被暴打时同样不敢吱声，于是很自然的，我的第二人格一一他，出现了。他代替我勇敢，代替我在殴打时逃跑，代替我反抗，甚至，在父亲酗酒时推到楼下摔死伪装成失足死的，帮我解决了这个该死的父亲。我们互相知道对方的的存在，甚至把对方当作彼此的良友和依靠。但没有想到的是，母亲发觉了我的不对劲，在不断逼问中知晓了他的存在。母亲不希望我一直这样“精神分裂”下去，她想让我做回正常的孩子，于是她做出了她人生中唯一次强硬的举动一逼迫我看医生吃药。我的人格分裂治好了，也意味着他被杀死了。失去了他的我觉得人生了无生趣，于是选择自杀。"
    },
    {
        "puzzle": "有时他们是快乐的一家三口，有时他又是个残暴的父亲。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人和女人是夫妻，他们的女儿死了，两个人都遭受到了严重的精神打击。男人抗拒吃药导致精神失常，为了营造虚假的美满家庭，他偷别人家的婴儿当作自己的小孩来养。女人则是有好好吃药，但是有时候会失忆，忘记自己的女儿已经死了，把偷米的婴儿当作自己的孩子，等到女人恢复记忆后，她便会指出这个孩子并不是自己的孩子，导致丈夫陷入疯狂，并把这个小孩杀死，然后偷窃了个小孩如此往复。"
    },
    {
        "puzzle": "男人刚去洗车店洗完车，开到一半却开始闻到一股怪味。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人的老婆和洗车行的老板偷情，被老板的老婆发现了，老板因为受到了威胁所以把他的老婆给杀了，但是这具尸体却无处安放，于是男人的老婆把他骗去了洗车店，想借男人之手偷偷把尸体运出去。男人正好要出差，后备箱塞满了行李，他们便趁洗车之后把尸体分尸塞进了后备箱的行李里，男人没有察觉到什么异样便一上路了。由于天气炎热，后备箱气温高，尸体很快发出鹰臭，男人开着开着，就开始闻到一股臭味。"
    },
    {
        "puzzle": "很长一段时间，我一直躲在家里。-天，我突然收到了一张纸条，于是我向外走去，再也没回来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "世界爆发丧尸病毒，我一直躲在家里，靠以前囤的物资活了下来。可是，这样下去不用多久，等食物吃完的时候，我还是会死。一天，我在门］缝下收到了一张纸条，上面写着：“快来!我家有粮食。\"我一看”我一看，很开心，原来还有不止我一个正常人，我找到同伴了!为了继续生存，也为了不用自己孤独地担惊受怕，我找好时机，小心翼翼地躲过丧尸，来到纸条上写的地址，根据里面给的暗号敲门。一个男人打开门，把我带进屋里，看着周围整洁的布局，我放下心来，他却突然从背后袭击我，把我绑起来，带到了一间卧室。卧室里正是男人的妻子，她变成了丧尸被男人绑在床上。而我，就是男人找来准备喂给妻子的食物。"
    },
    {
        "puzzle": "女儿看着雪花兴奋得手舞足蹈，我却留下了眼泪。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "故事发生在二战时期，我跟女儿都是犹太人，被纳粹关进了奥斯维辛集中营，在这里面的人活得连畜生都不如，死后便被成堆地放进焚尸炉中去焚毁。焚烧尸体产生的大量骨灰会形成黑烟被吹上天空，与云混合后又附着雪的表面起落下，看起来就像落了一场黑色的雪。年幼的女儿对这些一-无所知，看到颜色特别的雪反而很开心。我希望她能够永远快乐，但却不知道我们还有没有明天。"
    },
    {
        "puzzle": "在漆黑的世界里我与她告别，然后在光明中，再次与她四目相对。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我有个双胞胎姐姐，我们性格截然相反，她对生活乐观热情，而我则冷漠又厌世，多次想过自杀。某次地震中，我和姐姐一起被埋在了废墟之下。在黑暗的废墟中等待了五天之后，她开始撑不住了，她让我吸吮她伤口流出的血。跟我说有一个人活着总比一起死去要好。她想把那点活着的机会让给我。我哭着摇头，但最后架不住她的劝说和又饿又渴的痛苦。按照她说的去做，在黑暗中，她用渐渐变凉的尸体与我无声告别。获救后，我一直内疚，我觉得她才应该是活下去的那个。于是我便对外宣称我是姐姐，我希望身边的朋友永远不要忘记她。也永远不要知道那么美好的她已经离开了。看着镜子中和她一模一样的脸，我在心里默默下定决心，以后，我会带着你的份，好好活下去。"
    },
    {
        "puzzle": "段视频里，女人深夜回家，却撞见自己在自杀接着屏幕变黑了。第二天，女人再次出现在视频里。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人是一个网红，为了流量。让搭档化妆成她的样子，然后想要直播成灵异事件，网红有一个狂热粉丝。借了高额贷款去整容成她的样子。原定直播“灵异事件”的这天晚上，粉丝正好潜入了网红的家，看着她光鲜亮丽的生活环境，联想到自己的贫穷生活，她觉得非常后悔，正要自杀时正好碰到了误把她当作搭档的网红。因网红而起的巨额债务压得自己喘不过气，狂热的爱开始扭曲，粉丝心里生出一个恶念，她掐了直播杀掉了网红，顶替她的身份，第二天继续直播。"
    },
    {
        "puzzle": "天空划过一道流星，女孩许下了三个愿望，咚咚咚，男孩便死去了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "书孩是个校花，有很多的追求者，但女孩对他们都不屑一顾。男孩凭借自真挚的情感打动了她，成功地约出了女孩，想在今晚对她告白。这时天空中刚好划过一颗流星，女孩作势要许愿，微微闭上眼睛，与女孩洋肩而立的男孩朝女孩的方向望去，恰巧看见几个曾经骚扰过女孩的混混想要靠近，男孩为了保护女孩，让女孩先从另外一条路跑了。女孩因为对这几个混混有心理阴影，没有多想便逃开了可她没有想到，这一逃，便是与男孩的最后一次.面.......男孩在与混混的打斗过程中，被混混推下了台阶，咚咚咚，男孩的脑袋撞击在锋利的切面上，当场死去。"
    },
    {
        "puzzle": "“妈妈总是说，晚上一个人走路上时，听到有人叫我的名字千万不能回头，会被坏人抓住。我知道她就是吓唬我，有一天真遇到这种事，我回去一定好好嘲笑她!”别回头，十几年过去，我这么告诫我的孩子。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有天女主在街上，刚好头顶高楼天台上有人争执，一人被失手推下楼顶坠楼者被高空电线和铁丝网分割成碎状，鲜血和内脏溅落街道，女主身后的朋友看到急忙惊慌失措的喊她，女主听到呼喊转身后被散落的肢体内脏和血淋了一身，以及掉在脚前还睁着眼死不眼目的半个脑袋。"
    },
    {
        "puzzle": "给篱笆打桩时，趁机把影子钉在地上，我一生都想摆脱他。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "父母偏爱双胞胎兄弟，导致我心里不平衡，--天父母安排我和兄弟出门］打桩时，我趁机杀了兄弟。"
    },
    {
        "puzzle": "我不能见光，我最终会见光。我静静地躺着，看着他表演，我知道他会陪我的。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和他都有家室，却成了彼此见不得光的情人。我本以为生活不过就是如此苟且的活着，却没有料到，他欠下了巨额赌债，我在他眼里成了待宰的羔羊。他把我约出来，趁我熟睡的时候用双手扼住我的咙，我惊醒又逐渐因缺氧而室息昏迷。接着，他怕我没有彻底死去，又用刀一下又-下的捅去....我终于死了，我的灵魂飘了起来。我亲眼看着他将房间处理干净，把我用着一层又-层的塑料袋套着封紧，踢进了酒店房间的床底最里面;我亲眼看着他拿起我的手机，向他自己的账户不断地打款，并且伪装成我给我的家人丈夫发信息。难道，我就要这样无声的呆在黑暗里腐烂吗?我恨'我恨!我的怨气慢慢凝聚，我趴在他的肩头，时时刻刻，没日没夜地说着一一别躲，我一直看着你呢，我一直在你身边响...我知道，他听得到，他终于受不了了也许是怕最终会被我弄死，他自首了。警察根据他的自述，一行人把床抬起来，终于让我的尸首见光......他还想着演成精神病从轻发落，呵，不可能的，被法律制裁吧我会在地狱等着你的-"
    },
    {
        "puzzle": "画师一画，名动京城。她是画师的新婚妻子。今日是她的生辰，画师第一次，为她拿起画笔，也是最后一次。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "画师原本是个书生，画技平平，但那天，他遇到了一位姑娘。姑娘自称画中仙，并将自己寄身的画给了他。他总觉得这姑娘说不出的眼熟，仿若前世故人。只是姑娘轻飘飘的一个笑，他便决定为她奉.上一切。姑娘寄身的画惟妙惟肖，摄人心个和她同年同月同日生的女子，来做她寄居的肉身。在生辰那日，以画为介，以魂换魂。画笔落下，娘露出甜美的微笑，与画中人如出一辙。女人啊，向来最讨厌负心人了。她为什么会在画中，画师早忘了吧。姑娘舔了舔带血的手指，满意的笑了。"
    },
    {
        "puzzle": "“要红衣服吗?”那个推销的怎么又来了?我再也忍受不了，你有多少红衣服，我都要了，别吵了！”第二天，宿舍没有人起床。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一名大学生，夜里经常有一个穿红色衣服的女子深夜上门］推销，天天夜里都来，一间间房间的敲，如果有人开门就问“要不要红衣服?前几夜由于我被吵后非常生气，都大叫着不要，一连几个晚上都这样，有一个晚上，那个女子又来了，我终于忍受不了，对她大吼：“你有多少红衣服，我都要了，别吵了！”只听那女子轻笑一声，转身走了，也没给我红色的衣服，那晚上大家都睡得很好，没有人再来敲门了。第二天，没有人起来，宿管来查寝，把大家的被子掀开，才发现我和室友上身的皮已经被剥掉了，看起来就像是穿了-件红衣服。"
    },
    {
        "puzzle": "有一个女孩独自在家，陪伴她的只有只爱犬，半夜她听见了滴水声，她害怕，于是把手放到了床让爱犬舔了舔她的手，第二天.狗死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手晚上潜入女孩家里，被女孩养的狗发现了，于是凶手就杀了狗，把狗吊在天花板上，狗的血滴在地板上，女孩醒了，舔她手的是凶手。"
    },
    {
        "puzzle": "-男子被发现吊死在家中，现场并没有明显的足迹和打斗痕迹，初步判定为自杀，经法医鉴定，死者拇指上有液体残留，手臂上和脖子上都有针孔的痕迹，但是法医在死者身上的一个部位发现个重要的线索，自杀的判定又撤销了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他的妻子要和他分手离婚，然后他注射了过量毒品，男子就死了，法医后来发现的应该是尸僵，因为被吊死，脚要朝下变硬，但实际男子的脚不是向下的，手上的液体是签离婚协议的红色印油。"
    },
    {
        "puzzle": "做我女朋友吧。我才不要，你一点都不浪漫。今晚我会给你个惊喜。好吧，等我看看惊喜是什么再做决定。哇，太浪漫了吧，我答应你。她看着对面的大楼发出惊呗。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子是对面大楼的保安，为了给女子惊喜，他把大楼的居民都杀掉了，并且打开和关掉对应的灯，这些亮着的灯组成了一个爱心的形状。"
    },
    {
        "puzzle": "凌晨一点，那该是的门铃声又响起来了。她来了，来杀我了，我就知道，她不会放过我的.警察逮捕了我，说我有精神分裂。我想起来了，是我，差点杀了妻子。可是为什么门铃声又响起来了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人的妻子已经死了，警察怀疑是男子杀得，但是男子有精神分裂，于是为了让男子想起来，他们假扮了那个杀人的女人.在警察的不断刺激下，男人想起来了他的确有精神分裂，也确实差点杀了妻子，于是他被抓到了精神病院。结果当晚，，门铃声还是响起来了，门］外真的站着一个女人。"
    },
    {
        "puzzle": "\"剪刀石头布，输了就去死吧。”他出了剪刀，她出了布。她绝望的哭了。他绝望的笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他和她是一对情侣，旅游期间，他们被变态杀人魔抓住。为了折磨他们，他让他们进行猜拳，输了的人就会被凌退而死，平局则两个人一起死掉，奇怪的是，猜拳之前，杀人魔给了他们商量的时间，于是，女孩和男孩约定好一起出石头，双双赴死。时间到了，三，猜拳结果出来了，杀人魔露出了变态而满足的笑意。原来，男孩出了剪刀，女孩却出了布。在女孩绝望的哭泣和尖叫声中，杀人魔带着微笑缓缓的掏出了匕首。"
    },
    {
        "puzzle": "他是个有钱人家的公子哥，一天，公司给他招司机，面试时，他发现有个男人和他长得很像。这就奇了怪了，他心生好奇。父亲生性风流，他早已习惯，便怀疑这是父亲年轻时犯下的桃花债，于是试探性的问了他几个问题。问完后，他如坠冰窟。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "父亲年轻的时候爱拈花惹草，母亲为了报复，于是和家里的司机鬼混，生下了A（公子哥）。后来，司机看孩子眉眼有些像自己，怕事情败露夏到了老家，在老家碎天情之于是回到了老家，在老家结婚并生下了B。多年后，B长大，机缘巧合之下又来到了A的公司面试，A觉得B和自己很像，于是怀疑是自己父亲的风流债，出于好奇，他问B,他的母亲是不是年轻时在外面当过保姆之类，结果B却说，母亲并没有出过村子，只有父亲年轻时在有钱人家做司机，A才发现原来自己是母亲偷情的产物:他担心未未父亲发现后失去财产继承权于是惊慌失措。"
    },
    {
        "puzzle": "我有一个特异功能。一天，我和妈妈去医院看奶奶，奶奶对我说：\"帮奶奶一个忙，好吗?”奶奶走了，走之前死死的盯着我。后来，妈妈死了死前紧紧地抓住了我的手。对不起，但是太好了，终于只剩我了，而我还有大把的青春。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "奶奶病危，我和妈妈去医院看望。她们之间一向关系不好。因为妈妈的缘故，爸爸和奶奶渐行渐远。虽然是来看望病危的奶奶，我却从妈妈身上感受到了一种即将解脱的快意。也许是因为奶奶快死了吧。她躺在病床上，干枯的手，灰白的脸。我很难受，想帮奶奶做些什么，就在这时候，我听到奶奶说话了，那声音很小，我俯下身。“帮•帮奶奶一个忙好吗?奶奶想去看望一个朋友。”奶奶祈求我，希望能附身在我身上，虽然有些犹豫，但我还是答应了，也许这个能力就是为了今天呢，抱着这样的想法，我和奶奶换了身体。奶奶反悔了，三十年后，妈妈病危奶奶坐在妈妈的病床前，-字一句的告诉了她真相，妈妈死死的抓住了奶奶的手，含恨而终。"
    },
    {
        "puzzle": "小明的亲人去世了。深夜，小明开车赶回去参加葬礼。半路上，小明看见一个被撞的老太太向他求救，他不想帮忙，-溜烟跑了。小明死了。丈夫又去那个房间了，为什么不让我去！“不要离开我。”他梦中呢喃。原来他真的很爱我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的奶奶去世了，小明赶着回去参加葬礼，开车走的山路。路上又偏又远，又是夜里，小明正犯困，突然看见一个老太太躺在路边。好家伙那血流的，差点没给小明吓出病来。他一狠心，也没管人，一踩油门就溜了。开着开着，直到耳边传来阵阵响声的时候，小明发现不对劲了被泥石流淹没的那一刻，奶奶现身副驾驶，她狠狠的揪住了小明的耳朵:叫你小子坏心眼，这下遭报应了吧。"
    },
    {
        "puzzle": "丈夫又去那个房间了，为什么不让我去！“不要离开我。”他梦中呢喃。原来他真的很爱我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为一场意外，我去世了。但因为挂念丈夫，我的灵魂还是一-如往常的回到了家里。回家后，我发现丈夫的行为举止都变的很怪异，还一直不让我去书房，我没有细想。但晚上睡觉时，他居然流着泪呢喃，“不要离开我。”我怀疑他已经变了心，决定搞清楚一切。于是我推开了那间房间，原来里面摆放着我的遗照。"
    },
    {
        "puzzle": "阿珍有个帅气的男朋友，但男朋友出轨了,她伤心欲绝。传闻阿伟是个机关师，虽然其貌不扬，但是做蜡像的手艺一流，有的甚至会动会说话。阿珍失恋后，阿伟出现在阿珍身边，成为了阿珍的男朋友，两人十分恩爱。-天,发生火灾。阿伟死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "阿珍是个机关师，在被帅气的男友背叛后，她做出了阿伟，一个永远不会背叛她I的蜡像。她恨透了前男友的花心，也连带着恨上了他俊秀的外貌，于是阿伟的外貌并不出色。传闻他们很恩爱，可是，这份恩爱终究抵挡不了火灾。至于在火灾发生的时候，是阿伟冒着融化的风险把阿珍从大火中送出，还是阿珍为了逃生抛弃了阿伟，这一切都已经无从考证。而且火灾来的突然，没有人知道是谁放的，有人说是阿珍，说她已经腻了阿伟。有人说是阿伟，据说他已经烦透了被操控的人生。还有人说是阿珍的前男友，听说他后来因为花心被人毁容了。外界传说纷纷芸芸進知道呢。不过，阿珍再也没有做过蜡像。"
    },
    {
        "puzzle": "他们都叫我青蛙王子，如果不是遇见她，我可能永远都是那个敏感自卑的我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我之前遭遇了-场火灾，脸毁容了大家都喊我青蛙王子，被家人们嫌弃赶出了皇宫，我很自卑，住在下水道里，有一天我遇见了公主，帮她捡金球，和她一起很开心，一天晚上我看她熟睡的脸，很想把她毁容，变得和我一样，这样我就不会自卑了。"
    },
    {
        "puzzle": "-群小孩在游乐场玩，后来游乐场暂停了营业了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "-群小孩在游乐园玩耍，他们来到一处正在维修的游乐项目，偷偷溜进去玩废弃大轮胎，在玩耍中，轮胎滚到一旁的钢筋上，戮破了，流出了很多血，小孩们吓得跑回了家告诉爸妈此事，于是家长报了警,警察发现大轮胎被封住了，里面藏着一个小孩，已经死了多时，新闻一出大为轰动，游乐园暂停了营业配合调查。"
    },
    {
        "puzzle": "A杀了人，B却帮忙处理了尸体。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "A杀了一个人，他知道自己有个胆小老实的邻居B,便把这具尸体藏在了B家里的地下室里。B-开始看到这具尸体，还以为是有人恶作剧，触碰了尸体，想看看有什么猫腻。但是没想到是真的，把B吓了一大跳，以B的性格，他不敢轻举妄动的找么猫腻。但是没想到是真的，把B吓了一大跳，以B的性格，他不敢轻举妄动的找"
    },
    {
        "puzzle": "女子在自己房间打电话，过了一会她听见隔壁传来很大的吵架声，她愤怒地过去做了一件事，很，隔壁安静了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女子其实是在自己的卧室打电话，隔壁有人在大声吵架，其实是她弟弟在看电视剧，电视剧里的人物在吵架。女子来到客厅，找到电闸，把电间拉了下来，瞬间电视没电，非常安静了。"
    },
    {
        "puzzle": "我从角落翻出好几个纸团，打开之后发现上面写着：“不要出去，外面有鬼!”过了一会儿，在一片血迹旁，我又找到了一个纸团，上面写着：“我错了，快走。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在一个废弃的房屋内醒来，从窗户向外看只能看到黑勁黝的森林，没有别的人或建筑。我是被一个占有欲很强的追求者囚禁在这里的。他想把我关在每人的地方，和我单独生活在一起。他知道我本身就有些迷信，于是把囚禁的地方选在了森林边上荒无人烟的地方，还在房屋各处撒下事先准备好的纸团，写着“不要出去，外面有鬼!”让我不敢出去。然后他没有想到的是，这里并非荒无人烟，这房子是一个变态杀人狂的藏尸地点，当追求者把晕倒的我搬进布置好的房间时:正好被杀人狂看见，他把追求者砍死后，拖到了地下室。杀人狂发现了房子里的纸团.他觉得很有趣，想要享受一番被害者惶恐不安的情绪再杀掉我，于是他也写了一个：“我错了，快走”的纸团扔在追求者的血迹旁。最后，发现这个纸团的我在陷入更大的惊恐中时，被躲在暗处的杀人狂杀掉了。"
    },
    {
        "puzzle": "妻子带回一个小孩，丈夫却死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "孩子死亡，妻子疯了到处寻找和孩子相似的小孩，取他们的尸块拼成孩子的样子并把\"孩子”领回家中，丈夫无法接受，于是斥责了女子，女子突然发现，丈夫的眼睛与孩子相似，于是挖出丈夫双眼安在“孩子身上，丈夫不堪痛苦，自杀了。"
    },
    {
        "puzzle": "他和女朋友开车去露营，路上吵了一架又和好了，但是回去路上他却死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他和女朋友开车去露营，路上两人吵架，都不退让，女朋友说自己要下车，他把女孩放下走了。过了一会儿他冷静了，想，我不该把她放那儿的。他开牛回去，发现女孩在原地等他，就接她.上了。路一上，他看到一个人用怪异的手势拦车。常人用手心朝人，而他手背朝外，手心朝自己，女朋友问，为什么不理他?他说，你听说过吗?死人和活人的手是反的，他刚才那个手势就是反的。女朋友听了，笑着说：“是吗，你好厉害!”井手背对着手背鼓起了掌。"
    },
    {
        "puzzle": "黄昏，我在等她，我看见她拿的东西，我害怕极了，她在报道里哭的很伤心。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是班草，长得还可以，我的老师喜欢我，因为学校不让早恋，我和女友的关系被老师发现了，老师以此来要扶我，让我和他发生关系，我被迫同意了，他录了视频放在U盘里（老师是双性恋），后来女友无意中发现了这个事儿，约我放学后在办公室门口等她，同时也约了老师在办公室等她，老师想故技重施（用不让早恋要挟女友），女友说等到黄昏，老师以为自己得手了。等到黄昏时刻，校园里没人了，女友把老师杀了，拿回了U盘，以为女友自身有精神疾病，杀完老师后，握着刀一步一步向我走来，把我也杀了，同时把现场伪装成我为了保护女友和老师同归于尽的样子。记者来学校采访时她看起来真可怜。"
    },
    {
        "puzzle": "小明和女朋友大吵了一架，--阵风吹过，小明便离开了人世。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "一天，小明和女朋友因一件小事出现了分歧，大吵了一架。一段时间后小明意识到了自己的问题，开车去追女朋友。因为是新车，车上还带有异味，小明便打开了车窗通风，当天风很大，一阵风吹过，一个白色的塑料袋吹进了车内，刚好盖住了小明的脸。恰好小明追妻心切，没有好好保持车距，在拿塑料袋的一瞬间，为了躲避前方的车，车冲出了高速上的挡板，小明就这样摔死了。"
    },
    {
        "puzzle": "随着一声枪响，弟弟死在了草地上，但他并未中弹。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有两个酷爱射击的兄弟，某天他们去野外练习射击，哥哥的枪法很好，很快就把靶子打烂了，就好心上前帮忙换几个，哥哥也想和弟弟开个玩笑，开抢吓唬他，弟弟努力奔跑试图躲避哥哥的子弹，在躲避的途中，摔倒在地，刚好惊动了-条在休息的响尾蛇，响尾蛇立即反咬一口，哥哥还以为弟弟假装被打中了，在装死，等到哥哥发现不对劲的时候，弟弟已经死了。"
    },
    {
        "puzzle": "小红在她还是小孩子的时候，父母便因为车祸双亡，连她唯一的弟弟也在不久胡去世，长大以后她交了一个男友，在小红生日那天，男友送了她一小瓶精致的香水，可看到香水的小红却惊恐的逃跑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小时候小红和她的弟弟-起玩，途中发现一个小瓶子，小红告诉弟弟瓶子中的药水一定是愿望药水，喝下去许愿就能让爸爸妈妈回来，然而有所不知的是小瓶中的药水是附近化工厂的有毒物质，在弟弟喝下药水后小红就眼看着弟弟抱着肚子满地打滚，最后不治身亡，从此以后小红就对所有的小瓶都抱有强烈的恐惧感。"
    },
    {
        "puzzle": "-道闪光过去，小明死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明是一名驯兽师，表演期间有人用相机拍照，闪光灯让狮子失控，同时小明也被闪到看不清东西，结果小明让狮子咬死了。"
    },
    {
        "puzzle": "一个人正在把一一只活得动物粘在一块石头上。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "那个动型是珊瑚，他在用胶水把珊瑚粘在石头上，想让它重回家园."
    },
    {
        "puzzle": "一位老人被毒杀了，警察取证时发现一件奇怪的事，老人这天什么都没吃，也什么都没喝。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "老人从未想过有人会下毒谋杀自己，一-如往常般生活，早晨起床后先上了厕所，之后洗洗脸，戴.上假牙，这一刻，老人命上黄泉，毒涂在老人假牙上。"
    },
    {
        "puzzle": "他只是静静地听着音乐。突然，音乐毫无征兆的停止，下一刻，他死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "欢乐的音乐在周围流淌，-群人正在兴高采烈的玩着，但他对此毫不知情，仅仅是沉浸在音乐中。音乐忽然停止，他的眼前一个巨大的屁股迅速放大，众人正在玩抢椅子的游戏，而他则是落在椅子上的虫子。"
    },
    {
        "puzzle": "一-个公园发现一具尸体，尸体头颅砕裂，全身多处骨折，但他的死因确是体温过低。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "位贫穷的员工渴望出去旅游，可是因为没有足够的钱，他想尽办法溜进了一架喷气飞机的起落架舱，在飞行过程中由于过度寒冷而死，并在起落舱再次打开时"
    },
    {
        "puzzle": "街道上停着两辆相隔很远的车，车上各有一具尸体。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "两车相向行驶，各行其道，雾很大，两名司机都想探出头看清车道中心线的位置"
    },
    {
        "puzzle": "第一天小熊没有啦，第二天洋娃娃没有啦，第三天小木偶没有啦，最后一天全都不见啦，我很伤心，因为看见蝴蝶结还在发光。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸很强壮，像小熊，妈妈美美的，像洋娃娃，哥哥呆呆地，像小木偶。我和爸爸妈妈哥哥去银行，突然一大推人冲了进来（是劫匪）妈妈把我藏了起来，我只能从缝中看外面的世界。（他们把这里的人当人质）天黑下，爸爸不见了（被枪毙了），天再黑一下，妈妈不见了。天又黑了一下，哥哥也不见了。突然，外面有蝴螟结一样的东西在闪烁（是警笛），一大推人都不见了，我不敢出声，因为妈妈叫我躲好等她接我，我是乖孩子，会乖乖不动等待妈妈的。我躲的很好，不然已经被发现了，可是根本没人来接我，好饿啊，饿死了。"
    },
    {
        "puzzle": "一天，小明到监狱里面探望他的朋友小王。接着小明回家后就",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的朋友因杀人而入狱。入狱前小王将一瓶毒酒和一张照片藏在柜子后方。小明和小王是网球双打伙伴，得知小王入狱后小明到监狱去探望小王。小王知道小明有酗酒的习惯，并跟他说：“我珍藏了-瓶好酒想给你，本来想亲手给你的，但现在却不行了，我把那瓶就放在柜子的后方。另外，酒得旁边有一张我和你去年夺冠的合照，我希望你能替我好好保管。小明回去后果真发现了这两样东西情绪激动之下握着这张照片，在看不懂照片背面的西班牙文字句的意义之下，他认为那些字是小王给他的祝福话语，接着并灌下了这瓶毒酒打算开始借酒消愁，于是就这样死去。但其实，照片后面那些字不是祝福的话语，而是写着：“其实是我杀了人:不是小王，我才是凶手。"
    },
    {
        "puzzle": "一天，电视上播出一条新闻，某著名推理作家杀害了一名女性小明在电视机前开心的笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的爷爷是一名小有名气的推理作家，一次在家与名不得志的作家交流时，没忍住炫耀自己新写的作品的手稿，觉得-定能够大卖，那名作家出于嫉妒贪婪，将小明爷爷杀死并偷走手稿，以自己的名义出书，果然受到追捧名利双收。几年后小明以书迷的身份接近他，由于爷爷常跟小明讲自己脑海中的奇妙故事，小明据此写了推理小说打印出来并交给作家，请他提意见，作家见小说构思巧妙又打算据为己有，伪造了--堆假的原始手稿假装是自己写的，没想到妻子被小明的手稿中杀人凶手一模一样的的杀人方法杀死，此时，网上突然流出一份所谓“知名作家新小说泄露版”，警方发现小说中手法与作家妻子死法一样且几乎不会被其他人想到，去作家家搜查果然捜到手稿，作家有口难辩，最终被逮捕。"
    },
    {
        "puzzle": "她愤怒，她哭了，她笑了，她震惊了！",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有一辆拥挤的大巴车上，女生站在司机旁边跟男友打电话，因为男友和小三的事情，她非常大声，情绪非常激动（她愤怒），一度吵到了大巴车司机，大巴司机是小三本三（男），乘客轰她下车后，她找了个地方哭（她哭了），几小时后天黑了，她才发现这是在荒郊野岭,司机下班后折回找她，她以为是来救她的（她笑了），却伸着廣爪向她袭来（她震惊了），之后被害井抛尸荒野。"
    },
    {
        "puzzle": "一名保险推销员，某天下班回家，看见一个小姑娘在路边哭泣走进观察的时候发现小姑娘胸前有一一串钥匙。第二天，警方发现小姑娘赤裸的死在街边。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "保险推销员想让女孩的父母跟他办保险，于是他杀了女孩，之所以要让她全身赤裸是因为想让所有人知道女孩是他杀，而不是意外，凶手取走了她身上所有的东西，当然也包括钥匙，那么女孩的父母就会知道钥匙落入凶手之手，排除意外丢失的可能，就会很恐惧，因为凶手很可能利用钥匙潜入他们家，保险员此时就可以说服他们买保险。"
    },
    {
        "puzzle": "抱着盒子的姑娘渐渐远去，下午家里的红纸少了几张，晚上一个小男孩捧着一团东西去了同一个地方。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸因心脏病去世，妈妈为他送葬，本来不想让小男孩知道,可是他还是知道了。半夜，小男孩偷偷拿了家里几张红纸，包裹着沙土做成心脏的样子，他捧着那颗心脏，沿着妈妈在沙土留下的脚印，向爸爸的坟墓走去。他以为这样爸爸就能回来，可是毕竟孩子太天真了，他的爸爸和他永远隔绝开了。"
    },
    {
        "puzzle": "一栋楼里连续1个月发生命案，一共死掉15个人分别是某一栋楼的住户，但警方却一直没抓到犯人，就在警方一筹莫展的时候，一个人却突然自首说自己是罪犯。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "两父女住在栋面朝大海的房子里，从小相依为命，有一-天对面建起了一栋高楼挡住了海景，父亲就和女儿说:以后我们早晩会搬去那里。过了4年，父亲由于一-直不停的工作而累垮了，但是存下来的钱却比不过现在的高房价，房子买不起了，女儿很伤心，为了让这栋楼的房子降价，履行和父亲的约定。女儿开始陆续杀人，杀了15个人以后，她看中的那一间房子，终于被房东以极低的价格卖给她。可是当她父亲察觉到这件事是女儿做的时候心脏病发作，临死前告诉女儿不要再错下去了，让她自首并让他女儿答应她。这是她和父亲的最后--个约定。"
    },
    {
        "puzzle": "家里来了客人，奶奶抱着妹妹，小女孩牵着妹妹小小的手指，“你妹妹太可爱了，像个洋娃娃!”每听到客人夸奖妹妹的话，小女孩就非常开心!可是不久后，妹妹和奶奶都死了，小女孩崩渍了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小女孩很喜欢洋娃娃，尤其喜欢把娃娃的四肢剪下来玩。夜里，小女孩睡着了奶奶就偷偷给她把娃娃缝回去。于是小女孩以为洋娃娃都有“自愈能力”。而，冈咄生没多久的妹妹有一双大眼睛，长得非常可爱，每次客人来都说妹妹就像个洋娃娃-样。小女孩便以为妹妹也有“自愈能力”，于是这天家里没有长辈时，当然最后妹妹死了，小女孩和全家人都奔溃了，奶奶得知原因后更是愧疚自杀了。"
    },
    {
        "puzzle": "儿子自杀了，留了一张纸条，母亲看了纸条后疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人嫁给富商后，为了财产制造意外杀了富商原配的儿子。后来生了一个自己的儿子，儿子却在得知女人又怀孕之后自杀了，纸条上写着:你杀了我，那我就让你反复生下我，在失去我。"
    },
    {
        "puzzle": "妻子从山上摔下。女儿说了-句话，他疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子带妻子去爬山，把她从山峰上推了下去。后来男人新娶了一个老婆，有了个女儿。几年后他带着女儿去爬山时，女儿对他说：“这次可不要再把我推下去了"
    },
    {
        "puzzle": "她说:冬天太冷了,我在她的房间里放满了取暖器，她很生气。她说，好讨厌下雨啊，于是我在她房间里挂满了晴天娃娃。可是，她怎么不说话了呢？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是她的追求者，时时关注她的动态，她说冬天冷，我就潜入她的房子放满取暖器，导致她以为有人恶作剧，非常生气。她说讨厌下雨，我不知道怎么办了，只好杀死很多人，把他们做成晴天娃娃，挂在她的房间里，可她看见却吓死了"
    },
    {
        "puzzle": "我被关了三个多月了，这天有光照进来，不行，还没到时间！",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是胎儿，三个月的时候我的母亲被查出怀孕了，得知消息后的母亲非但没有高兴，反而格外慌张，因为我是父母冲动的产物。今天是我被取出来的日子，手术室的灯光照了进来，我也离开了人世。"
    },
    {
        "puzzle": "他换了座位，他死了，他该死\"人不能以肉体之躯抵抗钢铁”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "一个逃犯上了一辆公交车和，我坐在窗边，他和我换了位置方便他观察情况，但是一辆装满了钢筋的大货车和公交车迎面相撞，他坐在窗边被插穿了脑袋死了，这时候我认出他是被通缉的在逃杀人犯。他罪有应得，人不能以肉体之躯抵抗钢铁，罪犯逃不出天网恢恢。一个天道好轮回的故事。"
    },
    {
        "puzzle": "有一个男人，在深山老林里迷路了，借住在一户人家家里，第二天起床他尖叫了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这户人家有一个先天残疾，没有腿的小孩。夫妻为了不让孩子自卑搬到了深山老林，然后把自己的腿剁了，给孩子营造人就是没有腿的假象。男人借住后，夫妻为了不让孩子发现事实，下药迷晕男子后将他的双腿砍了。"
    },
    {
        "puzzle": "女孩上车后一路疾驰，突然她伸手捂住口鼻摸了下口袋，后来女孩死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "盲人女孩下班打车回家，每天定时堵车的路段却一路畅通，女孩心中有点担心。这时她又闻到车里的血腥味，女孩认定司机是坏人，她想报警，摸了口袋发现忘带手机，于是慌忙跳车逃跑。摔死了。其实血腥味是司机买的猪血，—路畅通是因为司机看女孩是盲人想绕远路多赚一点。"
    },
    {
        "puzzle": "他胆子很小，却偏偏爱看恐:怖片，明明家境很富裕，却把自己活生生地饿死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他患上了少见的心理疾病活死人病候群。虽然身体健康，他却觉得自己已经死了。虽然胆小，但在他看来，恐怖片里的僵尸死人等，都是他的同类，不但不怕，反而觉得亲切。死人是不用吃东西的，所以他把自己活活饿死了"
    },
    {
        "puzzle": "梦中总有个看不清脸的恶魔，想法设法地折磨我，于是求助心理医生，在看到医生的瞬间，我疯了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一只被妈妈控制，明明没病却要装病，进行各种治疗的傀儡女孩。我看到的医生竟是长大后的自己，这时我终于知道，原来那不是噩梦，是我一直活在自己编织的美梦中，直到噩梦把我拉回了现实。"
    },
    {
        "puzzle": "这可不是灵异照片，上面没有任何灵气。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "今天是我的生日，我和朋友们约好在一个别墅轰趴，有个朋友本来答应参加却失约了。临走前，我们大家准备合影一张，洗出来的照片大家都很满意。可是当晚我认真看的时候，却发现照片后面的柜子里隐约有个人探出头，脸很白，头发垂到地±o难道是发生了什么灵异事件麻?我冒出一身冷汗，去找巫师鉴定，可巫师却说这张不是灵异照片，我更慌了。这时我接到了一个电话，是我朋友打来的，他说那个失约的朋友失踪了，原来照片上的并不是鬼，而是那个失踪了的朋友，他被人杀了藏在柜子里。"
    },
    {
        "puzzle": "“这些钱狗把你买下来吗?”她问。我发誓再也不会与她相见。十年后的她不再是处女，而我也满身伤痕。我们再也不会相见了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“我”是个玩偶，她小时候从橱窗中看到了我并想把“我”买下来但是家里并不是很有钱“我”看到她渴望的眼神于心不忍暗自发誓不要再见到她了企图让她忘记自己，10年后女孩成了家有了自己的孩子，而“我”此时早已成了一个坏掉并过时的旧玩具被扔在了垃圾桶里所以我们不可能再见了“我”曾经发的誓也成真了。"
    },
    {
        "puzzle": "小红帽带着糕点出发，危险如影随形。枪声及时响起，却终究晚了一步。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小红帽的妈吗做了-些糕点让小红帽带去给外婆。出发前，-直嘱咐小红帽不要偷吃。小红帽答应了，因为她知道妈吗在糕点里下了毒，想要得到外婆的遗产。可是她们没有发现，谈话的过程都被门］外的狼听到了。小红帽到了外婆家，发现外婆穿着往常的衣服缩在床上，但和平时有些不一样。那是朗伪装的外婆，他刚要吃掉小红帽时，门开了，伴随着-声枪响，狼倒在了血泊中。\"你和你的外婆安全了。”狼红着眼睛，看着小红帽在床底找的他藏起来的外婆，看着她把带来的糕点喂到外婆的嘴里，他挣扎着想阻止，可是他快要死了。他流着泪，“还是来不及了，对不起，我救不了你。”狼在幼年时曾被外婆从猎人的手里救了出来，他一直在等机会报答外婆。他发现了小红帽他们的计划，想赶去救下外婆，可是，还是差了一步。"
    },
    {
        "puzzle": "-现昙华，大雨落下。粉面罗刹，声唱俱佳。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她是一名风头正盛的新人歌剧演员，因为漂亮的外形和优秀的业务能力遭到他人嫉妒。竞争对手找到她的狂热粉丝恶意挑唆：“她年纪轻轻就受百万人追捧，身边接触的优秀绅士不知凡几，何时会看上你呢?”于是某个雨夜，这个狂热的粉丝在跟踪她回家的路上，将硫酸泼在了她的脸.上。她容貌俱毁，再也不能表演了。那天晚—上她脸上的水痕，究竟是雨还是泪呢。她隐退不久，那名竞争对手也神秘消失了。"
    },
    {
        "puzzle": "有声的色彩都是有罪的。罪恶的东西，就应该在黑暗中，静静地呆着。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我原本有一个很美好的生活，妻儿在旁，日子无忧无虑。可是有天，一场突如其来的大伙改变了这一切。我的妻儿都死了，我也变得一无所有，甚至丧失了视觉和听觉。他们说，这场火是一场事故，可我觉得，这是有人蓄意为之的，并且那个人就在自己身边。于是，我决定展开-场报复。我用最隔音的墙打造了一个地下室，井且地下室的门从里面关上了就再也不能打开，我还做了点小陷阱，引导那个人走进地下室，我知道他一定回来的，我要让他跟我一样，永远静静地待在黑暗中。可是再次醒来，当我想去确认那个人是否已经落入我的陷阱时，我却发现，被关在地下室的人是我自己。我明白了，原来那个人是我，是我自己衍生出来的另一个我所不知道的人格，我们两个就像两个独立的个体，互不知道，却都在对方的生活里。那场火是他放的，他在生活中发现了我生活的痕迹，缺以为我是妻子的出轨对象，他看着妻儿欢乐美满的画面怒从中来，放火烧了整一个家。视觉和听觉的消失并不是大火造成的，而是另一个人格对妻儿玩乐的画面和声音感到愤怒，-气之下自我封闭导致的。"
    },
    {
        "puzzle": "一部摄像机清晰的记录下了某推理作家的死亡过程，小明看着这个影像开心的笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "推理作家是X市有名的推理大师，其出彩的写作能力使得其所写的推理类小说大卖热卖，所以也会被当地警察带到犯罪现场对案件进行推理以及做些案件的直播破解教学。小明是一名有过5点的无业游民，小明之前所制造的密室杀人是天衣无缝的，警察们都破解不来，但是却被这名作家破解了，使得小明进了监狱，但是却因为杀人未遂被关了-段时间就被释放出来To此时，作家参加一次案件推理的直播活动，要亲自示范此次案件的逃生技巧。小明对于此次活动做足了准备，他拿了一个假身份应聘成为道具组工作人员，并且对道具做了手脚。作家在摄像机的直播录制下示范逃生过程却发生“意外”导致身亡。观众只会觉得是一场直播意外，没有人知道这是一场计划已久的阴谋。小明看着这个直播影像开心的笑了"
    },
    {
        "puzzle": "四四方方的小盒子，昏暗潮湿。密密麻麻的小飞娥，扌卜棱闪烁。他们密集攀爬涌动，邀我共舞，我欣然接受了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我患上了抑郁症，从此家里的窗户上就装.上了厚厚的窗帘。明明活得犹如一只幽灵见不得阳光，却还是疯狂的想要寻觅那份温暖，“就像那扑火的飞蛾，唯美又可怜。”我望向房屋上方不停围着白炽灯打转的飞蛾怔怔的想到。家里的飞蛾越来越多，以至于竟然有一只飞蛾不小心冲进了我的异腔。半夜做梦，我梦到很多很多的飞蛾从四面八方的向我飞来，然后敛住翅膀从脚掌慢慢爬上身躯，密密麻麻的移动，痒痒的。渐渐的，我好像也变成了一只飞蛾，透明脆弱的翅膀慢慢的从肩胛骨处生长，缓缓煽动'托起了我的身躯。我飞了起来，连同那些飞蛾一起跳舞，我从未如此快活，可惜，这只是易碎的梦，醒来之后的身躯依然疲惫而沉重。“不如最后体验一次把，连同久违的温暖”我掀开窗帘，打开窗户跳下了楼，终于变成飞蛾飘飘的舞起生命之歌。"
    },
    {
        "puzzle": "一个男人在很高的建筑物下面看报纸，看到一条消息后突然跑到楼顶打开灯，然后跳楼自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他看到的新闻消息是近期由于灯塔的灯没开导致轮船失事。而他就是灯塔的管理人，于是他很内疚，去顶楼开灯，然后以死弥补之前犯下的错"
    },
    {
        "puzzle": "父母对女孩说她绝对不能打开地下室的们，，否则会有可怕的事情发生。一天女孩趁父母不在便把门打开了，她直接惊呆了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他看到的新闻消息是近期由于灯塔的灯没开导致轮船失事。而他就是灯塔的管理人，于是他很内疚，去顶楼开灯，然后以死弥补之前犯下的错"
    },
    {
        "puzzle": "一对姐妹在帮母亲办完丧礼后，姐姐就杀了妹妹",
        "question_list": [],
        "answer_list": [],
        "final_answer": "父母担心孩子受外界欺负，将女孩养在地下室，不许孩子出门。直到有一-天女孩打开了地下室的门，看到了外面鸟语花香，才知道父母为了保护自己骗了自己。"
    },
    {
        "puzzle": "个许久未见的老友突然给我发信息，内容如下“XXX,在吗?”我看到感觉不对劲，并回了一句：“你是谁?”他回复：“我是XXX。”你不记得我了吗?我立马报警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "姐姐在丧礼上看到了一个感兴趣的男生，但是丧礼结束后，姐姐一直找不到男生。为了再次见到他，姐姐杀了妹妹举办了第二次丧礼。"
    },
    {
        "puzzle": "我是一个拥有阴阳眼的人，能看到身边的鬼魂。有天，我的阴阳眼突然没了。直到重新遇上他，我才明白发生的事情。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“他”是一个知道我拥有阴阳眼的人。有天，他杀了我并夺去了我的眼睛。而我则变成了鬼魂留在世间。可我并不记得那段时间发生的事情，我就直以为我还活着。因为和以前一样，我能看到身边的鬼魂。知道有天我重新遇到了他，看到了他的眼睛。突然全部都记了起来。"
    },
    {
        "puzzle": "I高三那年，我做了一件错事没被发现而很开心。多年以后，我I却为这落下了眼泪。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "高三那年，我家经济条件不好，钱不够交学费。我只能把假钱放进去交学费，老师好像并没有发现。能够继续读书，这让我感到了小确幸和开心。毕业后从其他同学那里听闻当年是老师发现了，但为了能让我完成学业，不被学校开除。就用自己的工资替换了假钱帮我交了学费。多年后的同学聚会，我重新见到了老师。我鼓起勇气向老师说出了这件事情并因为这件事向他道歉。可老师却说：“这么多年过去了，你都能为这事向我道歉。那能让你继续学业是我教师生涯做过最正确的事情。"
    },
    {
        "puzzle": "有_天,小女孩对妈妈说，那个伯伯是谁啊。个礼拜后，小女孩死了，妈妈和伯伯都很伤心。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小女孩其实不是小女孩。其实是一一个奶奶，她得了老年痴呆症，把女孩认成了妈妈，丈夫认成了伯伯。最后那个奶奶自然死了。“妈妈”和“伯伯”都很伤心。"
    },
    {
        "puzzle": "A和B—起出门，过了不久.就被抓走To",
        "question_list": [],
        "answer_list": [],
        "final_answer": "AB是监狱的囚犯，某天AB逃狱了，但是不久后却被警察抓了回去。"
    },
    {
        "puzzle": "小明的妈吗经常煮好精美的早餐和午餐给小明带去学校吃。有一天，妈吗打了小明一巴掌，大声说到你不是我的儿子并报了警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有另一个人物叫小华。小华是小明的同桌，小明经常带好吃的早午餐带回学校吃惹得小华很羡慕。小明也经常向小华炫耀。令小华也想有那么好吃的早午餐。于是某天晚一上自习放学后，把小明给杀了。将脸皮粘在自己脸上，小明妈妈看到了带上小明脸皮的小华。就打了小华一巴掌，并报了警。"
    },
    {
        "puzzle": "A和B坐在沙发上，用手互相勾搭着对方。站在-旁的C也露出了可爱的笑容。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "AB是c的爸爸妈妈，C小时候就很会缝纫。爸爸妈妈经常称赞她。她感到很幸福。过了不久，AB-位内被炒觥鱼，然后没有了生活来源。就把脾气发泄到C身±oC终于受不了，于是趁着AB不注意把他们给杀了。然后缝成了以前对她的样子。"
    },
    {
        "puzzle": "一名男子被杀死在房间里，四周没有任何血迹，和疑似凶器的东西。只有一个吊着的电话筒在他身边。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子有心脏病，有一天，他太晚睡了。导致了心脏病突发。想打电话求救但是却来不及晕倒在地而死亡。"
    },
    {
        "puzzle": "多年未归的儿子回家祭拜死去不久的父亲。第二日，儿子的遗体被发现在灵堂。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "戒毒中的儿子祭拜父亲时看见父亲的骨灰盒，当夜瘾病发作的儿子溜进灵堂，神志不清下吸入大量骨灰，窒息而死。"
    },
    {
        "puzzle": "她是这样存在着，如此美丽，如此..不朽。如果没有看到她脸上的表情，我想我也会这么说吧。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "恐怖马戏团的帐篷中，我参观到了一个被砍掉四肢的女性真人蜡像。"
    },
    {
        "puzzle": "他每周都会给我看这张照片，我是不会说出去的。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在监狱里。但是我不曾犯罪，犯罪的是我的丈夫。他曾经以女儿相要挟，逼迫我顶罪，并且不能告诉任何人，就算对狱友也不可以说任何一个字。如今他每周都会带着女儿的照片，看似探视，实则威胁我。他让我看着她的照片，警告我如果我敢说出一个字，女儿就完蛋了。"
    },
    {
        "puzzle": "我去了很多地方。我给他出了一道选择题，不管他选哪个，答案都是正确。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我绑架并杀害了一个女孩，并引她父亲回到自己的房子，然后给了她父亲-道选择题，“你猜猜在哪个房间能见到你的孩子”。“他”可能以为回答正确了就能见到活的女儿吧。但“他”的任何回答都是正确的，因为“我”把他的女儿分尸并摆放在他每个房间，他在哪一个房间都可以见到她。"
    },
    {
        "puzzle": "一个房客搬进了新家，发现墙上有个很小的裂缝每次他往缝里1看都只能看到一片红色。他就问房东隔壁是什么，房东告诉他以后他马上搬走了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "隔壁住了一个红眼病人，而且老是往这边看（房东告诉他隔壁住了红眼病人）"
    },
    {
        "puzzle": "深夜，一个男子的家里厕所坏了，所以去外面上公厕。第二天警察来找他，说厕所昨晚发生了杀人案，刚好和他上厕所的时间一致。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手在刚刚杀完人的时候听到了厕所外面的动机，原来是有人出来.上厕所，凶手为了不让事情败露，所以把自己打扮成了清洁工的样子，然后把死者当成了拖把假装在拖地，当时厕所灯光十分的昏暗，所以去。上厕所的主人公并没有发现什么异常，只看到一个清洁工在拖地而已，其实是凶手把死者倒立，用死者的头发在拖地。"
    },
    {
        "puzzle": "小明是个网购达人，非常喜欢逛购物网站，购物网站也总是能推荐到他喜欢的、想买的东西。最近网站经常给他推荐速冻水饺。后来小明死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明是个购物达人，天天不干活不赚钱，沉迷逛购物网站。小红好生S气恨不得剁碎了他。小红日日夜夜想这件事，晚_上睡觉的时候说梦话:用菜刀把他剁成馅儿。手机听到了，就给小明推荐速冻饺子。小明不明白推荐水饺是为什么，也没察觉老婆的杀意。后来某-天，小红真的动手了，他就死了。"
    },
    {
        "puzzle": "丈夫回家时，保姆一脸呆滞地看着地上已经断气面目全非的六个月女童，妻子情绪失控大声尖叫不久警察带走了保姆。二十年后保姆出狱杀死了这一家人。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "保姆是男的，爱上了女主人，酒后与她发生了X关系致使女主人怀孕，由于男主人有X障碍，保姆觉得孩子很可能是他和女主人的一夜情的结晶，但随着孩子长大出现了男主人的一些外貌特征，保姆怀疑孩子不是他的，嫉妒愤怒地摔死了孩子。"
    },
    {
        "puzzle": "一个炎炎夏日，遛狗中的我坐在公园的长椅上休息。刚坐下不久，我便立刻起身走了。没过多久，我看到地上有个黑色的钱包。我冷汗立刻出来了，心知难逃一死。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在遛狗时目睹了一场凶案，我想和我的狗配合伪装我是个瞎子，但是我下意识的低头看了地上的钱包，凶手其实一直跟着我，发现了我看了钱包，明白我不是瞎子，所以我必死。"
    },
    {
        "puzzle": "我的哥哥总是睡不好，于是我想了个法子让他终于睡好了，结果他醒来，却吓疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥都很穷，哥哥在城市打拼。我和哥哥睡在间小出租屋内，买不起一个窗帘，哥哥本来就很累了，却每夜每夜被窗外的灯晃得睡不着觉。于是那天，我找了看起来个皮糙肉厚的人，把他杀了，割下了他的完整的皮，封在了窗户上。屋内终于没有了外面耀眼的灯光，哥哥睡得很熟很好。第二天早上起来，我问哥哥说：“哥哥睡得好吗?”哥哥回答睡得很好，但当他看见那张我精心制作的“窗帘”，却吓疯了。"
    },
    {
        "puzzle": "八岁的女儿不见了，在游乐园的监控中我们看到个成年男人带走了她，我的男朋友却在回家途中杀死了我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我，我把女儿卖给了另一个恋童癖。男朋友从监控中看到那人从他的行为举止中发现了男人也是恋童癖，也明白了我的所做作为，于是，杀了我。"
    },
    {
        "puzzle": "小明为什么-天洗七次头。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的母亲被入室劫匪在彼此搏斗中杀死，当时小明并不在家，当他回家时发现自己母亲死亡，头颅被砍掉找不到了（因为是亲人，所以看到身体小明还是能确认是自己母亲），他报了警，警察来整理现场也一直没有找到母亲的头颅，几年后，小明在浴室洗头的时候无意间一滴属于人体组织液混合血液的液体低落在他头上，他好奇向上看，看见排风扇里自己母亲干枯的头颅，小明被吓疯了，从此每天洗七次头甚至更多次。"
    },
    {
        "puzzle": "小明到柜台办理手续，小美在-旁等待。小美突然离开小明身边，走到走廊另一头。之后小明在走廊的另一头看到小美时候，疯了一样的转头就跑。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明和小美在酒吧相遇，聊的甚欢。于是决定去酒店开房。小美突然想要去厕所，于是离开了小明去走廊另一头的厕所上厕所。当小明办理好住房手续去找小美，发现小美从男厕出来。于是转头发了疯的跑掉了。"
    },
    {
        "puzzle": "房里有两个人，床位相邻，一个靠着窗边，一个不靠窗。一天晚上，窗边的死了，另一个隔天也死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这是在医院的病房里。他们都是无法自主下床的病人，只能靠着仪器生存。两个人因此也结成了朋友。其中一个人A靠近窗户，另一个B没有。B由于心灰意冷，直有自杀的念头。A为了B有生存下去的意愿，每天跟他说窗外的景色如何美丽。而B不能看到景色而心生妒忌.有一次A出现状况无法呼叫护士。B本可以呼叫，但为了窗边的床位而选择不呼叫，导致了A死亡。等到B躺在了A的床位看着窗外的景色，才明白了A的用意。于是悔恨的自杀了。"
    },
    {
        "puzzle": "山姆是一位心善的富翁，有天他在拍卖会上高价拍下一个他并不喜欢的东西。半年以后，他渐渐发现参加拍卖会的人除了自己全部都死了。他也为自己的行为感到骄傲。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他有天被邀请参加一一个以慈善为名的拍卖会。但是背后确是一个犯罪集团组织的“女性奴隶”的拍卖会。而这些奴隶都是犯罪集团的女杀手，他们的目的是进入富豪家，然后将他们抢劫一空并杀害。山姆为了这些奴隶不被其他人所“摧残”0只能高价拍下一个奴隶回家。回到家后，山姆对待她像对待女儿一样。女杀手被感动了。她就偷偷的离开了山姆家。而其他富翁并没有山姆那样，最终被杀害且财产被抢劫一空。"
    },
    {
        "puzzle": "妈妈带我去玩保龄球，我很开心，但我只玩了一次，之后妈妈就再没带我去玩过。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个盲眼小孩，从我小时候起，爸爸就经常打骂妈妈。本来爸爸答应了要带我去玩保龄球的，但这个承诺-直拖欠了很久也没有实现。终于有一天，妈妈受不了爸爸，在争吵之中把爸爸杀了并分尸。妈妈带着我跑到很偏僻的地方，拿着爸爸的头问我：“宝宝要跟妈妈一起玩保龄球吗?”我很开心，于是把递过来的爸爸的头当成了保龄球扔了出去，我“打球”的时候，妈妈偷偷把爸爸的尸块扔到了山里的各个地方。第二天，妈妈被警察找上i来抓了，她再也没有带我去玩保龄球了。"
    },
    {
        "puzzle": "一位父亲带着女儿来便利店买东西，女儿偷了东西，店员报了警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "人贩子拐卖儿童，谎称自己是孩子的父亲，孩子为了自救拿了便利店的东西，店员发现端倪于是报了警。"
    },
    {
        "puzzle": "小明出轨后，妻子死而复生。他们都实现了自己的愿望。“你们真恩爱呀。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明出轨了，为了让小三名正言顺的出现在他身边，他一边假装疼爱妻子，一边暗中和小三密谋将妻子用毒药杀害并且破坏尸体的脸部，最后让小三整容成妻子的样子出现在小明身边，由此摆脱嫌疑。但是这一切被妻子知道了，于是她将计就计将毒药调换把小三反杀并破坏脸部，欺被字成表子地将计就计场毒药调换把爱，近好像变得更恩爱了。小明以为妻子在他和小三的密谋下死了，妻子则是成功杀死并冒充小三活了下来，丈夫还发自真心的疼爱自己，从各自的角度看，两人的愿望都实现了。"
    },
    {
        "puzzle": "我精心打扮好，准备去见男朋友的家长，一进门我却慌了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的室友前阵子和一个年级有些大，但体贴多金的男人谈了恋爱，她以为自己找到了真爱，却没有想到这个男人不仅有家室，还同时脚踏三只船，所谓的\"体贴”不过是老男人对年轻女孩的降维打击。后来我去渣男的单位揍了他一顿帮舍友出气，并让他以后别再来骚扰我舍友，不然见一次打一次，那个男人自觉理亏，也没再追究。今天我去男朋友家见父母，-进i］就看见了那个当初被我胖揍的渣男，男朋友之前还一直羡慕自己爹妈多年来和谐稳定的夫妻感情现在我要不要再打渣男-顿然后告诉他真相呢。"
    },
    {
        "puzzle": "瓷器一-个接一个地碎掉，我发现了弟弟的秘密。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "弟弟特别喜欢我，瓷器上面的样式很像我讨厌的人，有次我很好奇的拿瓷器看上面的样式，无意中打碎了那个瓷器，然后我就得知了那个人被杀的消息，我明白了打碎一个瓷器，弟弟就杀对应的一个人，后来我就故意打碎那些瓷器。"
    },
    {
        "puzzle": "飞机飞到半空中，最后落到她怀里。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他出生在-一个小县城里，那里教育资源落后，他却一直有个当飞行员的梦想。终于，他考上航空学校，即将要去大城市，坐上他梦寐以求的飞机了，可是，他的奶奶舍不得他走，怎么挽留都阻止不了他。临走前的那一天，他的奶奶把他叫到跟前，对他说，再让奶奶摸一摸你吧。结果奶奶拉过他的手一口咬下去，活生生的把他一根手指头咬掉了。就这样，他便只能永远地留在那个小县城，永远地留在奶奶身边了，飞机指孙子当飞行员的梦想，“落在她怀里”就是梦想被奶奶毁了。"
    },
    {
        "puzzle": "“抱歉了，我尽力了”“别看了，忘了他吧。”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的爱人出了车祸，在医院靠着呼吸器和点滴维持着生命。从某一天起，他慢慢变得衰弱起来，医生对我说他可能时日无多了，不出几天，他死他慢慢变得嘉起病厝失对我说他可態时日多生我世:死了。“对不起，他的病情突然恶化，我尽力了。”医生向我道歉。我接受不了，明明之前还好好的，为什么会这样?盖着白布的爱人被推出手术室，我想去看他最后一眼，可被医生阻止了：“看到遗体会很难受的他翼:是个保食的医生，尽管有被安慰到，我还是想偷偷着他一眼在他被推进焚烧炉之前，我忍不住掀开了白布，却发现，爱人的胸膛有被打开的痕迹，伤口被草草缝合，里面的器官都不见了。原来医生属于器官贩卖组织的一员，经常利用职务之便谋杀住院的病人，来获取他们的器官，我出了车祸昏迷不醒的爱人，也成为了他们的目标。"
    },
    {
        "puzzle": "我和朋友一起去吃饭，可还没吃完，却发现朋友不见了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是蚊子，和朋友一起去咬人，然后我还在吸血，但是朋友已经被打死。"
    },
    {
        "puzzle": "“祝你们幸福。\"眼前的两人看着我，眼里落下泪来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我最近发现女儿和一个网友早恋了，这周末那个男生翘了补习班跑来我们的城市找她玩，被我再楼下抓个正着。他俩知道我-直反对这段恋情被抓到时表现的非常抗拒，两人都说不能离开对方，如果强行要他们分开，他们就一起自杀。我笑笑，拿出502胶把他俩的手粘在了-起，既然这么不愿意分开，那就只能满足他们的愿望了。"
    },
    {
        "puzzle": "俩兄弟在酒吧喝酒，突然他们开始争吵，其中人开抢杀了另一人，不久后自己也不幸身亡。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "两兄弟是连体人，其中一人抱怨另一人，掏枪杀了他，他自己也因为失血过多死亡。"
    },
    {
        "puzzle": "小明看望空巢老人，老人却持起手枪，对准了小明。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明是房东，老人是一位盲人，但听力却十分灵敏。老人家里水龙头是坏的，不断地滴水，这天老人没有听到水滴声，便知家里停水了。小明不可能知道停水了还来泡茶，老人怀疑小智图谋不轨。"
    },
    {
        "puzzle": "小明住在山顶的小屋里,晚上半夜听见有人敲门他去开人没看到人，于是去睡了，又听到有人敲门，出去一看还是没人，反复多次，第二天发现山下一具死尸，警察过来把小明带走了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为小明听到的敲\"］声是山下的人好不容易爬到上面去所敲的，一开门却被门推下山了，所以打开门后看不到人。然后那人重新向，上爬，好不容易爬了.上去再敲门，又是一样的情况，如此反复几次，那人终于摔死了，小明也就成了凶手。"
    },
    {
        "puzzle": "第一天小熊没有啦，第二天洋娃娃没有啦，第三天小木偶没有啦，最后一天全都不见啦，我很伤心，因为看见蝴蝶结还在发光。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸很强壮，像小熊，妈妈美美的，像洋娃娃，哥哥呆呆地，像小木偶.我和爸爸妈妈哥哥去银行，突然一大推人冲了进来（是劫匪）妈妈把我藏了起来，我只能从缝中看外面的世界。（他们把这里的人当人质）天黑一下，爸爸不见了（被枪毙了），天再黑一下，妈妈不见了。天又黑了一下，哥哥也不见了。突然，外面有蝴蝶结一样的东西在闪烁（是警笛），-大推人都不见了，我不敢出声，因为妈妈叫我躲好等她接我我是乖孩子，会乖乖不动等待妈妈的。我躲的很好，不然已经被发现了，可是根本没人来接我，好饿啊，饿死了。"
    },
    {
        "puzzle": "一天，小明到监狱里面探望他的朋友小王。接着小明回家后就自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的朋友因杀人而入狱。入狱前小王将一瓶毒酒和一张照片藏在柜子后方。小明和小王是网球双打伙伴，得知小王入狱后小明到监狱去探望小王。小王知道小明有酗酒的习惯，并跟他说：“我珍藏了-瓶好酒想给你，本来想亲手给你的，但现在却不行了，我把那瓶就放在柜子的后方。另外，酒得旁边有一张我和你去年夺冠的合照，我希望你能替我好好保管。小明回去后果真发现了这两样东西，情绪激动之下握着这张照片，在看不懂照片背面的西班牙文字句的意义之下，他认为那些字是小王给他的祝福话语，接着并灌下了这瓶毒酒打算开始借酒消愁，于是就这样死去。但其实，照片后面那些字不是祝福的话语，而是写着：“其实是我杀了人，不是小王，我才是凶手。"
    },
    {
        "puzzle": "一天，电视上播出一条新闻，某著名推理作家杀害了一名女性,小明在电视机前开心的笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的爷爷是一名小有名气的推理作家，一次在家与一名不得志的作家交流时，没忍住炫耀自己新写的作品的手稿，觉得-定能够大卖，那名作家出于嫉妒贪婪将小明爷爷杀死并偷走手稿，以自己的名义出书，果然受到追捧名利双收。几年后小明以书迷的身份接近他，由于爷爷常跟小明讲自己脑海中的奇妙故事，小明据此写了推理小说打印出来并交给作家，请他提意见，作家见小说构思巧妙又打算据为己有，伪造了一堆假的原始手稿假装是自己写的，没想到妻子被小明的手稿中杀人凶手一模样的的杀人方法杀死，此时，网上突然流出一份所谓“知名作家新小说泄露版”，警方发现小说中手法与作家妻子死法样且几乎不会被其他人想到，去作家家捜查果然搜到手稿，作家有口难辩，最终被逮捕。"
    },
    {
        "puzzle": "她愤怒，她哭了，她笑了，她震惊了！",
        "question_list": [],
        "answer_list": [],
        "final_answer": "其他人想到，去作家家搜查果然搜到手稿，作家有口难辩，最终被逮捕。情，她非常大声，情绪非常激动（她愤怒），一度吵到了大巴车司机，大巴司机是小三本三（男），乘客轰她下车后，她找了个地方哭（她哭了），几小时后天黑了，I她才发现这是在荒郊野岭，司机下班后折回找她，她以为是来救她的（她笑了）,I却伸着廣爪向她袭来（她震惊了），之后被害并抛尸荒野。"
    },
    {
        "puzzle": "一名保险推销员，某天下班回家，看见一个小姑娘在路边哭泣，走进观察的时候发现小姑娘胸前有一串钥匙。第二天，警方发现小姑娘赤裸的死在街边。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "I保险推销员想让女孩的父母跟他办保险，于是他杀了女孩，之所以要让她全身赤|裸是因为想让所有人知道女孩是他杀，而不是意外，凶手取走了她身上所有的东西，当然也包括钥匙，那么女孩的父母就会知道钥匙落入凶手之手，排除意外丢失的可能，就会很恐惧，因为凶手很可能利用钥匙潜入他们家，保险员此时就可以说服他们买保险。"
    },
    {
        "puzzle": "抱着盒子的姑娘渐渐远去，下午家里的红纸少了几张，晚上一个小男孩捧着-团东西去了同一个地方。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "爸爸因心脏病去世，妈妈为他送葬，本来不想让小男孩知道，可是他还是知道了。半夜，小男孩偷偷拿了家里几张红纸，包裹着沙土做成心脏的样子，他捧着那颗心脏，沿着妈妈在沙土留下的脚印，向爸爸的坟墓走去。他以为这样爸爸就能回来，可是毕竟孩子太天真了，他的爸爸和他永远隔绝开了。"
    },
    {
        "puzzle": "-栋楼里连续1个月发生命案，一共死掉15个人分别是某一栋楼的住户，但警方却一直没抓到犯人，就在警方一筹莫展的时候，一个人却突然自首说自己是罪犯。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "两父女住在一栋面朝大海的房子里，从小相依为命，有一-天对面建起了一栋高楼挡住了海景，父亲就和女儿说:以后我们早晚会搬去那里。过了4年，父亲由于一直不停的工作而累垮了，但是存下来的钱却比不过现在的高房价，房子买不起了，女儿很伤心，为了让这栋楼的房子降价，履行和父亲的约定。女儿开始陆续杀人，杀了15个人以后，她看中的那一间房子，终于被房东以极低的价格卖给她。可是当她父亲察觉到这件事是女儿做的时候心脏病发作，临死前告诉女儿不要再错下去了，让她自首并让他女儿答应她。这是她和父亲的最后一个约定。"
    },
    {
        "puzzle": "家里来了客人，奶奶抱着妹妹，小女孩牵着妹妹小小的手指，“你妹妹太可爱了，像个洋娃娃!”每听到客人夸奖妹妹的话，小女孩就非常开心!可是不久后，妹妹和奶奶都死了，小女孩奔溃了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小女孩很喜欢洋娃娃，尤其喜欢把娃娃的四肢剪下来玩。夜里，小女孩睡着了，奶奶就偷偷给她把娃娃缝回去。于是小女孩以为洋娃娃都有“自愈能力”。而刚出生没多久的妹妹有-双大眼睛，长得非常可爱，每次客人来都说妹妹就像个洋娃娃一样。小女孩便以为妹妹也有“自愈能力”，于是这天家里没有长辈时，当然最后妹妹死了，小女孩和全家人都奔溃了，奶奶得知原因后更是愧疚自杀了。"
    },
    {
        "puzzle": "儿子自杀了，留了一张纸条，母亲看了纸条后疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人嫁给富商后，为了财产制造意外杀了富商原配的儿子。后来生了一个自己的儿子，儿子却在得知女人又怀孕之后自杀了，纸条上写着:你杀了我，那我就让你反复生下我，在失去我。"
    },
    {
        "puzzle": "妻子从山上摔下。女儿说了一句话，他疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子带妻子去爬山，把她从山峰上推了下去。后来男人新娶了一个老婆有了个女儿。几年后他带着女儿去爬山时，女儿对他说：“这次可不要再把我推下去了。"
    },
    {
        "puzzle": "她说:冬天太冷了，我在她的房间里放满了取暖器，她很生气。她说，好讨厌下雨啊，于是我在她房间里挂满了晴天娃娃。可是，她怎么不说话了呢？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是她的追求者，时时关注她的动态，她说冬天冷，我就潜入她的房子放满取暖器，导致她以为有人恶作剧，非常生气。她说讨厌下雨，我不知道怎么办了，只好杀死很多人，把他们做成晴天娃娃，挂在她的房间里，可她看见却吓死了。"
    },
    {
        "puzzle": "我被关了三个多月了，这天有光照进来，不行，还没到时间！",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是胎儿，三个月的时候我的母亲被查出怀孕了，得知消息后的母亲非但没有高兴，反而格外慌张，因为我是父母冲动的产物。今天是我被取出来的日子，手术室的灯光照了进来，我也离开了人世。"
    },
    {
        "puzzle": "他换了座位，他死了，他该死“人不能以肉体之躯抵抗钢铁\"",
        "question_list": [],
        "answer_list": [],
        "final_answer": "一个逃犯上了一辆公交车和，我坐在窗边，他和我换了位置方便他观察情况，但是一辆装满了钢筋的大货车和公交车迎面相撞，他坐在窗边被插穿了脑袋死了，这时候我认出他是被通缉的在逃杀人犯。他罪有应得，人不能以肉体之躯抵抗钢铁，罪犯逃不出天网恢恢。一个天道好轮回的故事。"
    },
    {
        "puzzle": "有一个男人，在深山老林里迷路了，借住在一户人家家里，第二天起床他尖叫了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这户人家有一个先天残疾，没有腿的小孩。夫妻为了不让孩子自卑搬到了深山老林，然后把自己的腿剁了，给孩子营造人就是没有腿的假象。男人借住后，夫妻为了不让孩子发现事实，下药迷晕男子后将他的双腿砍了。"
    },
    {
        "puzzle": "女孩上车后一-路疾驰，突然她伸手捂住口鼻摸了下口袋，后来女孩死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "盲人女孩下班打车回家，每天定时堵车的路段却一路畅通，女孩心中有点担心。这时她又闻到车里的血腥味，女孩认定司机是坏人，她想报警，摸了口袋发现忘带手机，于是慌忙跳车逃跑。摔死了。其实血腥味是司机买的猪血，一路畅通是1因为司机看女孩是盲人想绕远路多赚一点。"
    },
    {
        "puzzle": "他胆子很小，却偏偏爱看恐怖片，明明家境很富裕，却把自己活生生地饿死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他患上了少见的心理疾病一活死人病候群。虽然身体健康，他却觉得自己已经死了。虽然胆小，但在他看来，恐怖片里的僵戶死人等，都是他的同类，不但不怕反而觉得亲切。死人是不用吃东西的，所以他把自己活活饿死了。"
    },
    {
        "puzzle": "有个看不清脸的恶魔，想法设法地折磨我，于是求助心理医生，在看到医生的瞬间，我疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一只被妈妈控制，明明没病却要装病，进行各种治疗的傀儡女孩。我看到的医生竟是长大后的自己，这时我终于知道，原来那不是噩梦，是我一直活在自己编织的美梦中，直到噩梦把我拉回了现实。"
    },
    {
        "puzzle": "这可不是灵异照片，上面没有任何灵气。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "今天是我的生日，我和朋友们约好在一个别墅轰趴，有个朋友本来答应参加却失约了。临走前，我们大家准备合影—张，洗出来的照片大家都很满意。可是当晚我认真看的时候，却发现照片后面的柜子里隐约有个人探出头，脸很白，头发垂到地上。难道是发生了什么灵异事件麻?我冒出一身冷汗，去找巫师鉴定，可巫却说这张不是灵异照片，我更慌了。这时我接到了一个电话，是我朋友打来的，他说那个失约的朋友失踪了，原来照片上的并不是鬼，而是那个失踪了的朋友，他被人杀了藏在柜子里。"
    },
    {
        "puzzle": "\"这些钱狗把你买下来吗?”她问。我发誓再也不会与她相见。十年后的她不再是处女，而我也满身伤痕。我们再也不会相见了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“我”是个玩偶，她小时候从橱窗中看到了我井想把“我”买下来但是家里并不是很有钱“我”看到她渴望的眼神于心不忍暗自发誓不要再见到她了企图让她忘记自己，10年后女孩成了家有了自己的孩子，而“我59此时早已成了-个坏掉并过时的旧玩具被扔在了垃圾桶里所以我们不可能再见了“我”曾经发的誓也成真了。"
    },
    {
        "puzzle": "小红帽带着糕点出发，危险如影随形。枪声及时响起，却终究晩了一步。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小红帽的妈吗做了一些糕点让小红帽带去给外婆。出发前，一直嘱咐小红帽不要小红帽的妈吗做了一些糕点让小红帽带去给外婆。出发前，一直嘱咐小红帽不要可是她们没有发现，谈话的过程都被门］外的狼听到了。小红帽到了外婆家，发现外婆穿着往常的衣服缩在床上，但和平时有些不一样。那是朗伪装的外婆，他刚要吃掉小红帽时，门开了，伴随着一声枪响，狼倒在了血泊中。“你和你的外婆安全了。”狼红着眼睛，看着小红帽在床底找的他藏起来的外婆，看着她把带来的糕点喂到外婆的嘴里，他挣扎着想阻止，可是他快要死了。他流着泪，“还是来不及了，对不起，我救不了你。”狼在幼年时曾被外婆从猎人的手里救了出来;他一直在等机会损答外婆。他发现了小红帽他们的计划，想赶去救下外婆，可是，还是差了一步。"
    },
    {
        "puzzle": "-现昙华，大雨落下。粉面罗刹，声唱俱佳。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "她是一名风头正盛的新人歌剧演员，因为漂亮的外形和优秀的业务能力遭到他人嫉妒。竞争对手找到她的狂热粉丝恶意挑唆：'她年纪轻轻就受百万人追捧，身边接触的优秀绅士不知凡几，何时会看上你呢?”于是某个雨夜，这个狂热的粉丝在跟踪她回家的路。上，将硫酸泼在了她的脸上。她容貌俱毁，再也不能表演了。那天晩一上她脸上的水痕，究竟是雨还是泪呢。她隐退不久，那名竞争对手也神秘消失了。"
    },
    {
        "puzzle": "有声的色彩都是有罪的。罪恶的东西，就应该在黑暗中，静静地呆着。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我原本有一个很美好的生活，妻儿在旁，日子无忧无虑。可是有-天，一场突如其来的大伙改变了这一切。我的妻儿都死了，我也变得-无所有，甚至丧失了视觉和听觉。他们说，这场火是一场事故，可我觉得，这是有人蓄意为之的，并且那个人就在自己身边。于是，我决定展开一场报复。我用最隔音的墙打造了一个地下室，并且地下室的门从里面关上了就再也不能打开，我还做了点小陷阱，引导那个人走进地下室，我知道他一定回来的，我要让他跟我一样，永远静静地待在黑暗中。可是再次醒来，当我想去确认那个人是否已经落入我的陷阱时，我却发现，被关在地下室的人是我自己。我明白了，原来那个人是我，是我自己衍生出来的另-个我所不知道的人格，我们两个就像两个独立的个体，互不知道，却都在对方的生活里。那场火是他放的，他在生活中发现了我生活的痕迹，缺以为我是妻子的出轨对象，他看着妻儿欢乐美满的画面怒从中来，放火烧了整一个家。视觉和听觉的消失并不是大火造成的，而是另一个人格对妻儿玩乐的画面和声音感到愤怒，一气之下自我封闭导致的。"
    },
    {
        "puzzle": "-部摄像机清晰的记录下了某推理作家的死亡过程，小明看着这个影像开心的笑了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "推理作家是X市有名的推理大师，其出彩的写作能力使得其所写的推理类小说大卖热卖，所以也会被当地警察带到犯罪现场对案件进行推理以及做一些案件的直播破解教学。小明是一名有过5点的无业游民，小明之前所制造的密室杀人是天衣无缝的，警察们都破解不来，但是却被这名作家破解了，使得小明进了监狱，但是却因为杀人未遂被关了一段时间就被释放出来了。此时，作家参加一次案件推理的直播活动，要亲自示范此次案件的逃生技巧。小明对于此次活动做足了准备，他拿了一个假身份应聘成为道具组工作人员，并且对道具做了手脚。作家在摄像机的直播录制下示范逃生过程却发生“意外”导致身亡。观众只会觉得是一场直播意外，没有人知道这是一场计划已久的阴谋。小明看着这个直播影像开心的笑了。"
    },
    {
        "puzzle": "四四方方的小盒子，昏暗潮湿。密密麻麻的小飞娥，扌卜棱闪烁。他们密集攀爬涌动，邀我共舞，我欣然接受了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我患上了抑郁症，从此家里的窗户上就装上了厚厚的窗帘。明明活得犹如一只幽灵见不得阳光，却还是疯狂的想要寻觅那份温暖，“就像那扑火的飞蛾，唯美又可怜。”我望向房屋上方不停围着白炽灯打转的飞蛾：怔怔的想到。家里的飞蛾越来越多，以至于竟然有一只飞蛾不小心冲进了我的鼻腔。半夜做梦，我梦到很多很多的飞蛾从四面八方的向我飞来，然后敛住翅膀从脚掌慢慢爬上身躯，密密麻麻的移动，痒痒的。渐渐的，我好像也变成了一只飞蛾，透明脆弱的翅膀慢慢的从肩胛骨处生长，缓缓煽动、托起了我的身躯。我飞了起来，连同那些飞蛾一起跳舞，我从未如此快活，可惜，这只是易碎的梦，醒来之后的身躯依然疲惫而沉重。不如最后体验一次把，连同久违的温暖”我掀开窗帘，打开窗户跳下了楼，终于变成飞蛾飘飘的舞起生命之歌。"
    },
    {
        "puzzle": "一个男人在很高的建筑物下面看报纸，看到-条消息后突然跑到楼顶打开灯，然后跳楼自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他看到的新闻消息是近期由于灯塔的灯没开导致轮船失事。而他就是灯塔的管理人，于是他很内疚，去顶楼开灯，然后以死弥补之前犯下的错。"
    },
    {
        "puzzle": "父母对女孩说她绝对不能打开地下室的们，否则会有可怕的事情发生。-天女孩趁父母不在便把门打开了，她直接惊呆了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "父母担心孩子受外界欺负，将女孩养在地下室，不许孩子出门。直到有一天女孩打开了地下室的门，看到了外面鸟语花香，才知道父母为了保护自己骗了自己。"
    },
    {
        "puzzle": "一对姐妹在帮母亲办完丧礼后，姐姐就杀了妹妹。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "姐姐在丧礼上看到了一个感兴趣的男生，但是丧礼结束后，姐姐一直找不到男生。为了再次见到他，姐姐杀了妹妹举办了第次丧礼。"
    },
    {
        "puzzle": "-一个许久未见的老友突然给我发信息，内容如下“XXX,在吗?”我看到感觉不对劲，并回了一句：“你是谁?”他回复：“我是XXX。”你不记得我了吗？我立马损报警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "几年前，我从别人那里听到了他因为意外事故做了脑部手术，导致了对标点符号没有认知。从此，他写任何文章都不会带任何的标点符号。当他发了这段信息过来之后，我便察觉到不对劲。为了确认事实我就回复他。当他发了第二句过来，我便确认并报了警。"
    },
    {
        "puzzle": "我是一个拥有阴阳眼的人，能看到身边的鬼魂。有天，我的阴阳眼突然没了。直到重新遇上他，我才明白发生的事情。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "“他”是一个知道我拥有阴阳眼的人。有天，他杀了我并夺去了我的眼睛。而我则变成了鬼魂留在世间。可我并不记得那段时间发生的事情，我就一直以为我还活着。因为和以前一样，我能看到身边的鬼魂。知道有天我重新遇到了他，看到了他的眼睛。突然全部都记了起来。"
    },
    {
        "puzzle": "高三那年，我做了一件错事没被发现而很开心。多年以后，我却为这落下了眼泪。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "高三那年，我家经济条件不好，钱不够交学费。我只能把假钱放进去交学费，老师好像并没有发现。能够继续读书，这让我感到了小确幸和开心。毕业后从其他同学那里听闻当年是老师发现了，但为了能让我完成学业，不被学校开除。就用自己的工资替换了假钱帮我交了学费。多年后的同学聚会，我重新见到了老师。I我鼓起勇气向老师说出了这件事情，并因为这件事向他道歉。可老师却说：“这么多年过去了，你都能为这事向我道歉。那能让你继续学业是我教师生涯做过最正确的事情。"
    },
    {
        "puzzle": "有一天，小女孩对妈妈说，那个伯伯是谁啊。个礼拜后，小女孩死了，妈妈和伯伯都很伤心。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "I小女孩其实不是小女孩。其实是一个奶奶，她得了老年痴呆症，把女孩认成了妈妈，丈夫认成了伯伯。最后那个奶奶自然死了。“妈妈”和“伯伯”都很伤心。"
    },
    {
        "puzzle": "A和B—起出门过了不久就被抓走了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "AB是监狱的囚犯，某天AB逃狱了，但是不久后却被警察抓了回去。"
    },
    {
        "puzzle": "小明的妈吗经常煮好精美的早餐和午餐给小明带去学校吃。有一天，妈吗打了小明一巴掌，大声说到你不是我的儿子并报了警。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "有另一个人物叫小华。小华是小明的同桌，小明经常带好吃的早午餐带回学校吃惹得小华很羡慕。小明也经常向小华炫耀。令小华也想有那么好吃的早午餐。于是某天晚一上自习放学后，把小明给杀了。将脸皮粘在自己脸上，小明妈妈看到了带上小明脸皮的小华。就打了小华一巴掌，并报了警。"
    },
    {
        "puzzle": "A和B坐在沙发上，用手互相勾搭着对方。站在旁的C也露出了可爱的笑容。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "AB是C的爸爸妈妈，c小时候就很会缝纫。爸爸妈妈经常称赞她。她感到很幸福。过了不久，AB-位内被炒觥鱼，然后没有了生活来源。就把脾气发泄到C身±=C终于受不了，于是趁着AB不注意把他们给杀了。然后缝成了以前对她的样子。"
    },
    {
        "puzzle": "一名男子被杀死在房间里，四周没有任何血迹，和疑似凶器的东西。只有一个吊着的电话简在他身边。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子有心脏病，有一天，他太晚睡了。导致了心脏病突发。想打电话求救但是却来不及晕倒在地而死亡。"
    },
    {
        "puzzle": "多年未归的回家祭拜死去不久的父亲。第二日儿子的遗体被发现在灵堂。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "戒毒中的儿子祭拜父亲时看见父亲的骨灰盒，当夜瘾病发作的儿子溜进灵堂，神志不清下吸入大量骨灰，窒息而死。"
    },
    {
        "puzzle": "I她是这样存在着，如此美丽，如此..不朽。如果没有看到她脸上的表情我想我也会这么说吧。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "恐怖马戏团的帐蓬中，我参观到了一个被砍掉四肢的女性真人蜡像。"
    },
    {
        "puzzle": "他每周都会给我看这张照片，我是不会说出去的。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在监狱里。但是我不曾犯罪，犯罪的是我的丈夫。他曾经以女儿相要挟，逼迫我顶罪，并且不能告诉任何人，就算对狱友也不可以说任何个字。如今他每周都会带着女儿的照片，看似探视，实则威胁我。他让我看着她的照片，警告我如果我敢说出一个字，女儿就完蛋了。"
    },
    {
        "puzzle": "我去了很多地方。我给他出了一道选择题，不管他选哪个，答案都是正确。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我绑架并杀害了一个女孩，并引她父亲回到自己的房子，然后给了她父亲一道选择题，“你猜猜在哪个房间能见到你的孩子”。“他”可能以为回答正确了就能见到活的女儿吧。但“他”的任何回答都是正确的，因为“我”把他的女儿分尸并摆放在他每个房间，他在哪一个房间都可以见到她。"
    },
    {
        "puzzle": "一一个房客搬进了新家，发现墙.上有个很小的裂缝每次他往缝里看",
        "question_list": [],
        "answer_list": [],
        "final_answer": "隔壁住了一个红眼病人，而且老是往这边看（房东告诉他隔壁住了红眼病人）"
    },
    {
        "puzzle": "深夜，一个男子的家里厕所坏了，所以去外面上公厕。第二天警察来找他，说厕所昨晚发生了杀人案，刚好和他上厕所的时间一致。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "凶手在刚刚杀完人的时候听到了厕所外面的动机，原来是有人出来上厕所，凶手为了不让事情败露，所以把自己打扮成了清洁工的样子，然后把死者当成了拖把，假装在拖地，当时厕所灯光十分的昏暗，所以去上厕所的主人公井没有发现什么异常，只看到一个清洁工在拖地而已，其实是凶手把死者倒立，用死者的头发在拖地。"
    },
    {
        "puzzle": "小明是个网购达人，非常喜欢逛购物网站，购物网站也总是能推荐到他喜欢的、想买的东西。最近网站经常给他推荐速冻水饺。后来小明死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明是个购物达人，天天不干活不赚钱，沉迷逛购物网站。小红好生气，恨不得剁碎了他。小红日日夜夜想这件事，晩上睡觉的时候说梦话:用菜刀把他剁成馅儿。手机听到了，就给小明推荐速冻饺子。小明不明白推荐水饺是为什么，也没察觉老婆的杀意。后来某一天，小红真的动手了，他就死了。"
    },
    {
        "puzzle": "丈夫回家时，保姆一脸呆滞地看着地上已经断气面目全非的六个月女童，妻子情绪失控大声尖叫不久警察带走了保姆。二十年后保姆出狱杀死了这家人。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "保姆是男的，爱上了女主人，酒后与她发生了X关系致使女主人怀孕，由于男主人有X障碍，保姆觉得孩子很可能是他和女主人的一夜情的结晶，但随着孩子长大出现了男主人的一些外貌特征，保姆怀疑孩子不是他的，嫉妒愤怒地摔死了孩子"
    },
    {
        "puzzle": "在一一个炎炎夏日，逻狗中的我坐在公园的长椅上休息。刚坐下不久，我便立刻起身走了。没过多又，我看到地上有个黑色的钱包。我冷汗立刻出来了，心知难逃一死。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我在狗时目睹了一场凶案，我想和我的狗配合伪装我是个瞎子，但是我下意识的低头看了地上的钱包，凶手其实一直跟着我，发现了我看了钱包，明白我不是瞎子，所以我必死。"
    },
    {
        "puzzle": "我的哥哥总是睡不好，于是我想了个法子让他终于睡好了，结果他醒来，却吓疯了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和哥哥都很穷，哥哥在城市打拼。我和哥哥睡在一间小出租屋内，买不起一^窗帘，哥哥本来就很累了，却每夜每夜被窗外的灯晃得睡不着觉。于是那天，我找了看起来个皮糙肉厚的人，把他杀了，割下了他的完整的皮，封在了窗户上。屋内终于没有了外面耀眼的灯光，哥哥睡得很熟很好。第二天早上起来，我问哥哥说：“哥哥睡得好吗?”哥哥回答睡得很好，但当他看见那张我精心制作的“窗帘”，却吓疯了。"
    },
    {
        "puzzle": "八岁的女儿不见了，在游乐园的监控中我们看到个成年男人带走了她，我的男朋友却在回家途中杀死了我。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男朋友是个恋童癖，他因为我的女儿接近我，我却爱上了他。为了让男朋友爱上我，我把女儿卖给了另一-个恋童癖。男朋友从监控中看到那人从他的行为举止中发现了男人也是恋童癖，也明白了我的所做作为，于是，杀了我。"
    },
    {
        "puzzle": "小明为什么-天洗七次头。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的母亲被入室劫匪在彼此搏斗中杀死，当时小明并不在家，当他回家时发现自己母亲死亡，头颅被砍掉找不到了（因为是亲人，所以看到身体小明还是能确认是自己母亲），他报了警，警察来整理现场也一直没有找到母亲的头颅，几年后，小明在浴室洗头的时候无意间一滴属于人体组织液混合血液的液体低落在他头上他好奇向上看，看见排风扇里自己母亲干枯的头颅，小明被吓疯了，从此每天洗七次头甚至更多次"
    },
    {
        "puzzle": "小明到柜台办理手续，小美在旁等待。小美突然离开小明身边，走到走廊另一头。之后小明在走廊的另一头看到小美时候疯了一样的转头就跑。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明和小美在酒吧相遇，聊的甚欢。于是决定去酒店开房。小美突然想要去厕所，于是离开了小明去走廊另一头的厕所上厕所。当小明办理好住房手续去找小美，发现小美从男厕出来。于是转头发了疯的跑掉了。"
    },
    {
        "puzzle": "房里有两个人，床位相邻，-一个靠着窗边，一个不靠窗。-天晩上，窗边的死了，另一个隔天也死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这是在医院的病房里。他们都是无法自主下床的病人，只能靠着仪器生存。两个人因此也结成了朋友。其中一个人A靠近窗户，另-个B没有。B由于心灰意冷，直有自杀的念头。A为了B有生存下去的意愿，每天跟他说窗外的景色如何美丽。I而B不能看到景色而心生妒忌。有次A出现状况无法呼叫护士。B本可以呼叫，但为了窗边的床位而选择不呼叫，导致了A死亡。等到B躺在了A的床位看着窗外的景色，才明白了A的用意。于是悔恨的自杀了。"
    },
    {
        "puzzle": "山姆是一位心善的富翁，有天他在拍卖会上高价拍下一个他并不喜欢的东西。半年以后，他渐渐发现参加拍卖会的人除了自己全部都死了。他也为自己的行为感到骄傲。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "他有天被邀请参加一个以慈善为名的拍卖会。但是背后确是一一个犯罪集团组织的“女性奴隶”的拍卖会。而这些奴隶都是犯罪集团的女杀手，他们的目的是进入富豪家，然后将他们抢劫一空并杀害。山姆为了这些奴隶不被其他人所“摧残”只能高价拍下一个奴隶回家。回到家后，山姆对待她像对待女儿一样。女杀手被感动To她就偷偷的离开了山姆家。而其他富翁并没有山姆那样，最终被杀害且财产被抢劫一空。"
    },
    {
        "puzzle": "妈妈带我去玩保龄球，我很开心，但我只玩了一次，之后妈妈就再没带我去玩过。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是一个盲眼小孩，从我小时候起，爸爸就经常打骂妈妈。本来爸爸答应了要带我去玩保龄球的，但这个承诺一直拖欠了很久也没有实现。终于有-天，妈妈受不了爸爸，在争吵之中把爸爸杀了并分尸。妈妈带着我跑到很偏僻的地方，拿着爸爸的头问我：“宝宝要跟妈妈一起玩保龄球吗?我很开心，于是把递过来的爸爸的头当成了保龄球扔了出去，我“打球”的时候，妈妈偷偷把爸爸的尸块扔到了山里的各个地方。第二天.妈妈被警察找上门来抓了，她再也没有带我去玩保龄球了。"
    },
    {
        "puzzle": "人贩子拐卖儿童，谎称自己是孩子的父亲，孩子为了自救拿了便利店的东西，店员发现端倪于是报了警",
        "question_list": [],
        "answer_list": [],
        "final_answer": "人贩子拐卖儿童，谎称自己是孩子的父亲，孩子为了自救拿了便利店的东西，店员发现端倪于是报了警。"
    },
    {
        "puzzle": "小明出轨后，妻子死而复生。他们都实现了自己的愿望。“你们真恩爱呀。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明出轨了，为了让小三名正言顺的出现在他身边，他一边假装疼爱妻子，-边暗中和小三密谋将妻子用毒药杀害并且破坏尸体的脸部，最后让小三整容成妻子的样子出现在小明身边，由此摆脱嫌疑。但是这一切被妻子知道了，于是她将计就计将毒药调换把小三反杀并破坏脸部，欺骗丈夫自己是整容胡的小三。在邻居看来，这对夫妻从前就很恩爱，最近好像变得更恩爱了。小明以为妻子在他和小三的密谋下死了，妻子则是成功杀死并冒充小三活了下来，丈夫还发自真心的疼爱自己，从各自的角度看，两人的愿望都实现了。"
    },
    {
        "puzzle": "我精心打扮好，准备去见男朋友的家长，一进门我却慌了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的室友前阵子和一个年级有些大，但体贴多金的男人谈了恋爱，她以为自己找到了真爱，却没有想到这个男人不仅有家室，还同时脚踏三只船，所谓的“体贴”不过是老男人对年轻女孩的降维打击。后来我去渣男的单位接了他一顿帮舍友出气，并让他以后别再来骚扰我舍友，不然见-次打一次，那个男人自觉理亏，也没再追究。今天我去男朋友家见父母，-进门就看见了那个当初被我胖接的渣打渣男一顿然后告诉他真相呢。"
    },
    {
        "puzzle": "瓷器一个接一个地碎掉，我发现了弟弟的秘密。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "弟弟特别喜欢我，瓷器上面的样式很像我讨厌的人，有次我很好奇的拿瓷器看上面的样式，无意中打碎了那个瓷器，然后我就得知了那个人被杀的消息，我明白"
    },
    {
        "puzzle": "飞机飞到半空中，最后落到她怀里。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "以加兰句鱼他出生在-个小县城里，那里教育资源落后，他却一直有个当飞行员的梦想。终于，他考上航空学校，即将要去大城市，坐上他梦寐以求的飞机了，可是，他的奶奶舍不得他走，怎么挽留都阻止不了他。临走前的那一天，他的奶奶把他叫到跟前，对他说，再让奶奶摸一摸你吧。结果奶奶拉过他的手一口咬下去，活生生的把他一根手指头咬掉了。就这样，他便只能永远地留在那个小县城，永远地留在奶奶身边了，飞机指孙子当飞行员的梦想，“落在她怀里”就是梦想被奶奶毁了"
    },
    {
        "puzzle": "“抱歉了，我尽力了”“别看了，忘了他吧。”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的爱人出了车祸，在医院靠着呼吸器和点滴维持着生命。从某一天起他慢慢变"
    },
    {
        "puzzle": "我和朋友-起去吃饭，可还没吃完，却发现朋友不见了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我是蚊子，和朋友一起去咬人，然后我还在吸血，但是朋友已经被打死得衰弱起来，医生对我说他可能时日无多了，不出几天，他死了。“对不起，他的病情突然恶化，我尽力了。”医生向我道歉。我接受不了，明明之前还好好的，为什么会这样?盖着白布的爱人被推出手术室，我想去看他最后--眼，可被医生阻止了：“看到遗体会很难受的，放心，他走的很安详，就这样忘了吧，让回忆1跟他一起焚烧忘却。他真是个体贴善良的医生，尽管有被安慰到，我还是想偷偷看他一眼在他被推进焚烧炉之前，我忍不住掀开了白布，却发现，爱人的胸膛有被打开的痕迹，伤口被草草缝合，里面的器官都不见了。原来医生属于器官贩卖组织的一员，经常利用职务之便谋杀住院的病人，来获取他们的器官，我出了车祸昏迷不醒的爱人也成为了他们的目标。"
    },
    {
        "puzzle": "“祝你们幸福。”眼前的两人看着我，眼里落下泪来。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我最近发现女儿和一个网友早恋了，这周末那个男生翘了补习班跑来我们的城市找她玩，被我再楼下抓个正着。他俩知道我一直反对这段恋:情被抓到时表现的非常抗拒，两人都说不能离开对方，如果强行要他们分开，他们就一起自杀。我笑笑，拿出502胶把他俩的手粘在了一起，既然这么不愿意分开，那就只能满足他们的愿望了。"
    },
    {
        "puzzle": "一位女士去鞋店里买了一双红色高跟鞋，这双高跟鞋预示了她今晚的死亡。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女士是杂技团的一名演员，那天她去买了一双红色的高跟鞋。晚上她穿着这双高跟鞋就去马戏团上班了，她的工作是头顶苹果，配合另外一名男演员表演小李飞刀。结果因为她的高跟鞋，她比平时高出了几公分，没有调整过来的男演员失手将刀插到了她的脑袋上。"
    },
    {
        "puzzle": "我有两个哥哥，我们三兄弟自小就睡在张床上。后来有一天二哥因为生病死了，不久后我把大哥也杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的两个哥哥是双胞胎。从小我们关系就特别好，同睡一张床。大哥睡我左边，二哥睡我右边，十几年了，我已经习惯了这样。可是有一天二哥却因为得了大病死了。我床的右边就这样空了。我很不习惯，突然我想到了！把大哥砍成两半不就好了吗，天晚上我又睡得好香〜"
    },
    {
        "puzzle": "在儿子去世一周年的祭日上，我杀死了三个来悼念他的人。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "儿子生病去世，他在临终前告诉我，把他的器官捐献给有需要的人，这样他就能以另一种方式继续活在世界上。我同意了。最后儿子身上有三个器官分别捐献给了三个不同的人。在儿子的祭日上，我认出了他们，接受皮肤捐赠的男人，居然满身都是纹身；接受肺部捐赠的小伙，不停地在那哪吸烟；而接受肝捐赠的居然打电话约朋友晚上出去喝酒。我儿子把生的机会留给他们，但他们竟然这样继续糟践自己。我深深为儿子感到不甘，愤怒不已的我杀了他们三个。"
    },
    {
        "puzzle": "我杀了人，当警察带走我的时候，我看到了门口的黑猫，它一直在盯着我，这一刻我知道我错了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我经常能在楼下看到那只黑猫，但由于工作出差的原因，所以我只能投喂它。那天出差回来，我发现阳台上有很多死老鼠，我下意识想到经常闹矛盾的邻居，随后便冲进了他家。伴随着惊呼声和警笛声，我看到了那只黑猫，它也在看着我，嘴里还叼着一只老鼠。"
    },
    {
        "puzzle": "我发现床头柜上放着一杯蜂蜜水和一块巧克力蛋糕，原本放在床头柜的娃娃却消失不见了。我知道男友再也回不来了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的男朋友有暴力倾向，经常对我拳打脚踢，我想离开，却又无能为力。那天沉默寡言的邻居送了我一个娃娃。我知道她对娃娃动了手脚，但我也确认他爱上了我。因此我天天对着娃娃哭诉男友的暴行，连一杯蜂蜜水，-块巧克力蛋糕都是奢求。那天男友动手之后摔门而去。我不知道抱着娃娃哭诉了多久，睡了过去。恍惚中一*阳生的身影伴随着滴嗒声来到我的身边。但我睡得更安心了。（滴嗒声是血滴在地上的声音，邻居砍下了男友的手用来解开我家的指纹锁，他给我带来了一杯蜂蜜水和一块巧克力蛋糕。"
    },
    {
        "puzzle": "我的父母都不理我，但我还是很爱他们。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小时候我是个很听话的孩子，爸爸妈妈经常给我好吃的水果。我吃不完，他们就告诉我喜欢的东西一定要放进冰箱，这样可以保鲜，记得那时候他们工作可辛苦了，经常加班到深夜，没睡过一个好觉。于是我耍了个小聪明，在他们的水里下了安眠药。他们睡得可香了，然后我把他们放进冰箱里，从那以后我每天都会对他们说：爸爸妈妈我爱你们。现在我都六十了，他们还是那么年轻。"
    },
    {
        "puzzle": "一场意外后，妻子便开始把自己关在房间里，不肯出来。那天我突然听到她在嚎啕大哭，我急忙冲进房问里，却被眼前的一幕吓傻了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我很爱我的妻子，有一天我发现妻子怀孕后，就开始精心淮备迎接孩子的到来。结果我发现妻子竟然出轨了。为了孩子，我暂时隐忍，但是孩子出生后我发现孩子还不是我的。惯怒之下我精心策划了一场车祸想让她们通通丧命。谁知妻子竟然活了来。不过她疯了，她整日把自己关在二楼的婴儿房内，我也不管她，自己只是晚上回来睡个觉，不过经常在房子里闻到一些异味。这一天，我听到了婴儿房里传出嚎啕大哭的声音。我急忙冲进房间，一阵恶臭袭来，我发现妻子怀里抱着的洋娃娃爬满蛆虫，她竟然把死去的孩子缝进了洋娃娃里！她一边抓去娃娃上的蛆虫，一边哭喊着：宝宝别怕，宝宝别怕。"
    },
    {
        "puzzle": "那天我洗完澡后，说了一句话。家人们听见后都崩溃了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "奶奶生了重病，我和爸爸、叔叔他们回家看望奶奶。当晚奶奶早早地就说身体不舒服，要去睡觉了。我和长辈们在客厅看了一会儿电视后就去洗澡了，洗完澡后我出来跟家人们说，今天的水好奇怪，流出了好多的白毛。爸爸听见后向楼顶的水箱疯狂冲去，只见奶奶的尸体漂浮在水箱里，水里还散落着许多奶奶掉的白头发。"
    },
    {
        "puzzle": "这两天为了补寒假作业，把我搞得晕头转向，还好在开学那天补完了。今天一早，还没等妈妈起床，我便去学校报道，可到了学校，我却疯了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我今年高三，来自单亲家庭。到了最后半年的冲刺阶段，妈妈却突然生了大病。还好现在是寒假，我可以照顾她。明天就要开学了。把妈妈哄睡后，我继续补作业。不知不觉天亮了，为了让妈妈多睡会儿，我蹑手蹑脚地出了门。到了学校打开寒假作业之后，我在里面发现了一张纸。仔细一看竟然是妈妈写的遗书，遗书里妈妈说到，即使没有她我也能照顾好自己。但如果只剩我一个人，考上好大学又有什么用呢？"
    },
    {
        "puzzle": "小明睡在妈妈睡的大床旁边的小床上，每天夜里妈妈都会从被窝里伸出手拉住小明的手。有天有人发现小明全家都死了。小明的爸爸被砍成了肉泥，妈妈也死了，小明也死了。小明手里抱着一个血淋淋的胳膊，请问为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明抱的是歹徒的手（当成他妈妈的手了）死死抱住，歹徒为了逃走，砍了自己手。"
    },
    {
        "puzzle": "有三个兄弟，大哥和二哥是双胞胎，大哥因一次车祸死亡，剩下二哥和小弟。有一天小弟走进二哥的房间看见二哥照镜子，便把二哥杀了。请问为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这三兄弟十分相亲相爱，在大哥意外死亡后，剩下的二哥和小弟都很难过。这天小弟进入二哥房中，看见镜子前的二哥忽然灵光一闪，想到再次拥有两个哥哥的方法。于是小弟拿了锯子，将二哥从中剖成两半，如此以来就有两个哥哥了。"
    },
    {
        "puzzle": "有个死刑犯遇到了恶魔，而他向恶魔许了个愿望。恶魔也帮助了他。数日后走在路上的行人都捂着鼻子面露难色。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "恶魔将死刑犯变成隐形人，让他成功逃狱，但是他却在马路上被车撞死了，几天后尸体发臭，让来往的路人难以忍受。"
    },
    {
        "puzzle": "在黑暗当中点亮火柴的男人，因为恐惧与绝望，就这样死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人是监狱里面的囚犯。他为了越狱，花钱买通一个狱卒。他们约好下一次监狱里有人死掉，囚犯就偷偷躲进棺材里避过盘查，和尸体一起运出监狱，在墓地下葬。他请狱卒在棺木下葬之后，再偷偷把他挖出来。终于被他等到有人死了。他才不管了人是谁，便以迅雷不及掩耳的速度，躲进棺木里。棺木下葬之后，囚犯点亮了火柴。这时他发现身边的尸体，就是他买通的那个狱卒！当然，没有人会来把他挖出去了。"
    },
    {
        "puzzle": "乡间的小道上，五个人走在路上。天空突然下起了雨，四个人加快步伐。最终五个人同时到达了目的地。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这四个人抬着个棺材下葬，第五个人躺在棺材里。"
    },
    {
        "puzzle": "小明的弟弟养了一只仓鼠，有一天，小明弟弟的仓鼠死了，小明的弟弟很伤心，妈妈奖励他一块跟仓鼠大小的巧克力，过了不久，小明死了，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "因为小明弟弟的仓鼠死了，妈妈奖励他一块跟仓鼠大小的巧克力，小明的弟弟以为死什么东西就会得到什么大小的巧克力，手是他把小明给杀了，以为能得到小明一样大小的巧克力。"
    },
    {
        "puzzle": "一个女孩回到家，发现她的妈妈死了，爸爸很憔悴，旁边血泊中有几张撕碎的纸条，然后女孩发现撕碎的纸条，上面写着“女儿，快走，爸爸，疯了”。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女儿有精神问题，是她杀了妈妈，字条是妈妈写的但是撕碎了，所以字被打乱了顺序，真正的念法是“爸爸快走女儿疯了”"
    },
    {
        "puzzle": "某个村子每家每户过了0点必须关灯，与此同时半夜三更都会传来怪叫声，虽然把全村人都吵醒，但是都没有人出去看。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "村中有个人人皆知的变态杀人狂，行迹神秘且有夜盲症，所以全村人都必须要在晚上关灯。由于杀人狂在没有灯的地方找不到人，于是就用怪叫声来吸引村民夜晚开灯并将其杀了。"
    },
    {
        "puzzle": "有一对夫妻自驾游，半夜在山路上抛锚了，丈夫准备下车去远处能接收到信号的地方求救，因为来之前知道新闻上说附近有一位连环杀人案的在逃犯，并且夜晚漆黑看不清楚，所以丈夫在下车前和妻子约定敲车门三下就给开门。过了很久，妻子听到了很多次敲门声，但每次都不是三下。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "丈夫刚走不久就被守株待兔的变态杀人犯给杀了，杀人犯出于极致的恶趣味，拖着他的尸体回到了车旁边，把他吊在了车旁边的树上，当时风很大，尸体随风摇摆，所以双脚时常会碰撞到车门发出声音许多次。"
    },
    {
        "puzzle": "男孩十分崇拜他的父亲，有一天他将妈妈杀了并对爸爸说了一句话，爸爸听后便自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男孩的爸爸是个魔术师，经常表演用刀切开人体后又如没事般接回来的魔术，男孩信以为真。一天爸爸不在家他便尝试用妈妈来尝试这项魔术，男孩不会表演魔术当然就真的将妈妈的身体切成块了，等到爸爸回来男孩就叫爸爸把妈妈再变回来。爸爸看不了眼前的场景和儿子若无其事的样子，终于在绝望和崩溃中自杀了。"
    },
    {
        "puzzle": "在一个月黑风高的晚上，夫妻俩在一个陌生城市里飙着车。突然车子爆胎，而他们又没有备用胎，所以丈夫必须去找人帮忙。他担心留着妻子一个人在车上不安全，所以他下车前把门窗都关好，锁好，并叮嘱妻子不要开门。等他回来的时候，发现妻子倒在血泊中，而车上居然还有一个陌生人！这是怎么回事？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妻子本来是怀孕着，飙车是想快赶去医院生孩子，但妻子在难产中死了，那陌生人正是他们的孩子。"
    },
    {
        "puzzle": "小明经营着一家专门卖汉堡的快餐店，由手物价上涨，小明把每个汉堡的单价涨了20美分，结果不出一个星期，汉堡店的服务员纷纷辞职了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "原本汉堡的价格不是整数，那么顾客在吃完汉堡后剩下一点零钱可以给服务员作小费。而涨价后，汉堡的价格变成了整数，顾客大多没有零钱付小费，所以服务员纷纷辞职"
    },
    {
        "puzzle": "一天，游手好闲的小李在大街上游荡。正巧碰上一所小学放学，小李在拥挤的人流中不幸被无良小学生小明撞倒，小明不仅没有道歉而且还杉*衅小李，小李却没有因此生气反而很高兴，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明很生气的说了一句：“你是哪个班的？”年近30的小李没想到自己在小学生眼之里看上去这么年轻，心里舒坦了很多。"
    },
    {
        "puzzle": "一天，小明去医院看病，取药时排在了长龙一般队伍的最后。半个小时后小明的前面依然有很多人，这时，一个名叫小李的陌生人过来插队，强行排在了小明的面前。小明非常生气，不过没过多久小明心里又非常高兴，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明看到小李来插队非常生气，忽然他瞥见小李手上拿着的是中药方子，而这个是西药队伍的窗口，小明遂即幸灾乐祸。"
    },
    {
        "puzzle": "我走进电梯准备去上学，随着电梯的上升，我知道，我再也无法去学校了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "星期一早上，在妈妈的催促之下我心不在焉的走进电梯准备去学校，电梯门合上后，由于我刚起床头脑还不太清醒，忘了按一楼的楼层键，于是电梯便持续上升，我意识到自己没按楼层，正准备按下一楼楼层时，电梯突然停了，电梯门缓缓打开，我看到一个女孩倒在血泊中，而一个男人正在清理现场...男人听到动静，突然转过头来看向我，那双眼睛死死的盯着我的手，我吓了一跳，赶紧狂按电梯关门键，就在电梯即将关上的那一刹那，一双带着血的手伸了进来，我知道我再也无法去学校了。（电梯之所以上升是因为女孩被杀害前为了求救按了电梯按钮）"
    },
    {
        "puzzle": "一个婆婆给了我一个神奇的娃娃，她说只要我对这个娃娃许愿，娃娃就可以实现我的一切愿望，但我必须无时无刻将娃娃带在身边，并且要保护好娃娃，不让娃娃碰水，否则愿望就不灵验了，可是之后我却付出了惨痛的代价",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我暗恋的男神喜欢上了我的闺蜜，看着我的闺蜜和男神越走越近，我很生气，哼！我哪里比不过她，不过就是家里有钱吗！我和闺蜜在一次外出旅游中遭遇了劫难，闺蜜受了重伤，向我求救，而我却视而不见趁机逃生，因此她失去了生命。所有人都怀疑我，但是就是找不到证据把我抓起来，可闺蜜的家人为了探寻真相，竞然设计编造了一个神奇娃娃的谎言，他们在娃娃里面装了视听器，并跟他人合伙让我上钩，为了让我相信娃娃有魔力，他们用尽一切办法帮我实现愿望，我因此相信了娃娃的魔力。我每天和娃娃呆在一起，虔诚的许愿，无话不说，直到我亲口说出了真相，这一切都被安放在娃娃里的设备记录了下来，而我最终也得到了应有的惩罚。"
    },
    {
        "puzzle": "我的行李里面只有枕头和衣服，可警察把我带走了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的男朋友出轨了，被我发现后他提出了分手，可我自从和他分开后我每晚都睡不安稳，因为我已经习惯了枕着他的手臂睡觉，枕着他的手臂睡觉让我感觉很安稳舒月艮，于是我砍下了他的手臂，并将他的手臂和我的衣服一起装进了行李箱里，可没想到却被警察发现带走了。（汤面里说的枕头就是男友的手臂）"
    },
    {
        "puzzle": "一个雨天，男人拉着一个大行李箱出门。他在门口碰见了自己的妻子，和妻子兴奋地说了几句话后，他神色忽然古怪至极。他仔细看了看妻子的侧脸，看了看手表，又转头看了看门外的大雨。而后他慌慌张张拉着行李箱走了，从此销声匿迹。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女人有个长相一模一样的双胞胎姐姐。女人老公偷偷出轨双胞胎姐姐。双胞胎姐姐与女人老公偷情时，为了把自己和女人区别开来，会在侧脸画一颗显眼的痣。最近，女人的老公已经完全厌倦女人，一直在找机会杀了女人。一个雨天，女人照常出门工作。趁此机会，老公又邀请了姐姐来家里偷情。老公发现坐在沙发上的这个女人脸上没有痣，他十分慌乱，以为妻子突然回家。担心偷情败露，他打算今天就杀死妻子。于是他悄悄走过去杀死女人，解肢，把尸体装进行李箱，出门抛尸。出门后，他在门外遇见一个女人，起初他以为是姐姐——自己的情人，于是兴奋地说了几句话。说话后，他发现不对。仔细—看，这个女的脸上也没有痣。他看手表，发现是妻子往常下班回家的时间。今天一直在下大雨。他突然明白，刚才家里的那个女人就是姐姐。不过因为是雨天，她脸上的痣被雨水洗掉了。他杀错了人。震惊后怕之余，他逃走了。"
    },
    {
        "puzzle": "他们看起来很登对，他也很幸福，但是...绿让红变成了白...•掉落的首饰，威胁的证明，模糊的血肉成为了他的执念",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我的学长有个女朋友，两个人看起来很登对，学长也很幸福。直到后来，学长买了戒指，准备求婚。（红事）然而就在那一天，学长被一名男人打了，戒指掉落在地，才知道她是有夫之妇，丈夫很凶，会家暴她，学长根本不知道她有丈夫见过她的同事，父母，都很支持两人。他们都知道她辛苦，知道她丈夫混账，自己不帮忙，我学长出现了，就好像给她找到救命稻草了，全瞒着学长。因为那个女人怀孕了，她老公是长途车司机，时间对不上所以立刻知道被戴绿帽了（绿色）。那个男人后来拿这事勒索学长，还拿女人堕胎后的小肉团当证明，之后学长本想断了，他这样不停找上门到工作的地方，到家里，最后学长在某次躲藏过程中被撞死化成了鬼（白事）。｛看到'红''白''绿'，这不好猜？就是丈夫是长途司机可能猜不到，换成长期出差这种我觉得也ok｝"
    },
    {
        "puzzle": "小强养了一只忠诚的狗，有一天他牵着狗上街，结果小强死了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小强有心脏病，那天上街突然病发倒地，忠心的狗狗一直防止陌生人靠近小强，最后导致小强没人帮助而死。（真实事件改编）｛可以改编成妻子为了谋杀小强就把他随身带的药拿走了，不然难以解释为什么心脏病出门不带药，谋杀原因就为了保险吧｝"
    },
    {
        "puzzle": "汤面：宿舍门口有人敲门，问：“要买红衣服吗”我：买吧买吧第二天宿舍人都死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "每天半夜都会有人敲我们宿舍门问：要买红衣服吗？我们从来没有理会过，有一天我实在不耐烦了，就说买吧买吧，结果第二天。宿舍人的皮都被扒下来了，就好像穿着红衣服。。"
    },
    {
        "puzzle": "开头：小红新买了双高跟鞋。结尾：小红寄了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小红是马戏团的射苹果（气球）的表演者（被射的那个），由于穿了新的高跟鞋导致表演时的高度与平时练习时的不一样，导致搭档将其误伤致死。"
    },
    {
        "puzzle": "我在床上躺着看直播，刷到了一个漆黑的直播间，直播间里越来越亮，我看到了天花板，然后我死了。请推理我为什么死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这个其实是一个杀人直播，而这次要杀的人就是我（我并不知情只是恰好刷到这个直播），一开始在屋子外面所以暗的，后来进屋了，亮了。进来把我刀了"
    },
    {
        "puzzle": "两个宇航员a、b从太空回来，发现地球上只剩他们两个人，某天b死了，地球上人都回来了，a尝试跟他们对话后自杀了。请推断自杀的原因提示：只是在a的认知中地球人回来了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "汤底：因为唯一的伙伴b死掉了所以因为太孤独产生地球人回来了，但是发现这只是自己的幻想，最后绝望自杀"
    },
    {
        "puzzle": "小明的弟弟养了一只仓鼠，有一天，小明弟弟的仓鼠死了，小明的弟弟很伤心，妈妈奖励她一会儿跟仓鼠大小的巧克力，过了不久，小明死了，这是为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "弟弟想要更大的巧克力于是杀死小明"
    },
    {
        "puzzle": "乡间小路上，五名男子一同前行。突然开始下雨，五人中的四人加快了步伐，然而第五人一点也不着急。最终，五人同时到达目的地。加快脚步的四人被淋成了落汤鸡，而第五个人身上却一点也没湿。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "四个人在抬棺材。第五个人是躺在棺材里的死人。"
    },
    {
        "puzzle": "我和我的同学都是登山爱好者暑假我们打算一起去登山我俩租了一个小公寓可是那个地方的天气频频下雨这天，天气放晴了\"我回来了我回来了.....我回来了”",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我并不是登山爱好者我只是为了害死我的同学获得奖学金选那个地方为什么频频下雨也是为了让我的同学出意外那天虽然天气放晴了我的同学说要去登山我就拿前几天下雨我感冒了不能去糊弄了过去可是只有我知道我在他的登山设备做了手脚当晚他回来了一直念道着：我回来了实则没有说全，全话是我回来复仇了可是登山结束时间是明天下午啊同学的鬼魂就刀了我（主角死亡结局死法随意猜，不离谱就行"
    },
    {
        "puzzle": "疯子他疯了。抓住他了。天亮了0我真后悔呀。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我们是玩偶，我们生活的小镇是一座玩具模型。镇子中有人发现了真相，却被我们当做疯子抓捕，我抓到他的时候，模型的外壳忽然打开了，光线透过模型，周围变亮了，我抬头看见了模型主人的脸，我明白了一切，原来疯子才是最清醒的。"
    },
    {
        "puzzle": "在一间医学院里，ABC是舍友，A的成绩很好，是班里的班长。B的身体比较虚弱。有一天有人发现AB的尸体，C疯了，请推理出故事全貌。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "学校最近有一门解剖考试。A有梦游症，并且可以在梦游中学习知识，所以成绩优秀。因为是班长所以备有解剖室的钥匙，B因为担心考试挂科等大家都睡觉后偷了A的钥匙到解剖室独自练习，身体虚弱的B在练习完后索性睡在了解剖台上连门都没有关。当晚A梦游到了解剖室打算进行“解剖考试”。梦游中的A把B当作实验尸体把四肢绑在解剖台上一点一点的解剖。当A醒来后发现自己已经把B解剖得不堪入目，接受不了事实于是用刀自杀。室友C一早起床发现AB不在，非常担心于是就出去找，直到在开着门的解剖室发现了血肉模糊的B和自杀的A,吓疯了。"
    },
    {
        "puzzle": "张三去了趟厕所，结果发现自己出不去To线索：张三的四段内心独白...似乎又可以出去了？...真的可以出去吗？...不行！决不能出去！...我想，我应该是出不去了...",
        "question_list": [],
        "answer_list": [],
        "final_answer": "张三发现厕所外面有人在杀人，胆小的张三不敢制止所以出不去了。杀完人凶手好像离开了，所以又说能出去了。结果凶手杀完人其实是去拿了工具又回来分尸装进麻袋，所以又出不去了。这时尸体怨气不散成了鬼，杀了凶手又来杀了厕所里的张三，因为凶手杀人的时候张三没有制止。"
    },
    {
        "puzzle": "某个村子每家每户过了0点必须关灯，于此同时半夜三更都会传来怪叫声，虽然把全村人都吵醒都没有人出去看。真相是什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "村中有个人人皆知的变态杀人狂，行迹神秘且有夜盲症，所以全村人都必须要在晚上关灯。由于杀人狂在没有灯的地方找不到人，于是就用怪叫声来吸引村民夜晚开灯并将其杀死。"
    },
    {
        "puzzle": "晚饭时，玛丽的爸爸抱怨妈妈做的汤太甜了，当晚，妈妈就死了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "玛丽是个极端主义者，无法容忍家庭中有任何人对家庭不忠。玛丽最近发现父母的关系没有从前好了，并且还在厨房里发现了毒药，玛丽断定一定是爸爸妈妈之中有一人想毒害自己的伴侣。为了知道谁对这个家不忠，玛丽把毒药换成了糖，结果当晚喝到甜汤的是爸爸，于是玛丽便下毒药将妈妈毒死了。后来玛丽才知道，原来是爸爸想要杀了妈妈，而他已经知道毒药被玛丽发现，于是顺水推舟，让玛丽亲手害死妈妈。"
    },
    {
        "puzzle": "小蔡走进了一家餐厅，要了一杯冰水，服务员掏出了枪对准了他，他说了一声谢谢。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小蔡打嗝难忍，想点一杯冰水止嗝，于是服务员掏出了一把假枪吓他，他的打嗝成功被吓没了，知道真相的小蔡感激不尽。"
    },
    {
        "puzzle": "我和小伙伴约好一起去废弃的古堡参加万圣节变装派对，结果只剩下了我一个……请推理故事全貌",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我和小伙伴们约定好玩躲猫猫，我找了半天都没在古堡里发现什么好躲的地方。我只好打算躲在假棺材里吓他们一下，结果我等了好久好久，都没有人来，当我想推开棺材盖时，却发现棺材已经被锁上了，这时，我才发现不对劲，我被伙伴们送进了真棺材……"
    },
    {
        "puzzle": "有一位男子常驻在了一家饭店，某一天他再也不敢喝饭店里的水了，请问为什么？提示：蓝可儿",
        "question_list": [],
        "answer_list": [],
        "final_answer": "某一天，一位女子在这个饭店里失踪了，警察找了很久，都找不到。原来是男子杀了这位女子，并把她藏在饭点顶楼的水仓里。"
    },
    {
        "puzzle": "近来健身房的人越来越少，但老板的心情却越来越好，钱正前几天受伤找老板请假，发现了老板的秘密……请推理故事全貌",
        "question_list": [],
        "answer_list": [],
        "final_answer": "钱正在跑步机上跑步的时候摔倒了，发现跑步机的履带上居然冒着油，仔细一闻居然好像是人油，钱正没再多想来到老板的办公室请假，发现刚才还在的人现在却不见了，没想到在钱正翻看书架时意外打开了老板的密室，眼前的一幕，把钱正吓坏了••…"
    },
    {
        "puzzle": "男孩躺在床上，抓着妈妈的手，旁边有一具尸体。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男孩已经死了，抓着的是妈妈的断手，尸体是爸爸。妈妈长期遭受爸爸的家暴，男孩从小体弱多病，加上目睹这些暴力行径，留下了心理阴影，每天必须抓着妈妈的手才能入睡。有一天妈妈实在忍无可忍，在家中的茶壶里下了安眠药，准备趁爸爸熟睡杀了他。男孩和爸爸睡前都喝了茶壶的水。当晚，男孩依旧抓着妈妈的手入睡，由于体弱加上过量安眠药，男孩在睡梦中死去。妈妈半夜起来准备杀爸爸的时候发现男孩尸僵了，手挣脱不开，悲痛欲绝之下把自己被男孩握住的手砍了，回头就把睡在一旁的爸爸杀了。"
    },
    {
        "puzzle": "脾气不好的妈妈在我无处可逃时狠狠揍我强壮的爷爷把我送给花草仙子做礼物古怪的奶奶关上房门和爸爸妈妈一起做游戏严肃的男人扶着妈妈进了唱着歌的盒子后来我有了我的房间和我的妹妹妈妈总给妹妹买新裙子却不给我可她却经常冲妈妈大吼大叫我不怪她我知道妈妈很爱我",
        "question_list": [],
        "answer_list": [],
        "final_answer": "这是借用“我”的口吻来讲述一个故事。我的妈妈被拐卖到大山，卖给一个智力低下的男人做老婆，被迫怀了我，开始时她憎恨我，总是猛力捶肚子，想把我打掉（揍我），可随着怀孕月份的增加，她渐渐对我产生了感情，我成为她在这痛苦的环境中最大的慰藉。“怎么生了个赔钱货!”爷爷一把从虚弱的妈妈怀里抢过我，把我丢在了荒野自生自灭（礼物）刚生的女儿被抢走，妈妈每天默默流泪，奶奶锁好门，照例监督他的儿子和买来的媳妇传宗接代（做游戏）后来警车（唱歌的盒子）开来，民警救走妈妈，可妈妈已经怀孕，此时妈妈已有些神志不清，因为过度思念和愧疚，她为我置办了一个房间，假装自己每天陪伴着我。妈妈生下一个小男孩（妹妹）。看见他圆圆的小脸，甜甜的笑，妈妈就会回忆起那个被夺走扔掉的我。“如果我的女儿还在，—定很可爱吧。她把弟弟打扮成小公主，每天买新裙子给他，逢人就夸自己的“女儿”可爱。渐渐通晓人事的弟弟受尽了闲言碎语，变得敏感暴躁，用大吼大叫来表达他的反抗，然而，没有人愿意倾听他的心声。我是妈妈的第一个宝贝；我死在荒芜的山间，和花草仙子做伴;我知道妈妈爱我"
    },
    {
        "puzzle": "一个人过生日，邀请他所有的好朋友来参加。吹完蜡烛的时候，这个人把他所有的好朋友都杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男主和朋友曾经一起去探险，一段时间后没有了食物，因为男主本身是一个盲人，所以这帮朋友都骗他说每人砍下一只手来吃，可最后只砍了男主一个人的手。之后有一次男主邀请朋友们来参加自己的生日聚会，吹完蜡烛后所有人都鼓掌了，男主发现只有自己的手被砍下来吃了，男主无法忍受这样的欺骗于是杀了所有的好朋友。"
    },
    {
        "puzzle": "6岁时外婆告诉我不要吃黄苹果。13岁时，外婆告诉我不要吃青苹果。18岁时外婆告诉我不要吃红苹果。20岁时外婆去世了，我向外婆祈愿：以后所有的苹果都可以吃了",
        "question_list": [],
        "answer_list": [],
        "final_answer": "从小我门家很穷，全依靠外婆种苹果生活，有了弟弟后，父母更是对弟弟偏爱有加，甚至想到要把我卖了，外婆知道后便种下有毒的黄苹果，后来家里只剩下了我和外婆上中学的我，因为从小缺少父母的陪伴，性格比较软弱，经常受欺负，外婆看出了我的心思，于是便种下有毒的青苹果，售卖给了那些欺负我的同学，后来我度过了一段美好的中学时光...18岁那年，我放弃了外出上大学，留在了村子里和外婆一起种苹果，想着多给外婆一些陪伴，可村里人的闲言碎语让我倍感压力和迷茫，于是外婆种下了有毒的红苹果，两年后.•.外婆去了天堂，而整个村子都变沉默了，我站在院子里那颗苹果树下，告诉天上的外婆，以后我可以吃所有颜色的苹果了...（黄苹果毒了家人，青苹果毒了同学，红苹果是把村子里的人毒哑了，黄青红分别代表毒的人数，因为吃黄苹果的人最少，所以黄苹果毒的人最少）"
    },
    {
        "puzzle": "我从奶奶房间拿了个橘子给爸爸，爸爸却惊恐万分。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "我们家很穷，奶奶生前很疼我，知道我爱吃橘子，于是自己省吃俭用给我买橘子吃，时间久了便患上了精神类疾病，每天吃土充饥，身体也逐渐垮了，奶奶去世后，爸爸希望能继续领取养老补助，便隐瞒了奶奶去世的消息，奶奶就一个人冰冷的躺在她的房间里。时间过得很快，那天我看到奶奶房间的窗户被一根树枝捅破，几颗橘子挂在上面摇摇欲坠，我想这是奶奶送给我的橘子，我便高兴的跑到爸爸身边告诉了他，后来我才知道，原来是奶奶吃土时，把我埋的种子也一同吃了下去，土和奶奶变成了种子的养分，种子便开始慢慢的生根发芽开花结果...但我相信这棵橘子树就是奶奶，她是用她的爱换了一种方式永远陪伴着我..."
    },
    {
        "puzzle": "妹妹将要结婚了，姐姐很伤心。妹妹结婚了，姐姐很开心",
        "question_list": [],
        "answer_list": [],
        "final_answer": "姐姐和妹妹是孤儿，从小在一起长大，姐姐是同性恋，从小就喜欢妹妹，但妹妹并不知道。妹妹有个倾心已久的男生，某天妹妹和那个男生终于互通心意，决定结婚了，姐姐知道这个消息很伤心。因为家里很穷买不起嫁衣，所以嫁衣只能由姐姐亲手制作，在妹妹结婚前一晚，姐姐终于把嫁衣做好了，姐姐看着她亲手做的大红色的鲜艳美丽的嫁衣，突然萌生了一个想法…她把嫁衣穿在了自己身上，然后拿着针线去了妹妹的房间，妹妹正在睡觉，姐姐便拿着针线穿进妹妹的肉里，在妹妹的身体上又缝制出了一件新的嫁衣，看着妹妹的鲜血与嫁衣的红色完美的融合在一起，姐姐开心的笑了，随后她抱着妹妹一起躺在床上自杀了，与妹妹进行了冥婚，这样妹妹就会永远和她在一起了…"
    },
    {
        "puzzle": "你独自住在郊外，附近只有一户邻居，是一对养牛的夫妻。你们两家之间隔着一片草坪。有一天深夜，你被一阵喧闹声惊醒，之后听见了牛叫，牛撞开栅栏和牛吃草的声音。过了一段时间，你又听到有东西在撞自己家的门，但你没有理会，继续睡了过去。第二天，警察敲响了你家的门。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "邻居夫妻关系很差，那天邻居夫妻吵架（喧闹声），丈夫一怒之下把妻子的舌头割了下来，并砍下了妻子的四肢，妻子发出嚎叫（牛叫声）。冷静下来后的丈夫自杀，妻子用身体撞开家门（牛撞开栅栏），用牙齿咬着草一点点挪到邻居家......（牛吃草），爬到你家门口撞门求救，因未被理会失血过多而死，清晨有人发现尸体报了警。"
    },
    {
        "puzzle": "男子清晨起来刷牙，发现自己牙齿是绿色的，他吓疯了过去。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子是一个守太平间的看守人，最近太平间有尸体丢失找不到去处，警察在尸体上涂抹了绿色的荧光粉，然而尸体再次消失警察依然一无所获，男子早上起来刷牙发现自己是绿牙，就意味着..（男子有异食癖和梦游症，他半夜梦游起来吃尸体）"
    },
    {
        "puzzle": "男子精神正常，但却在船上挥起刀，将许多人的手一一砍断。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "发生了船难，男子在救生艇上。救生艇已经达到承载人数的上限。许多溺水者仍然不断游过来，想要抓住救生艇。为了避免救生艇翻覆，男子只好将溺水者伸出来的手一一砍断。日本的大和战舰沉没时发生过这样的事情，《史记》当中也记载春秋时代的晋楚相争也有发生过。"
    },
    {
        "puzzle": "女明星养了一个女儿，从小她都会时不时给她的女儿戴一顶帽子，有一天她带她女儿去医院，女儿在医院知道真相后就自杀了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "女明星毁过容，养女儿是为了得到移植脸皮到她自己的脸上，那顶帽子是她自己的，时不时给女儿戴上是为了测量女儿头部大小，一旦刚好合适，就可以带去医院做脸部移植手术。"
    },
    {
        "puzzle": "小明是个非常崇拜父亲的小孩，有一天小明将妈妈杀了，并对爸爸说了一句话，爸爸就自杀了。为什么？",
        "question_list": [],
        "answer_list": [],
        "final_answer": "小明的爸爸是一个魔术师，经常表演用刀切开人再接回去的魔术。小明以为魔术是真的。有一天趁爸爸不在，拿妈妈尝试着项魔术。然而不会魔术的小明真的把妈妈切开了，但小明若无其事想等爸爸回来复原妈妈。爸爸看到眼前的情景便在绝望和愧疚中自杀。"
    },
    {
        "puzzle": "在一个月黑风高的夜晚，夫妻俩在一个陌生的城市飙车，突然车子爆胎，而他们没有备用胎，所以丈夫去找人帮忙，他担心妻子在车上不安全，于是下车前锁好了门窗并叮嘱妻子不要离开。等他回来的时候发现妻子倒在血泊中，并且车上居然还有一个陌生人。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "妻子本来是怀孕的，飙车是为了赶快去医院接生。但妻子在难产中死了，而陌生人就是他们的孩子。"
    },
    {
        "puzzle": "有一个中年老男人，他已经结了婚，他有一*老婆'—个儿子'还有一*■情人。情人总是劝他和他老婆离婚，但是老男人拒绝了。有一天老男人回到了家，儿子和情人都死了！墙上还有用血写的一句话。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男人是一个双性恋，他的情人是个男的。情人想和男人结婚，但男人很喜欢自己的儿子，以情人无法生育为由拒绝离婚，情人很嫉妒、很绝望。一天趁着男人出门进到男人家里杀了儿子，用刀将自己的肚子划开把儿子塞进了自己的肚子里，并用血在墙上写下了\"我怀了你的孩子呦”。"
    },
    {
        "puzzle": "小男孩和父亲流浪荒岛时，他爸爸把身上的肉割给小男孩喝，并骗小男孩是海龟汤，小男孩获救之后去餐厅喝海龟汤，发现味道不对，然后接受不了就自尽了。",
        "question_list": [],
        "answer_list": [],
        "final_answer": "男子患有梦游症以及异食症，男子是殡仪师，男子在自己睡着的时候不小心把遗体吃了，然后消失的遗体的事被老板发现，之后老板骂了男子一顿，男子为了搞清遗体去了哪里，所以在遗体是涂了绿色颜料作为标记，等男子醒来之后发现自己的牙齿是绿的，但男子接受不了事实，因此跳楼了"
    },
    {
        "puzzle": "留学回家的我一次出门时，发现家门旁写了个“X”，我没有在意索性就擦掉了，可当天回到家时，发现那个X又出现了，心想可能是哪家孩子搞的吧，晚上我在家工作，突然从邻居家传来很大的动画片声，我被吵的无心工作，于是便敲响邻居家的门进行理论，第二天出门上班，门上的X却变成了0,正当我疑惑时，邻居家的门突然开了，而当我看到邻居时我也知道危险来了•",
        "question_list": [],
        "answer_list": [],
        "final_answer": "前段时间楼下一个小男孩被高空坠物砸死，他的父亲一直没找到凶手，伸冤无果的他便把整栋楼里的人都视为了凶手，他挨家挨户的进行了报复并留下记号，X代表已经报仇和无人居住，而0代表即将要下手的人家，因为之前我留学在外，邻居以为我家没人，而当我回国后，被邻居家的动画片声吵到并上面理论时，邻居发觉对面居然住的有人，随即变改了记号，第二天当我出门时，邻居也打开了房门把我抓了进去…"
    }
]